; ModuleID = '4vdtvoho5uk7e4tm'
source_filename = "4vdtvoho5uk7e4tm"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::result::Result<u64, std::io::error::Error>" = type { i64, [1 x i64] }
%"std::path::Path" = type { %"std::ffi::os_str::OsStr" }
%"std::ffi::os_str::OsStr" = type { %"std::sys::unix::os_str::Slice" }
%"std::sys::unix::os_str::Slice" = type { [0 x i8] }
%"core::result::Result<alloc::string::String, std::env::VarError>" = type { i64, [3 x i64] }
%"std::path::PathBuf" = type { %"std::ffi::os_str::OsString" }
%"std::ffi::os_str::OsString" = type { %"std::sys::unix::os_str::Buf" }
%"std::sys::unix::os_str::Buf" = type { %"alloc::vec::Vec<u8>" }
%"alloc::borrow::Cow<str>" = type { i64, [3 x i64] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%HeaderLocation = type { i64, [3 x i64] }
%"HeaderLocation::FromPath" = type { [1 x i64], %"alloc::string::String" }
%"core::result::Result<vcpkg::Library, vcpkg::Error>" = type { i64, [28 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "565c3163d6b300a07a4953a458247c2")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "f396ed9b63783996f7aefe80bb3873d6")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "897882e2df28881940e198a1ac2c141b")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !33, file: !2, size: 64, align: 64, elements: !35, templateParams: !23, identifier: "bac032de8fbf995ba135ee37d6e8e9a9")
!33 = !DINamespace(name: "error", scope: !34)
!34 = !DINamespace(name: "io", scope: !17)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !32, file: !2, baseType: !37, size: 64, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !38, file: !2, size: 64, align: 64, elements: !39, templateParams: !23, identifier: "7fbaf6988931ec2fc2cb79b1922a4bfe")
!38 = !DINamespace(name: "repr_bitpacked", scope: !33)
!39 = !{!40, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !42, file: !2, size: 64, align: 64, elements: !45, templateParams: !47, identifier: "4e101f063240e56be3c7c9224266b0fe")
!42 = !DINamespace(name: "non_null", scope: !43)
!43 = !DINamespace(name: "ptr", scope: !44)
!44 = !DINamespace(name: "core", scope: null)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !41, file: !2, baseType: !6, size: 64, align: 64)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "T", type: !7)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !37, file: !2, baseType: !50, align: 8)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !51, file: !2, align: 8, elements: !23, templateParams: !52, identifier: "3bfa5431dfa55fc3b0773ecc912b903f")
!51 = !DINamespace(name: "marker", scope: !44)
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !33, file: !2, size: 128, align: 64, elements: !55, templateParams: !23, identifier: "4e9d62219208f28c69d498232b6a39a7")
!55 = !{!56}
!56 = !DICompositeType(tag: DW_TAG_variant_part, scope: !54, file: !2, size: 128, align: 64, elements: !57, templateParams: !23, identifier: "4ff4860cd09ba202519770a834f08c6", discriminator: !146)
!57 = !{!58, !124, !128, !142}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !56, file: !2, baseType: !59, size: 128, align: 64, extraData: i64 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !54, file: !2, size: 128, align: 64, elements: !60, templateParams: !63, identifier: "f1967eb0aa257833e7da4e726a42cbf0")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !59, file: !2, baseType: !62, size: 32, align: 32, offset: 32)
!62 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "C", type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !33, file: !2, size: 192, align: 64, elements: !67, templateParams: !23, identifier: "43bb1ddfbbbd5357929fa5e7fcf3f45b")
!67 = !{!68, !113}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !66, file: !2, baseType: !69, size: 8, align: 8, offset: 128)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !33, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !71)
!70 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!72 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!82 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!83 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!84 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!85 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!86 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!87 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!88 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!89 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!90 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!91 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!92 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!93 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!94 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!95 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!96 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!97 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!98 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!99 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!100 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!101 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!102 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!103 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!104 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!105 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!106 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!107 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!108 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!109 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!110 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!111 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!112 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !66, file: !2, baseType: !114, size: 128, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !115, templateParams: !23, identifier: "7ba32488f5a5ccbb551f02550c337f6c")
!115 = !{!116, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !114, file: !2, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !23, identifier: "ecdc1cd72c10c8a3b8233864b3cf6972")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !114, file: !2, baseType: !120, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !121, size: 64, align: 64, dwarfAddressSpace: 0)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3, lowerBound: 0)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !56, file: !2, baseType: !125, size: 128, align: 64, extraData: i64 1)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !54, file: !2, size: 128, align: 64, elements: !126, templateParams: !63, identifier: "cd565106f250deeaf81c31f699aff516")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !69, size: 8, align: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !56, file: !2, baseType: !129, size: 128, align: 64, extraData: i64 2)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !54, file: !2, size: 128, align: 64, elements: !130, templateParams: !63, identifier: "7520bc529a65310efa9135426541a647")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !129, file: !2, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !33, file: !2, size: 192, align: 64, elements: !134, templateParams: !23, identifier: "fd534cc7a6dd804a84f964fd2ac2736a")
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !133, file: !2, baseType: !69, size: 8, align: 8, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !133, file: !2, baseType: !137, size: 128, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !138, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !137, file: !2, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !137, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !56, file: !2, baseType: !143, size: 128, align: 64, extraData: i64 3)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !54, file: !2, size: 128, align: 64, elements: !144, templateParams: !63, identifier: "874af41bfaf6f9f8eb98a98232ba696")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !143, file: !2, baseType: !65, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !54, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagArtificial)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "PREBUILT_BINDGEN_PATHS", linkageName: "_ZN18build_script_build8bindings22PREBUILT_BINDGEN_PATHS17hbe2ccef64dd911b8E", scope: !149, file: !151, line: 477, type: !152, isLocal: true, isDefinition: true, align: 64)
!149 = !DINamespace(name: "bindings", scope: !150)
!150 = !DINamespace(name: "build_script_build", scope: null)
!151 = !DIFile(filename: "libsqlite3-sys/build.rs", directory: "/home/dy3199/poc/RUSTSEC-2021-0128/rusqlite", checksumkind: CSK_MD5, checksum: "6e1e597c6cb162563774f7fc17ff7572")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !153, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !152, file: !2, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!157 = !{i32 7, !"PIC Level", i32 2}
!158 = !{i32 7, !"PIE Level", i32 2}
!159 = !{i32 2, !"RtLibUseGOT", i32 1}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !162, producer: "clang LLVM (rustc version 1.64.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !163, globals: !173)
!162 = !DIFile(filename: "libsqlite3-sys/build.rs/@/4vdtvoho5uk7e4tm", directory: "/home/dy3199/poc/RUSTSEC-2021-0128/rusqlite")
!163 = !{!69, !164}
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !165, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !168)
!165 = !DINamespace(name: "v1", scope: !166)
!166 = !DINamespace(name: "rt", scope: !167)
!167 = !DINamespace(name: "fmt", scope: !44)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!170 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!171 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!172 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!173 = !{!0, !24, !147}
!174 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17haf2ea210fcfe77d2E", scope: !176, file: !175, line: 2341, type: !179, scopeLine: 2341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !224)
!175 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "023588f502e704e6529afba2c7c3c287")
!176 = !DINamespace(name: "{impl#28}", scope: !177)
!177 = !DINamespace(name: "string", scope: !178)
!178 = !DINamespace(name: "alloc", scope: null)
!179 = !DISubroutineType(types: !180)
!180 = !{!137, !181, !212, !215}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !177, file: !2, size: 192, align: 64, elements: !183, templateParams: !23, identifier: "eb8ab00598fad2d9340900a5895e2643")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !182, file: !2, baseType: !185, size: 192, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !186, file: !2, size: 192, align: 64, elements: !187, templateParams: !209, identifier: "8763a7d1bc15d975f03494a2c65f5d4d")
!186 = !DINamespace(name: "vec", scope: !178)
!187 = !{!188, !211}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !2, baseType: !189, size: 128, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !190, file: !2, size: 128, align: 64, elements: !191, templateParams: !209, identifier: "9354fd3e3c024fba791a9332d2dedcbe")
!190 = !DINamespace(name: "raw_vec", scope: !178)
!191 = !{!192, !205, !206}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !189, file: !2, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !194, file: !2, size: 64, align: 64, elements: !195, templateParams: !201, identifier: "4929ea6f5129f45bbb6680fb17ecf7e")
!194 = !DINamespace(name: "unique", scope: !43)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !193, file: !2, baseType: !197, size: 64, align: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !42, file: !2, size: 64, align: 64, elements: !198, templateParams: !201, identifier: "81a29f094726bede821b28e09e533a6f")
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !197, file: !2, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !70)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !193, file: !2, baseType: !204, align: 8)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !51, file: !2, align: 8, elements: !23, templateParams: !201, identifier: "c93b3b0386f64597e494bf59040db53")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !189, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !189, file: !2, baseType: !207, align: 8)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !208, file: !2, align: 8, elements: !23, identifier: "876a5b60ae7e002a42831ead68b26880")
!208 = !DINamespace(name: "alloc", scope: !178)
!209 = !{!202, !210}
!210 = !DITemplateTypeParameter(name: "A", type: !207)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !213, file: !2, align: 8, elements: !23, identifier: "4abedb4d29c5508e38ca774c70bfa076")
!213 = !DINamespace(name: "range", scope: !214)
!214 = !DINamespace(name: "ops", scope: !44)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !217, file: !2, size: 192, align: 64, elements: !219, templateParams: !23, identifier: "221b8795f585d602f0086fb6a2d86867")
!217 = !DINamespace(name: "location", scope: !218)
!218 = !DINamespace(name: "panic", scope: !44)
!219 = !{!220, !221, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !216, file: !2, baseType: !137, size: 128, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !216, file: !2, baseType: !222, size: 32, align: 32, offset: 128)
!222 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !216, file: !2, baseType: !222, size: 32, align: 32, offset: 160)
!224 = !{!225, !226}
!225 = !DILocalVariable(name: "self", arg: 1, scope: !174, file: !175, line: 2341, type: !181)
!226 = !DILocalVariable(name: "_index", arg: 2, scope: !174, file: !175, line: 2341, type: !212)
!227 = !DILocation(line: 2341, column: 14, scope: !174)
!228 = !DILocation(line: 2341, column: 21, scope: !174)
!229 = !DILocation(line: 2342, column: 43, scope: !174)
!230 = !{!"rawptr"}
!231 = !DILocalVariable(name: "self", scope: !232, file: !175, line: 2342, type: !242, align: 8)
!232 = !DILexicalBlockFile(scope: !233, file: !175, discriminator: 0)
!233 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h01bd32b3bdea5402E", scope: !235, file: !234, line: 2531, type: !236, scopeLine: 2531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !209, retainedNodes: !243)
!234 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ccced07f4d2284e276bdff9c5cb81e82")
!235 = !DINamespace(name: "{impl#10}", scope: !186)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !242}
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !239, templateParams: !23, identifier: "7d49e60d2ca720f66806f7375f860e2")
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !238, file: !2, baseType: !140, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !238, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!243 = !{!231}
!244 = !DILocation(line: 2342, column: 43, scope: !232, inlinedAt: !229)
!245 = !DILocalVariable(name: "data", scope: !246, file: !175, line: 2342, type: !200, align: 8)
!246 = !DILexicalBlockFile(scope: !247, file: !175, discriminator: 0)
!247 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h1541a4a6e59fd69eE", scope: !249, file: !248, line: 90, type: !251, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !253)
!248 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "088c8c8f39879d7962a98cde38c490e4")
!249 = !DINamespace(name: "raw", scope: !250)
!250 = !DINamespace(name: "slice", scope: !44)
!251 = !DISubroutineType(types: !252)
!252 = !{!238, !200, !9}
!253 = !{!245, !254, !255}
!254 = !DILocalVariable(name: "len", scope: !246, file: !175, line: 2342, type: !9, align: 8)
!255 = !DILocalVariable(name: "runtime", scope: !256, file: !175, line: 2342, type: !259, align: 8)
!256 = !DILexicalBlockFile(scope: !257, file: !175, discriminator: 0)
!257 = distinct !DILexicalBlock(scope: !247, file: !258, line: 2319, column: 13)
!258 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "522b6baddd07f8f08b1c42bc11a3b4d7")
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !260, file: !2, size: 128, align: 64, elements: !261, templateParams: !23, identifier: "b67666f88102bede2df5d7a4c2052977")
!260 = !DINamespace(name: "from_raw_parts", scope: !249)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__data", scope: !259, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const u8", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__len", scope: !259, file: !2, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !DILocation(line: 2342, column: 43, scope: !246, inlinedAt: !267)
!267 = !DILocation(line: 2532, column: 18, scope: !233, inlinedAt: !229)
!268 = !DILocalVariable(name: "data", scope: !269, file: !175, line: 2342, type: !200, align: 8)
!269 = !DILexicalBlockFile(scope: !270, file: !175, discriminator: 0)
!270 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17hbdb0d0b976038085E", scope: !43, file: !271, line: 694, type: !272, scopeLine: 694, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !278)
!271 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8347f3797ea1142e866e50608b9a2204")
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !200, !9}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !275, templateParams: !23, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !274, file: !2, baseType: !140, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !274, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!278 = !{!268, !279}
!279 = !DILocalVariable(name: "len", scope: !269, file: !175, line: 2342, type: !9, align: 8)
!280 = !DILocation(line: 2342, column: 43, scope: !269, inlinedAt: !281)
!281 = !DILocation(line: 97, column: 11, scope: !247, inlinedAt: !267)
!282 = !DILocalVariable(name: "self", scope: !283, file: !175, line: 2342, type: !200, align: 8)
!283 = !DILexicalBlockFile(scope: !284, file: !175, discriminator: 0)
!284 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h8f3a2a1aa3ae57dfE", scope: !286, file: !285, line: 46, type: !288, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !291, retainedNodes: !290)
!285 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "472568b60919158596db0f55d2635676")
!286 = !DINamespace(name: "{impl#0}", scope: !287)
!287 = !DINamespace(name: "const_ptr", scope: !43)
!288 = !DISubroutineType(types: !289)
!289 = !{!6, !200}
!290 = !{!282}
!291 = !{!202, !292}
!292 = !DITemplateTypeParameter(name: "U", type: !7)
!293 = !DILocation(line: 2342, column: 43, scope: !283, inlinedAt: !294)
!294 = !DILocation(line: 695, column: 20, scope: !270, inlinedAt: !281)
!295 = !DILocalVariable(name: "data_address", scope: !296, file: !175, line: 2342, type: !6, align: 8)
!296 = !DILexicalBlockFile(scope: !297, file: !175, discriminator: 0)
!297 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h9192cb32da69a8d6E", scope: !299, file: !298, line: 110, type: !300, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !302)
!298 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c0696840ef99c8132b364245b959d8b")
!299 = !DINamespace(name: "metadata", scope: !43)
!300 = !DISubroutineType(types: !301)
!301 = !{!274, !6, !9}
!302 = !{!295, !303}
!303 = !DILocalVariable(name: "metadata", scope: !296, file: !175, line: 2342, type: !9, align: 8)
!304 = !DILocation(line: 2342, column: 43, scope: !296, inlinedAt: !305)
!305 = !DILocation(line: 695, column: 5, scope: !270, inlinedAt: !281)
!306 = !DILocalVariable(name: "v", scope: !307, file: !175, line: 2342, type: !238, align: 8)
!307 = !DILexicalBlockFile(scope: !308, file: !175, discriminator: 0)
!308 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN4core3str8converts19from_utf8_unchecked17hb68e48ed5341a43cE", scope: !310, file: !309, line: 170, type: !312, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !314)
!309 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "459d256946ab11c35b95264d728167a0")
!310 = !DINamespace(name: "converts", scope: !311)
!311 = !DINamespace(name: "str", scope: !44)
!312 = !DISubroutineType(types: !313)
!313 = !{!137, !238}
!314 = !{!306}
!315 = !DILocation(line: 2342, column: 18, scope: !307, inlinedAt: !316)
!316 = !DILocation(line: 2342, column: 18, scope: !174)
!317 = !{i64 1}
!318 = !DILocation(line: 2343, column: 6, scope: !174)
!319 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h0e1f87e79842954fE", scope: !321, file: !320, line: 118, type: !323, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !329, retainedNodes: !325)
!320 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!321 = !DINamespace(name: "backtrace", scope: !322)
!322 = !DINamespace(name: "sys_common", scope: !17)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !20}
!325 = !{!326, !327}
!326 = !DILocalVariable(name: "f", arg: 1, scope: !319, file: !320, line: 118, type: !20)
!327 = !DILocalVariable(name: "result", scope: !328, file: !320, line: 122, type: !7, align: 1)
!328 = distinct !DILexicalBlock(scope: !319, file: !320, line: 122, column: 5)
!329 = !{!330, !48}
!330 = !DITemplateTypeParameter(name: "F", type: !20)
!331 = !DILocation(line: 122, column: 9, scope: !328)
!332 = !DILocation(line: 118, column: 43, scope: !319)
!333 = !DILocalVariable(name: "dummy", scope: !334, file: !320, line: 125, type: !7, align: 1)
!334 = !DILexicalBlockFile(scope: !335, file: !320, discriminator: 0)
!335 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hd943dcbfe87e0cacE", scope: !337, file: !336, line: 224, type: !338, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !47, retainedNodes: !340)
!336 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "fa192aef52724158854d1e5ce88991e5")
!337 = !DINamespace(name: "hint", scope: !44)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !7}
!340 = !{!333}
!341 = !DILocation(line: 125, column: 5, scope: !334, inlinedAt: !342)
!342 = !DILocation(line: 125, column: 5, scope: !328)
!343 = !DILocation(line: 122, column: 18, scope: !319)
!344 = !{i32 3341235}
!345 = !DILocation(line: 128, column: 2, scope: !319)
!346 = !DILocation(line: 128, column: 1, scope: !319)
!347 = !DILocation(line: 118, column: 1, scope: !319)
!348 = distinct !DISubprogram(name: "copy<alloc::string::String, &std::path::Path>", linkageName: "_ZN3std2fs4copy17h38538c17e2bace40E", scope: !350, file: !349, line: 1783, type: !351, scopeLine: 1783, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !394, retainedNodes: !391)
!349 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/fs.rs", directory: "", checksumkind: CSK_MD5, checksum: "360a45eaa32cf1608c316b985fe91211")
!350 = !DINamespace(name: "fs", scope: !17)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !182, !371}
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, std::io::error::Error>", scope: !354, file: !2, size: 128, align: 64, elements: !355, templateParams: !23, identifier: "5dc531ee6a3d8fde778fd62be11d58f9")
!354 = !DINamespace(name: "result", scope: !44)
!355 = !{!356}
!356 = !DICompositeType(tag: DW_TAG_variant_part, scope: !353, file: !2, size: 128, align: 64, elements: !357, templateParams: !23, identifier: "65e0792a9e9e759488c6752377bb3592", discriminator: !370)
!357 = !{!358, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !356, file: !2, baseType: !359, size: 128, align: 64, extraData: i64 0)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !353, file: !2, size: 128, align: 64, elements: !360, templateParams: !363, identifier: "3d6ea6bde362e1f7d02a05f9bd45b107")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !359, file: !2, baseType: !362, size: 64, align: 64, offset: 64)
!362 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!363 = !{!364, !365}
!364 = !DITemplateTypeParameter(name: "T", type: !362)
!365 = !DITemplateTypeParameter(name: "E", type: !32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !356, file: !2, baseType: !367, size: 128, align: 64, extraData: i64 1)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !353, file: !2, size: 128, align: 64, elements: !368, templateParams: !363, identifier: "1fd13cac0e4ce093f1eddb04f268d773")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !367, file: !2, baseType: !32, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "&std::path::Path", file: !2, size: 128, align: 64, elements: !372, templateParams: !23, identifier: "64e60a3d43cc9ef8afb076e162ea41")
!372 = !{!373, !390}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !371, file: !2, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Path", scope: !376, file: !2, align: 8, elements: !377, templateParams: !23, identifier: "c1ff1df4f41887e6fb44dd638b0e0744")
!376 = !DINamespace(name: "path", scope: !17)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !375, file: !2, baseType: !379, align: 8)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsStr", scope: !380, file: !2, align: 8, elements: !382, templateParams: !23, identifier: "9b26581c3f49fbd5c5354be4de75ba8")
!380 = !DINamespace(name: "os_str", scope: !381)
!381 = !DINamespace(name: "ffi", scope: !17)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !379, file: !2, baseType: !384, align: 8)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slice", scope: !385, file: !2, align: 8, elements: !388, templateParams: !23, identifier: "522f7429f475b619694083fb7d5a2e84")
!385 = !DINamespace(name: "os_str", scope: !386)
!386 = !DINamespace(name: "unix", scope: !387)
!387 = !DINamespace(name: "sys", scope: !17)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !384, file: !2, baseType: !70, align: 8)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!391 = !{!392, !393}
!392 = !DILocalVariable(name: "from", arg: 1, scope: !348, file: !349, line: 1783, type: !182)
!393 = !DILocalVariable(name: "to", arg: 2, scope: !348, file: !349, line: 1783, type: !371)
!394 = !{!395, !396}
!395 = !DITemplateTypeParameter(name: "P", type: !182)
!396 = !DITemplateTypeParameter(name: "Q", type: !371)
!397 = !DILocation(line: 1783, column: 45, scope: !348)
!398 = !DILocation(line: 1783, column: 54, scope: !348)
!399 = !DILocation(line: 1784, column: 18, scope: !348)
!400 = !DILocation(line: 1785, column: 1, scope: !348)
!401 = !DILocation(line: 1784, column: 33, scope: !348)
!402 = !DILocation(line: 1784, column: 5, scope: !348)
!403 = !DILocation(line: 1783, column: 1, scope: !348)
!404 = !DILocation(line: 1785, column: 2, scope: !348)
!405 = distinct !DISubprogram(name: "copy<&str, &std::path::Path>", linkageName: "_ZN3std2fs4copy17h7abe85fee71bcff1E", scope: !350, file: !349, line: 1783, type: !406, scopeLine: 1783, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !411, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!353, !137, !371}
!408 = !{!409, !410}
!409 = !DILocalVariable(name: "from", arg: 1, scope: !405, file: !349, line: 1783, type: !137)
!410 = !DILocalVariable(name: "to", arg: 2, scope: !405, file: !349, line: 1783, type: !371)
!411 = !{!412, !396}
!412 = !DITemplateTypeParameter(name: "P", type: !137)
!413 = !DILocation(line: 1783, column: 45, scope: !405)
!414 = !DILocation(line: 1783, column: 54, scope: !405)
!415 = !DILocation(line: 1784, column: 18, scope: !405)
!416 = !DILocation(line: 1785, column: 1, scope: !405)
!417 = !DILocation(line: 1784, column: 33, scope: !405)
!418 = !DILocation(line: 1784, column: 5, scope: !405)
!419 = !DILocation(line: 1783, column: 1, scope: !405)
!420 = !DILocation(line: 1785, column: 2, scope: !405)
!421 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h0c1973654d55ead5E", scope: !16, file: !422, line: 139, type: !423, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !47, retainedNodes: !427)
!422 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !20, !425, !426}
!425 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !{!428, !429, !430, !431}
!428 = !DILocalVariable(name: "main", arg: 1, scope: !421, file: !422, line: 140, type: !20)
!429 = !DILocalVariable(name: "argc", arg: 2, scope: !421, file: !422, line: 141, type: !425)
!430 = !DILocalVariable(name: "argv", arg: 3, scope: !421, file: !422, line: 142, type: !426)
!431 = !DILocalVariable(name: "v", scope: !432, file: !422, line: 144, type: !425, align: 8)
!432 = distinct !DILexicalBlock(scope: !421, file: !422, line: 144, column: 5)
!433 = !DILocation(line: 140, column: 5, scope: !421)
!434 = !DILocation(line: 141, column: 5, scope: !421)
!435 = !DILocation(line: 142, column: 5, scope: !421)
!436 = !DILocation(line: 145, column: 10, scope: !421)
!437 = !DILocation(line: 145, column: 9, scope: !421)
!438 = !DILocation(line: 144, column: 17, scope: !421)
!439 = !DILocation(line: 144, column: 12, scope: !421)
!440 = !DILocation(line: 144, column: 12, scope: !432)
!441 = !DILocation(line: 150, column: 2, scope: !421)
!442 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h7fe7bab926779946E", scope: !15, file: !422, line: 145, type: !443, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !47, retainedNodes: !446)
!443 = !DISubroutineType(types: !444)
!444 = !{!62, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!446 = !{!447}
!447 = !DILocalVariable(name: "main", scope: !442, file: !422, line: 140, type: !20, align: 8)
!448 = !{i64 8}
!449 = !DILocation(line: 140, column: 5, scope: !442)
!450 = !DILocalVariable(name: "self", scope: !451, file: !422, line: 145, type: !454, align: 1)
!451 = !DILexicalBlockFile(scope: !452, file: !422, discriminator: 0)
!452 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hd8af61841969f6f1E", scope: !454, file: !453, line: 1804, type: !463, scopeLine: 1804, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !465)
!453 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "0e922fc53c161078e5cdc7db8af68845")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !455, file: !2, size: 8, align: 8, elements: !456, templateParams: !23, identifier: "34833ea77da7e65050ab59ab2920d5b1")
!455 = !DINamespace(name: "process", scope: !17)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !2, baseType: !458, size: 8, align: 8)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !459, file: !2, size: 8, align: 8, elements: !461, templateParams: !23, identifier: "ad1dce0e523bc5db9bfe6837ee1d8946")
!459 = !DINamespace(name: "process_common", scope: !460)
!460 = !DINamespace(name: "process", scope: !386)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !458, file: !2, baseType: !70, size: 8, align: 8)
!463 = !DISubroutineType(types: !464)
!464 = !{!62, !454}
!465 = !{!450}
!466 = !DILocation(line: 145, column: 18, scope: !451, inlinedAt: !467)
!467 = !DILocation(line: 145, column: 18, scope: !442)
!468 = !DILocation(line: 145, column: 77, scope: !442)
!469 = !DILocalVariable(name: "self", scope: !470, file: !422, line: 145, type: !475, align: 8)
!470 = !DILexicalBlockFile(scope: !471, file: !422, discriminator: 0)
!471 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h87032b6004529c39E", scope: !458, file: !472, line: 485, type: !473, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !476)
!472 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!473 = !DISubroutineType(types: !474)
!474 = !{!62, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!476 = !{!469}
!477 = !DILocation(line: 145, column: 18, scope: !470, inlinedAt: !478)
!478 = !DILocation(line: 1805, column: 9, scope: !452, inlinedAt: !467)
!479 = !DILocation(line: 145, column: 100, scope: !442)
!480 = distinct !DISubprogram(name: "var<alloc::string::String>", linkageName: "_ZN3std3env3var17hc28e7badfe305402E", scope: !482, file: !481, line: 227, type: !483, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !520, retainedNodes: !518)
!481 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/env.rs", directory: "", checksumkind: CSK_MD5, checksum: "eb997a355b779581a425ead6cf0f1655")
!482 = !DINamespace(name: "env", scope: !17)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !182}
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<alloc::string::String, std::env::VarError>", scope: !354, file: !2, size: 256, align: 64, elements: !486, templateParams: !23, identifier: "c4544bdbfa321ed4f981f5d562e8c159")
!486 = !{!487}
!487 = !DICompositeType(tag: DW_TAG_variant_part, scope: !485, file: !2, size: 256, align: 64, elements: !488, templateParams: !23, identifier: "77682f1c60b1ea13d60713443d9e87b1", discriminator: !517)
!488 = !{!489, !513}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !487, file: !2, baseType: !490, size: 256, align: 64, extraData: i64 0)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !485, file: !2, size: 256, align: 64, elements: !491, templateParams: !493, identifier: "7dc5558260ff5aa83d58926eb476066f")
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !490, file: !2, baseType: !182, size: 192, align: 64, offset: 64)
!493 = !{!494, !495}
!494 = !DITemplateTypeParameter(name: "T", type: !182)
!495 = !DITemplateTypeParameter(name: "E", type: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "VarError", scope: !482, file: !2, size: 192, align: 64, elements: !497, templateParams: !23, identifier: "bbfd2c83839e75291b5264c54bab079d")
!497 = !{!498}
!498 = !DICompositeType(tag: DW_TAG_variant_part, scope: !496, file: !2, size: 192, align: 64, elements: !499, templateParams: !23, identifier: "eb5d410fac5725432809c7adfd5f69f9", discriminator: !512)
!499 = !{!500, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "NotPresent", scope: !498, file: !2, baseType: !501, size: 192, align: 64, extraData: i64 0)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotPresent", scope: !496, file: !2, size: 192, align: 64, elements: !23, identifier: "28dba17a251fb0c0227d8f48b3c2f2d7")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "NotUnicode", scope: !498, file: !2, baseType: !503, size: 192, align: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotUnicode", scope: !496, file: !2, size: 192, align: 64, elements: !504, templateParams: !23, identifier: "3409cc7ec0a4ebb448b5a139190ff40c")
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !503, file: !2, baseType: !506, size: 192, align: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsString", scope: !380, file: !2, size: 192, align: 64, elements: !507, templateParams: !23, identifier: "64449d55bd377d782ce14d2cdb37c876")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !506, file: !2, baseType: !509, size: 192, align: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buf", scope: !385, file: !2, size: 192, align: 64, elements: !510, templateParams: !23, identifier: "935141098bda4a87297e2dfab66608a4")
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !509, file: !2, baseType: !185, size: 192, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, scope: !496, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !487, file: !2, baseType: !514, size: 256, align: 64, extraData: i64 1)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !485, file: !2, size: 256, align: 64, elements: !515, templateParams: !493, identifier: "f615da685d1c8b5fe698767924195c7b")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !514, file: !2, baseType: !496, size: 192, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !485, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!518 = !{!519}
!519 = !DILocalVariable(name: "key", arg: 1, scope: !480, file: !481, line: 227, type: !182)
!520 = !{!521}
!521 = !DITemplateTypeParameter(name: "K", type: !182)
!522 = !DILocation(line: 227, column: 29, scope: !480)
!523 = !DILocation(line: 228, column: 10, scope: !480)
!524 = !DILocation(line: 229, column: 1, scope: !480)
!525 = !DILocation(line: 228, column: 5, scope: !480)
!526 = !DILocation(line: 227, column: 1, scope: !480)
!527 = !DILocation(line: 229, column: 2, scope: !480)
!528 = distinct !DISubprogram(name: "set_var<&str, std::path::PathBuf>", linkageName: "_ZN3std3env7set_var17h5bf5fa45aa95334bE", scope: !482, file: !481, line: 347, type: !529, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !537, retainedNodes: !534)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !137, !531}
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathBuf", scope: !376, file: !2, size: 192, align: 64, elements: !532, templateParams: !23, identifier: "631131e2aeb875dcd0e4b40fc59a33d4")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !531, file: !2, baseType: !506, size: 192, align: 64)
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "key", arg: 1, scope: !528, file: !481, line: 347, type: !137)
!536 = !DILocalVariable(name: "value", arg: 2, scope: !528, file: !481, line: 347, type: !531)
!537 = !{!538, !539}
!538 = !DITemplateTypeParameter(name: "K", type: !137)
!539 = !DITemplateTypeParameter(name: "V", type: !531)
!540 = !DILocation(line: 347, column: 50, scope: !528)
!541 = !DILocation(line: 347, column: 58, scope: !528)
!542 = !DILocation(line: 348, column: 14, scope: !528)
!543 = !DILocation(line: 349, column: 1, scope: !528)
!544 = !DILocation(line: 348, column: 28, scope: !528)
!545 = !DILocation(line: 348, column: 5, scope: !528)
!546 = !DILocation(line: 347, column: 1, scope: !528)
!547 = !DILocation(line: 349, column: 2, scope: !528)
!548 = distinct !DISubprogram(name: "as_ref", linkageName: "_ZN3std3ffi6os_str103_$LT$impl$u20$core..convert..AsRef$LT$std..ffi..os_str..OsStr$GT$$u20$for$u20$alloc..string..String$GT$6as_ref17h5f1352336594927eE", scope: !550, file: !549, line: 1320, type: !551, scopeLine: 1320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !558)
!549 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/ffi/os_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "1034ec934c8ecfc8e46ec72c50ae72fa")
!550 = !DINamespace(name: "{impl#54}", scope: !380)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !181}
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "&std::ffi::os_str::OsStr", file: !2, size: 128, align: 64, elements: !554, templateParams: !23, identifier: "be595a3017bd3eeda0a829c682aa8177")
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !553, file: !2, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64, dwarfAddressSpace: 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!558 = !{!559}
!559 = !DILocalVariable(name: "self", arg: 1, scope: !548, file: !549, line: 1320, type: !181)
!560 = !DILocation(line: 1320, column: 15, scope: !548)
!561 = !DILocation(line: 1321, column: 11, scope: !548)
!562 = !DILocation(line: 1321, column: 9, scope: !548)
!563 = !DILocalVariable(name: "self", scope: !564, file: !549, line: 1321, type: !137, align: 8)
!564 = distinct !DISubprogram(name: "as_ref", linkageName: "_ZN3std3ffi6os_str85_$LT$impl$u20$core..convert..AsRef$LT$std..ffi..os_str..OsStr$GT$$u20$for$u20$str$GT$6as_ref17h83372d533ff930fcE", scope: !565, file: !549, line: 1312, type: !566, scopeLine: 1312, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !568)
!565 = !DINamespace(name: "{impl#53}", scope: !380)
!566 = !DISubroutineType(types: !567)
!567 = !{!553, !137}
!568 = !{!563}
!569 = !DILocation(line: 1321, column: 9, scope: !564, inlinedAt: !562)
!570 = !DILocalVariable(name: "s", scope: !571, file: !549, line: 1321, type: !137, align: 8)
!571 = !DILexicalBlockFile(scope: !572, file: !549, discriminator: 0)
!572 = distinct !DISubprogram(name: "from_str", linkageName: "_ZN3std3sys4unix6os_str5Slice8from_str17h13f563e712bf3b0aE", scope: !384, file: !573, line: 194, type: !574, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !581)
!573 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/sys/unix/os_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "3fffa48778a70506c3ad2634683a31ef")
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !137}
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "&std::sys::unix::os_str::Slice", file: !2, size: 128, align: 64, elements: !577, templateParams: !23, identifier: "a942202ee446b0d651185bde7026b9")
!577 = !{!578, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !576, file: !2, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64, dwarfAddressSpace: 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !576, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!581 = !{!570}
!582 = !DILocation(line: 1321, column: 9, scope: !571, inlinedAt: !583)
!583 = !DILocation(line: 1313, column: 27, scope: !564, inlinedAt: !562)
!584 = !DILocalVariable(name: "self", scope: !585, file: !549, line: 1321, type: !137, align: 8)
!585 = !DILexicalBlockFile(scope: !586, file: !549, discriminator: 0)
!586 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17hf813db6ec02baedaE", scope: !588, file: !587, line: 323, type: !589, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !591)
!587 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8352df8206aaaed06ac4b697a5784e45")
!588 = !DINamespace(name: "{impl#0}", scope: !311)
!589 = !DISubroutineType(types: !590)
!590 = !{!238, !137}
!591 = !{!584}
!592 = !DILocation(line: 1321, column: 9, scope: !585, inlinedAt: !593)
!593 = !DILocation(line: 195, column: 30, scope: !572, inlinedAt: !583)
!594 = !DILocalVariable(name: "s", scope: !595, file: !549, line: 1321, type: !238, align: 8)
!595 = !DILexicalBlockFile(scope: !596, file: !549, discriminator: 0)
!596 = distinct !DISubprogram(name: "from_u8_slice", linkageName: "_ZN3std3sys4unix6os_str5Slice13from_u8_slice17h1de6e60956f03d63E", scope: !384, file: !573, line: 189, type: !597, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!576, !238}
!599 = !{!594}
!600 = !DILocation(line: 1321, column: 9, scope: !595, inlinedAt: !601)
!601 = !DILocation(line: 195, column: 9, scope: !572, inlinedAt: !583)
!602 = !DILocalVariable(name: "inner", scope: !603, file: !549, line: 1321, type: !576, align: 8)
!603 = distinct !DISubprogram(name: "from_inner", linkageName: "_ZN3std3ffi6os_str5OsStr10from_inner17h1a63c8cd75cbae50E", scope: !379, file: !549, line: 663, type: !604, scopeLine: 663, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{!553, !576}
!606 = !{!602}
!607 = !DILocation(line: 1321, column: 9, scope: !603, inlinedAt: !608)
!608 = !DILocation(line: 1313, column: 9, scope: !564, inlinedAt: !562)
!609 = !DILocation(line: 1322, column: 6, scope: !548)
!610 = distinct !DISubprogram(name: "as_slice", linkageName: "_ZN3std3sys4unix6os_str3Buf8as_slice17h31a2af57ea27db9eE", scope: !509, file: !573, line: 142, type: !611, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !614)
!611 = !DISubroutineType(types: !612)
!612 = !{!576, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::os_str::Buf", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!614 = !{!615}
!615 = !DILocalVariable(name: "self", arg: 1, scope: !610, file: !573, line: 142, type: !613)
!616 = !DILocation(line: 142, column: 21, scope: !610)
!617 = !DILocation(line: 146, column: 35, scope: !610)
!618 = !DILocalVariable(name: "self", scope: !619, file: !573, line: 146, type: !242, align: 8)
!619 = !DILexicalBlockFile(scope: !620, file: !573, discriminator: 0)
!620 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h01bd32b3bdea5402E", scope: !235, file: !234, line: 2531, type: !236, scopeLine: 2531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !209, retainedNodes: !621)
!621 = !{!618}
!622 = !DILocation(line: 146, column: 34, scope: !619, inlinedAt: !623)
!623 = !DILocation(line: 146, column: 34, scope: !610)
!624 = !DILocalVariable(name: "data", scope: !625, file: !573, line: 146, type: !200, align: 8)
!625 = !DILexicalBlockFile(scope: !626, file: !573, discriminator: 0)
!626 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h1541a4a6e59fd69eE", scope: !249, file: !248, line: 90, type: !251, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !627)
!627 = !{!624, !628, !629}
!628 = !DILocalVariable(name: "len", scope: !625, file: !573, line: 146, type: !9, align: 8)
!629 = !DILocalVariable(name: "runtime", scope: !630, file: !573, line: 146, type: !259, align: 8)
!630 = !DILexicalBlockFile(scope: !631, file: !573, discriminator: 0)
!631 = distinct !DILexicalBlock(scope: !626, file: !258, line: 2319, column: 13)
!632 = !DILocation(line: 146, column: 34, scope: !625, inlinedAt: !633)
!633 = !DILocation(line: 2532, column: 18, scope: !620, inlinedAt: !623)
!634 = !DILocalVariable(name: "data", scope: !635, file: !573, line: 146, type: !200, align: 8)
!635 = !DILexicalBlockFile(scope: !636, file: !573, discriminator: 0)
!636 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17hbdb0d0b976038085E", scope: !43, file: !271, line: 694, type: !272, scopeLine: 694, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !637)
!637 = !{!634, !638}
!638 = !DILocalVariable(name: "len", scope: !635, file: !573, line: 146, type: !9, align: 8)
!639 = !DILocation(line: 146, column: 34, scope: !635, inlinedAt: !640)
!640 = !DILocation(line: 97, column: 11, scope: !626, inlinedAt: !633)
!641 = !DILocalVariable(name: "self", scope: !642, file: !573, line: 146, type: !200, align: 8)
!642 = !DILexicalBlockFile(scope: !643, file: !573, discriminator: 0)
!643 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h8f3a2a1aa3ae57dfE", scope: !286, file: !285, line: 46, type: !288, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !291, retainedNodes: !644)
!644 = !{!641}
!645 = !DILocation(line: 146, column: 34, scope: !642, inlinedAt: !646)
!646 = !DILocation(line: 695, column: 20, scope: !636, inlinedAt: !640)
!647 = !DILocalVariable(name: "data_address", scope: !648, file: !573, line: 146, type: !6, align: 8)
!648 = !DILexicalBlockFile(scope: !649, file: !573, discriminator: 0)
!649 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h9192cb32da69a8d6E", scope: !299, file: !298, line: 110, type: !300, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !201, retainedNodes: !650)
!650 = !{!647, !651}
!651 = !DILocalVariable(name: "metadata", scope: !648, file: !573, line: 146, type: !9, align: 8)
!652 = !DILocation(line: 146, column: 34, scope: !648, inlinedAt: !653)
!653 = !DILocation(line: 695, column: 5, scope: !636, inlinedAt: !640)
!654 = !DILocation(line: 146, column: 18, scope: !610)
!655 = !DILocation(line: 147, column: 6, scope: !610)
!656 = distinct !DISubprogram(name: "to_string_lossy", linkageName: "_ZN3std4path4Path15to_string_lossy17h6dcfe681c09eac21E", scope: !375, file: !657, line: 2044, type: !658, scopeLine: 2044, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !676)
!657 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/std/src/path.rs", directory: "", checksumkind: CSK_MD5, checksum: "e0e532703d778bc241d4779fa2808a32")
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !371}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cow<str>", scope: !661, file: !2, size: 256, align: 64, elements: !662, templateParams: !23, identifier: "e48db592109fc1acadcccac621b8d60e")
!661 = !DINamespace(name: "borrow", scope: !178)
!662 = !{!663}
!663 = !DICompositeType(tag: DW_TAG_variant_part, scope: !660, file: !2, size: 256, align: 64, elements: !664, templateParams: !23, identifier: "6e2c9b702d616db4ab45c8c9894a09b5", discriminator: !675)
!664 = !{!665, !671}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Borrowed", scope: !663, file: !2, baseType: !666, size: 256, align: 64, extraData: i64 0)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Borrowed", scope: !660, file: !2, size: 256, align: 64, elements: !667, templateParams: !669, identifier: "d4068ed9ead1b1e1580f45ba6f878c43")
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !666, file: !2, baseType: !137, size: 128, align: 64, offset: 64)
!669 = !{!670}
!670 = !DITemplateTypeParameter(name: "B", type: !70)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Owned", scope: !663, file: !2, baseType: !672, size: 256, align: 64, extraData: i64 1)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Owned", scope: !660, file: !2, size: 256, align: 64, elements: !673, templateParams: !669, identifier: "23b55df37bd548115a63a3a94b64c845")
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !672, file: !2, baseType: !182, size: 192, align: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, scope: !660, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!676 = !{!677}
!677 = !DILocalVariable(name: "self", arg: 1, scope: !656, file: !657, line: 2044, type: !371)
!678 = !DILocation(line: 2044, column: 28, scope: !656)
!679 = !DILocation(line: 2045, column: 9, scope: !656)
!680 = !DILocalVariable(name: "self", scope: !681, file: !657, line: 2045, type: !553, align: 8)
!681 = !DILexicalBlockFile(scope: !682, file: !657, discriminator: 0)
!682 = distinct !DISubprogram(name: "to_string_lossy", linkageName: "_ZN3std3ffi6os_str5OsStr15to_string_lossy17h132112a3d209b611E", scope: !379, file: !549, line: 747, type: !683, scopeLine: 747, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!660, !553}
!685 = !{!680}
!686 = !DILocation(line: 2045, column: 9, scope: !681, inlinedAt: !679)
!687 = !DILocation(line: 2046, column: 6, scope: !656)
!688 = distinct !DISubprogram(name: "as_ref", linkageName: "_ZN3std4path95_$LT$impl$u20$core..convert..AsRef$LT$std..path..Path$GT$$u20$for$u20$alloc..string..String$GT$6as_ref17h7c78c2d009e41fe0E", scope: !689, file: !657, line: 3043, type: !690, scopeLine: 3043, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !692)
!689 = !DINamespace(name: "{impl#77}", scope: !376)
!690 = !DISubroutineType(types: !691)
!691 = !{!371, !181}
!692 = !{!693}
!693 = !DILocalVariable(name: "self", arg: 1, scope: !688, file: !657, line: 3043, type: !181)
!694 = !DILocation(line: 3043, column: 15, scope: !688)
!695 = !DILocation(line: 3044, column: 9, scope: !688)
!696 = !DILocation(line: 3045, column: 6, scope: !688)
!697 = distinct !DISubprogram(name: "ne<alloc::string::String, str>", linkageName: "_ZN4core3cmp5impls69_$LT$impl$u20$core..cmp..PartialEq$LT$$RF$B$GT$$u20$for$u20$$RF$A$GT$2ne17hf1431e3b64a23e49E", scope: !699, file: !698, line: 1479, type: !702, scopeLine: 1479, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !710, retainedNodes: !707)
!698 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "ab23074fa028287825e74e2bf421a441")
!699 = !DINamespace(name: "{impl#9}", scope: !700)
!700 = !DINamespace(name: "impls", scope: !701)
!701 = !DINamespace(name: "cmp", scope: !44)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !705, !706}
!704 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&alloc::string::String", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!707 = !{!708, !709}
!708 = !DILocalVariable(name: "self", arg: 1, scope: !697, file: !698, line: 1479, type: !705)
!709 = !DILocalVariable(name: "other", arg: 2, scope: !697, file: !698, line: 1479, type: !706)
!710 = !{!711, !670}
!711 = !DITemplateTypeParameter(name: "A", type: !182)
!712 = !DILocation(line: 1479, column: 15, scope: !697)
!713 = !DILocation(line: 1479, column: 22, scope: !697)
!714 = !DILocation(line: 1480, column: 27, scope: !697)
!715 = !DILocation(line: 1480, column: 34, scope: !697)
!716 = !DILocation(line: 1480, column: 13, scope: !697)
!717 = !DILocation(line: 1481, column: 10, scope: !697)
!718 = distinct !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h86765fb2d3e53c0bE", scope: !720, file: !719, line: 512, type: !830, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !846)
!719 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c5de8437ceab25c34a962d42d2628f53")
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !167, file: !2, size: 384, align: 64, elements: !721, templateParams: !23, identifier: "a0aec1d1ea3bdf613439a5e04a2603cb")
!721 = !{!722, !723, !770}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !720, file: !2, baseType: !152, size: 128, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !720, file: !2, baseType: !724, size: 128, align: 64, offset: 128)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !725, file: !2, size: 128, align: 64, elements: !726, templateParams: !23, identifier: "b8e2606f2acd3eb73158be541d1813f2")
!725 = !DINamespace(name: "option", scope: !44)
!726 = !{!727}
!727 = !DICompositeType(tag: DW_TAG_variant_part, scope: !724, file: !2, size: 128, align: 64, elements: !728, templateParams: !23, identifier: "61b072b58b5d70caf9daa9abacb5ef58", discriminator: !769)
!728 = !{!729, !765}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !727, file: !2, baseType: !730, size: 128, align: 64, extraData: i64 0)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !724, file: !2, size: 128, align: 64, elements: !23, templateParams: !731, identifier: "16848bde27f54ab132d75bd4989ebe65")
!731 = !{!732}
!732 = !DITemplateTypeParameter(name: "T", type: !733)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !734, templateParams: !23, identifier: "3428bfdd2bbbe5118f643cca84499de0")
!734 = !{!735, !764}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !733, file: !2, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64, dwarfAddressSpace: 0)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !165, file: !2, size: 448, align: 64, elements: !738, templateParams: !23, identifier: "83a2ed6cdf3a4449d15fd810f59936b5")
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !737, file: !2, baseType: !9, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !737, file: !2, baseType: !741, size: 384, align: 64, offset: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !165, file: !2, size: 384, align: 64, elements: !742, templateParams: !23, identifier: "b421e176fffabb1a9422c957b838033e")
!742 = !{!743, !745, !746, !747, !763}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !741, file: !2, baseType: !744, size: 32, align: 32, offset: 256)
!744 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !741, file: !2, baseType: !164, size: 8, align: 8, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !2, baseType: !222, size: 32, align: 32, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !741, file: !2, baseType: !748, size: 128, align: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !165, file: !2, size: 128, align: 64, elements: !749, templateParams: !23, identifier: "2f622710b340f12e25011af1d803f134")
!749 = !{!750}
!750 = !DICompositeType(tag: DW_TAG_variant_part, scope: !748, file: !2, size: 128, align: 64, elements: !751, templateParams: !23, identifier: "51002d1103e4bfd0e36408497abeae83", discriminator: !762)
!751 = !{!752, !756, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !750, file: !2, baseType: !753, size: 128, align: 64, extraData: i64 0)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !748, file: !2, size: 128, align: 64, elements: !754, templateParams: !23, identifier: "1444484c4dce485f1290a5a1787848de")
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !753, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !750, file: !2, baseType: !757, size: 128, align: 64, extraData: i64 1)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !748, file: !2, size: 128, align: 64, elements: !758, templateParams: !23, identifier: "e4eec8bef520573b70171b367b1cd2b3")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !750, file: !2, baseType: !761, size: 128, align: 64, extraData: i64 2)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !748, file: !2, size: 128, align: 64, elements: !23, identifier: "884829b33a492cff1c046a186fd09be2")
!762 = !DIDerivedType(tag: DW_TAG_member, scope: !748, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !741, file: !2, baseType: !748, size: 128, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !733, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !727, file: !2, baseType: !766, size: 128, align: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !724, file: !2, size: 128, align: 64, elements: !767, templateParams: !731, identifier: "a9d1aef8652ae3fb1ce43bf5a816afb5")
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !766, file: !2, baseType: !733, size: 128, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, scope: !724, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !720, file: !2, baseType: !771, size: 128, align: 64, offset: 256)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !772, templateParams: !23, identifier: "f71d9e8c03564763165f832ee1a6f5f9")
!772 = !{!773, !829}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !771, file: !2, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64, dwarfAddressSpace: 0)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !167, file: !2, size: 128, align: 64, elements: !776, templateParams: !23, identifier: "ee6afbf689c0bee499d5104ca6bc0325")
!776 = !{!777, !781}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !775, file: !2, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !779, size: 64, align: 64, dwarfAddressSpace: 0)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !780, file: !2, align: 8, elements: !23, identifier: "34b15e58e715eb947795ec8f7a6436c0")
!780 = !DINamespace(name: "{extern#0}", scope: !167)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !775, file: !2, baseType: !782, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !783, size: 64, align: 64, dwarfAddressSpace: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !778, !801}
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !354, file: !2, size: 8, align: 8, elements: !786, templateParams: !23, identifier: "447757be4c16082e69889932eb17f9c")
!786 = !{!787}
!787 = !DICompositeType(tag: DW_TAG_variant_part, scope: !785, file: !2, size: 8, align: 8, elements: !788, templateParams: !23, identifier: "96c807d207af80b29492385694908cd3", discriminator: !800)
!788 = !{!789, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !787, file: !2, baseType: !790, size: 8, align: 8, extraData: i64 0)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !785, file: !2, size: 8, align: 8, elements: !791, templateParams: !793, identifier: "68fc9cadc38fd89dc5314147fe1c04c5")
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !790, file: !2, baseType: !7, align: 8, offset: 8)
!793 = !{!48, !794}
!794 = !DITemplateTypeParameter(name: "E", type: !795)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !167, file: !2, align: 8, elements: !23, identifier: "1311c183d6f2d58f3dad194adbe49b3a")
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !787, file: !2, baseType: !797, size: 8, align: 8, extraData: i64 1)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !785, file: !2, size: 8, align: 8, elements: !798, templateParams: !793, identifier: "c8f00e71d7b7aec3720e840d9348dce6")
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !797, file: !2, baseType: !795, align: 8, offset: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, scope: !785, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagArtificial)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !802, size: 64, align: 64, dwarfAddressSpace: 0)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !167, file: !2, size: 512, align: 64, elements: !803, templateParams: !23, identifier: "97569f54ab5a7c989a71423c5556f817")
!803 = !{!804, !805, !806, !807, !821, !822}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !802, file: !2, baseType: !222, size: 32, align: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !802, file: !2, baseType: !744, size: 32, align: 32, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !802, file: !2, baseType: !164, size: 8, align: 8, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !802, file: !2, baseType: !808, size: 128, align: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !725, file: !2, size: 128, align: 64, elements: !809, templateParams: !23, identifier: "b0f0daeaed8f91c87f71a0105100a674")
!809 = !{!810}
!810 = !DICompositeType(tag: DW_TAG_variant_part, scope: !808, file: !2, size: 128, align: 64, elements: !811, templateParams: !23, identifier: "eb3caad7987abf801f0cfbe00021cc02", discriminator: !820)
!811 = !{!812, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !810, file: !2, baseType: !813, size: 128, align: 64, extraData: i64 0)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !808, file: !2, size: 128, align: 64, elements: !23, templateParams: !814, identifier: "d28a3150cdbae9501568a67346894d10")
!814 = !{!815}
!815 = !DITemplateTypeParameter(name: "T", type: !9)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !810, file: !2, baseType: !817, size: 128, align: 64, extraData: i64 1)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !808, file: !2, size: 128, align: 64, elements: !818, templateParams: !814, identifier: "899f8f47ef45b07334d36d49fd9ce901")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !817, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !808, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !802, file: !2, baseType: !808, size: 128, align: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !802, file: !2, baseType: !823, size: 128, align: 64, offset: 256)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !824, templateParams: !23, identifier: "82c572e17c15a0d86f20372e18a95685")
!824 = !{!825, !828}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !823, file: !2, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64, dwarfAddressSpace: 0)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "9ac45caf5d58874c6d7da3fea362c3ba")
!828 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !823, file: !2, baseType: !120, size: 64, align: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !771, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!832, !845}
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !725, file: !2, size: 128, align: 64, elements: !833, templateParams: !23, identifier: "b299aafcb704b290591f478f2cbc1b79")
!833 = !{!834}
!834 = !DICompositeType(tag: DW_TAG_variant_part, scope: !832, file: !2, size: 128, align: 64, elements: !835, templateParams: !23, identifier: "e3f0fbd6739a5ca985d96a50cc4709b1", discriminator: !844)
!835 = !{!836, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !834, file: !2, baseType: !837, size: 128, align: 64, extraData: i64 0)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !832, file: !2, size: 128, align: 64, elements: !23, templateParams: !838, identifier: "74ece91664cfe3c17a67e77e0d2d70f3")
!838 = !{!839}
!839 = !DITemplateTypeParameter(name: "T", type: !137)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !834, file: !2, baseType: !841, size: 128, align: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !832, file: !2, size: 128, align: 64, elements: !842, templateParams: !838, identifier: "5b6411fcb6ec743b4f160097649d8a4")
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !841, file: !2, baseType: !137, size: 128, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, scope: !832, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !720, size: 64, align: 64, dwarfAddressSpace: 0)
!846 = !{!847, !848}
!847 = !DILocalVariable(name: "self", arg: 1, scope: !718, file: !719, line: 512, type: !845)
!848 = !DILocalVariable(name: "s", scope: !849, file: !719, line: 515, type: !706, align: 8)
!849 = distinct !DILexicalBlock(scope: !718, file: !719, line: 515, column: 13)
!850 = !DILocation(line: 512, column: 25, scope: !718)
!851 = !DILocation(line: 513, column: 16, scope: !718)
!852 = !DILocation(line: 513, column: 29, scope: !718)
!853 = !DILocation(line: 513, column: 15, scope: !718)
!854 = !DILocation(line: 514, column: 14, scope: !718)
!855 = !DILocation(line: 515, column: 14, scope: !718)
!856 = !DILocation(line: 514, column: 18, scope: !718)
!857 = !DILocation(line: 516, column: 18, scope: !718)
!858 = !DILocation(line: 514, column: 25, scope: !718)
!859 = !DILocation(line: 514, column: 32, scope: !718)
!860 = !DILocation(line: 518, column: 6, scope: !718)
!861 = !DILocation(line: 515, column: 19, scope: !718)
!862 = !DILocation(line: 515, column: 15, scope: !718)
!863 = !DILocation(line: 515, column: 15, scope: !849)
!864 = !DILocation(line: 515, column: 31, scope: !849)
!865 = !DILocation(line: 515, column: 26, scope: !849)
!866 = !DILocation(line: 515, column: 32, scope: !718)
!867 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h7ec2561a46cebd19E", scope: !720, file: !719, line: 390, type: !868, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !23, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{!720, !152, !771}
!870 = !{!871, !872}
!871 = !DILocalVariable(name: "pieces", arg: 1, scope: !867, file: !719, line: 390, type: !152)
!872 = !DILocalVariable(name: "args", arg: 2, scope: !867, file: !719, line: 390, type: !771)
!873 = !DILocation(line: 390, column: 25, scope: !867)
!874 = !DILocation(line: 390, column: 53, scope: !867)
!875 = !DILocation(line: 391, column: 12, scope: !867)
!876 = !DILocation(line: 391, column: 56, scope: !867)
!877 = !DILocation(line: 391, column: 41, scope: !867)
!878 = !{i8 0, i8 2}
!879 = !DILocation(line: 394, column: 34, scope: !867)
!880 = !DILocation(line: 394, column: 9, scope: !867)
!881 = !DILocation(line: 395, column: 6, scope: !867)
!882 = !DILocation(line: 392, column: 13, scope: !867)
!883 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h5806c1b5de622317E", scope: !885, file: !884, line: 248, type: !887, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !893, retainedNodes: !890)
!884 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!885 = !DINamespace(name: "FnOnce", scope: !886)
!886 = !DINamespace(name: "function", scope: !214)
!887 = !DISubroutineType(types: !888)
!888 = !{!62, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!890 = !{!891, !892}
!891 = !DILocalVariable(arg: 1, scope: !883, file: !884, line: 248, type: !889)
!892 = !DILocalVariable(arg: 2, scope: !883, file: !884, line: 248, type: !7)
!893 = !{!894, !895}
!894 = !DITemplateTypeParameter(name: "Self", type: !14)
!895 = !DITemplateTypeParameter(name: "Args", type: !7)
!896 = !DILocation(line: 248, column: 5, scope: !883)
!897 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5cc1888c684b8fcaE", scope: !885, file: !884, line: 248, type: !898, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !893, retainedNodes: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{!62, !14}
!900 = !{!901, !902}
!901 = !DILocalVariable(arg: 1, scope: !897, file: !884, line: 248, type: !14)
!902 = !DILocalVariable(arg: 2, scope: !897, file: !884, line: 248, type: !7)
!903 = !DILocation(line: 248, column: 5, scope: !897)
!904 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h67df27c57ae0f902E", scope: !885, file: !884, line: 248, type: !323, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !908, retainedNodes: !905)
!905 = !{!906, !907}
!906 = !DILocalVariable(arg: 1, scope: !904, file: !884, line: 248, type: !20)
!907 = !DILocalVariable(arg: 2, scope: !904, file: !884, line: 248, type: !7)
!908 = !{!909, !895}
!909 = !DITemplateTypeParameter(name: "Self", type: !20)
!910 = !DILocation(line: 248, column: 5, scope: !904)
!911 = distinct !DISubprogram(name: "drop_in_place<build_script_build::HeaderLocation>", linkageName: "_ZN4core3ptr55drop_in_place$LT$build_script_build..HeaderLocation$GT$17hf6ab47ddca57b34cE", scope: !43, file: !271, line: 487, type: !912, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !930, retainedNodes: !928)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut build_script_build::HeaderLocation", baseType: !915, size: 64, align: 64, dwarfAddressSpace: 0)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "HeaderLocation", scope: !150, file: !2, size: 256, align: 64, elements: !916, templateParams: !23, identifier: "96b5d8240f86c30cbcea4e399d9437c0")
!916 = !{!917}
!917 = !DICompositeType(tag: DW_TAG_variant_part, scope: !915, file: !2, size: 256, align: 64, elements: !918, templateParams: !23, identifier: "fd10d8026b65c436ca9f4b7338709edf", discriminator: !927)
!918 = !{!919, !921, !923}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "FromEnvironment", scope: !917, file: !2, baseType: !920, size: 256, align: 64, extraData: i64 0)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromEnvironment", scope: !915, file: !2, size: 256, align: 64, elements: !23, identifier: "339269e2f6d8c386de4e713987a6c8fd")
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Wrapper", scope: !917, file: !2, baseType: !922, size: 256, align: 64, extraData: i64 1)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "Wrapper", scope: !915, file: !2, size: 256, align: 64, elements: !23, identifier: "3a5b3143d4d61fb166896333c5ba58b2")
!923 = !DIDerivedType(tag: DW_TAG_member, name: "FromPath", scope: !917, file: !2, baseType: !924, size: 256, align: 64, extraData: i64 2)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromPath", scope: !915, file: !2, size: 256, align: 64, elements: !925, templateParams: !23, identifier: "8cf6be93754bef0b4752dc0170d998c7")
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !924, file: !2, baseType: !182, size: 192, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, scope: !915, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagArtificial)
!928 = !{!929}
!929 = !DILocalVariable(arg: 1, scope: !911, file: !271, line: 487, type: !914)
!930 = !{!931}
!931 = !DITemplateTypeParameter(name: "T", type: !915)
!932 = !DILocation(line: 487, column: 1, scope: !911)
!933 = !{i64 0, i64 3}
!934 = distinct !DISubprogram(name: "drop_in_place<core::result::Result<vcpkg::Library, vcpkg::Error>>", linkageName: "_ZN4core3ptr78drop_in_place$LT$core..result..Result$LT$vcpkg..Library$C$vcpkg..Error$GT$$GT$17hcdda3552f1e12edcE", scope: !43, file: !271, line: 487, type: !935, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !161, templateParams: !1039, retainedNodes: !1037)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::result::Result<vcpkg::Library, vcpkg::Error>", baseType: !938, size: 64, align: 64, dwarfAddressSpace: 0)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<vcpkg::Library, vcpkg::Error>", scope: !354, file: !2, size: 1856, align: 64, elements: !939, templateParams: !23, identifier: "c38ac064c971149f1448ba8164360a66")
!939 = !{!940}
!940 = !DICompositeType(tag: DW_TAG_variant_part, scope: !938, file: !2, size: 1856, align: 64, elements: !941, templateParams: !23, identifier: "3841f1f228f4f4907194b24447a54f9c", discriminator: !1036)
!941 = !{!942, !1032}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !940, file: !2, baseType: !943, size: 1856, align: 64, extraData: i64 0)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !938, file: !2, size: 1856, align: 64, elements: !944, templateParams: !1000, identifier: "f9b43fdd9837528a73dd0047199c7049")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !943, file: !2, baseType: !946, size: 1792, align: 64, offset: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Library", scope: !947, file: !2, size: 1792, align: 64, elements: !948, templateParams: !23, identifier: "b9cdbaaf132abf96f6ce5f0436720739")
!947 = !DINamespace(name: "vcpkg", scope: null)
!948 = !{!949, !971, !972, !973, !994, !995, !996, !997, !998, !999}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "link_paths", scope: !946, file: !2, baseType: !950, size: 192, align: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<std::path::PathBuf, alloc::alloc::Global>", scope: !186, file: !2, size: 192, align: 64, elements: !951, templateParams: !969, identifier: "26039cc6b9083ef6d1ff54a770773e96")
!951 = !{!952, !970}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !950, file: !2, baseType: !953, size: 128, align: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<std::path::PathBuf, alloc::alloc::Global>", scope: !190, file: !2, size: 128, align: 64, elements: !954, templateParams: !969, identifier: "6b2fbc5c5c30412d29c3b458172868")
!954 = !{!955, !967, !968}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !953, file: !2, baseType: !956, size: 64, align: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<std::path::PathBuf>", scope: !194, file: !2, size: 64, align: 64, elements: !957, templateParams: !963, identifier: "606bcaf8d952b16b54644c60cc0ac4e1")
!957 = !{!958, !965}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !956, file: !2, baseType: !959, size: 64, align: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<std::path::PathBuf>", scope: !42, file: !2, size: 64, align: 64, elements: !960, templateParams: !963, identifier: "c101836793feb6147c99e349c5aaaf34")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !959, file: !2, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const std::path::PathBuf", baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!963 = !{!964}
!964 = !DITemplateTypeParameter(name: "T", type: !531)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !956, file: !2, baseType: !966, align: 8)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::path::PathBuf>", scope: !51, file: !2, align: 8, elements: !23, templateParams: !963, identifier: "b29a412281e5719484babcd4f49a8987")
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !953, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !953, file: !2, baseType: !207, align: 8)
!969 = !{!964, !210}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !950, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "dll_paths", scope: !946, file: !2, baseType: !950, size: 192, align: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "include_paths", scope: !946, file: !2, baseType: !950, size: 192, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cargo_metadata", scope: !946, file: !2, baseType: !974, size: 192, align: 64, offset: 576)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::string::String, alloc::alloc::Global>", scope: !186, file: !2, size: 192, align: 64, elements: !975, templateParams: !992, identifier: "b8145e318b11533cb53b33a6796f3d0f")
!975 = !{!976, !993}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !974, file: !2, baseType: !977, size: 128, align: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::string::String, alloc::alloc::Global>", scope: !190, file: !2, size: 128, align: 64, elements: !978, templateParams: !992, identifier: "77c96574ce97f7d8340631d103929fdc")
!978 = !{!979, !990, !991}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !977, file: !2, baseType: !980, size: 64, align: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::string::String>", scope: !194, file: !2, size: 64, align: 64, elements: !981, templateParams: !987, identifier: "dfc18e0956a5f52566923113d16462c6")
!981 = !{!982, !988}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !980, file: !2, baseType: !983, size: 64, align: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::string::String>", scope: !42, file: !2, size: 64, align: 64, elements: !984, templateParams: !987, identifier: "c5b8952b9ddab0d73bfad6b1d9bcabf8")
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !983, file: !2, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::string::String", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!987 = !{!494}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !980, file: !2, baseType: !989, align: 8)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::string::String>", scope: !51, file: !2, align: 8, elements: !23, templateParams: !987, identifier: "597a3cb9689d6084cd6c6860577f53a8")
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !977, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !977, file: !2, baseType: !207, align: 8)
!992 = !{!494, !210}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !974, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "is_static", scope: !946, file: !2, baseType: !704, size: 8, align: 8, offset: 1728)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "found_dlls", scope: !946, file: !2, baseType: !950, size: 192, align: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "found_libs", scope: !946, file: !2, baseType: !950, size: 192, align: 64, offset: 960)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "found_names", scope: !946, file: !2, baseType: !974, size: 192, align: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !946, file: !2, baseType: !974, size: 192, align: 64, offset: 1344)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "vcpkg_triplet", scope: !946, file: !2, baseType: !182, size: 192, align: 64, offset: 1536)
!1000 = !{!1001, !1002}
!1001 = !DITemplateTypeParameter(name: "T", type: !946)
!1002 = !DITemplateTypeParameter(name: "E", type: !1003)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !947, file: !2, size: 256, align: 64, elements: !1004, templateParams: !23, identifier: "e3b665d24fda1d3b128d177cdc9e7116")
!1004 = !{!1005}
!1005 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1003, file: !2, size: 256, align: 64, elements: !1006, templateParams: !23, identifier: "d97a21fa26616f61e3d9fd397820d41b", discriminator: !1031)
!1006 = !{!1007, !1011, !1015, !1017, !1021, !1025, !1029}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "DisabledByEnv", scope: !1005, file: !2, baseType: !1008, size: 256, align: 64, extraData: i64 0)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "DisabledByEnv", scope: !1003, file: !2, size: 256, align: 64, elements: !1009, templateParams: !23, identifier: "cad44ac55b6dddf51c541a2e525c6d6c")
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1008, file: !2, baseType: !182, size: 192, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "RequiredEnvMissing", scope: !1005, file: !2, baseType: !1012, size: 256, align: 64, extraData: i64 1)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "RequiredEnvMissing", scope: !1003, file: !2, size: 256, align: 64, elements: !1013, templateParams: !23, identifier: "9674ec9441bba1f4b4872d6923bc8fb1")
!1013 = !{!1014}
