; ModuleID = 'getrandom.4ce49bd4-cgu.0'
source_filename = "getrandom.4ce49bd4-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"[closure@<core::ops::range::Range<usize> as core::slice::index::SliceIndex<[u8]>>::get_unchecked::{closure#0}]" = type { i64*, i64*, { [0 x i8]*, i64 }* }
%"core::ptr::metadata::PtrRepr<[core::mem::maybe_uninit::MaybeUninit<u8>]>" = type { [2 x i64] }
%"[closure@<core::ops::range::Range<usize> as core::slice::index::SliceIndex<[core::mem::maybe_uninit::MaybeUninit<u8>]>>::get_unchecked_mut::{closure#0}]" = type { i64*, i64*, { [0 x i8]*, i64 }* }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::result::Result<i32, error::Error>" = type { i32, [1 x i32] }
%"core::result::Result<i32, error::Error>::Err" = type { [1 x i32], i32 }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"use_file::DropGuard<[closure@/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12/src/use_file.rs:58:28: 58:56]>" = type { %"[closure@/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12/src/use_file.rs:58:28: 58:56]" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !14, identifier: "7f8917983ceb121fd77b2d3e9e21ae9a")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!14 = !{}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "<&core::option::Option<&u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<&u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !18, vtableHolder: !23, templateParams: !14, identifier: "dea6814a8986e779bbb6c7673bcb1234")
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !17, file: !2, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !17, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<&u8>", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !25, file: !2, size: 64, align: 64, elements: !27, templateParams: !14, identifier: "379cb6de4516ea36400a272b8a82a0e5")
!25 = !DINamespace(name: "option", scope: !26)
!26 = !DINamespace(name: "core", scope: null)
!27 = !{!28}
!28 = !DICompositeType(tag: DW_TAG_variant_part, scope: !24, file: !2, size: 64, align: 64, elements: !29, templateParams: !14, identifier: "5f130bd14c9c4a97e40efb861e245c6", discriminator: !40)
!29 = !{!30, !36}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !28, file: !2, baseType: !31, size: 64, align: 64, extraData: i64 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !24, file: !2, size: 64, align: 64, elements: !14, templateParams: !32, identifier: "5272a43c993cd4881261672fcadbcb9b")
!32 = !{!33}
!33 = !DITemplateTypeParameter(name: "T", type: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !28, file: !2, baseType: !37, size: 64, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !24, file: !2, size: 64, align: 64, elements: !38, templateParams: !32, identifier: "6ecba2538dc7577eb4fcaf7925a2c8b")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !34, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!41 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "<&&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !45, vtableHolder: !50, templateParams: !14, identifier: "c7254dc929e8c165ab63fa677fc308")
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !44, file: !2, baseType: !6, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !44, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !44, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !44, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u8", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !54, vtableHolder: !59, templateParams: !14, identifier: "f92addfaad104c51a29b8636b86fa62c")
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !53, file: !2, baseType: !6, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !53, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!59 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !63, vtableHolder: !68, templateParams: !14, identifier: "28e28f4653a86bca48f6f77e76104726")
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !62, file: !2, baseType: !6, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !62, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !69, templateParams: !14, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !68, file: !2, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !68, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "<i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "<i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !76, vtableHolder: !13, templateParams: !14, identifier: "d67cc57afab7b670fb9c201eb32979b4")
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !75, file: !2, baseType: !6, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !75, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !75, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !75, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "FD", linkageName: "_ZN9getrandom8use_file10get_rng_fd2FD17ha0eb6fdf255b619fE", scope: !83, file: !86, line: 41, type: !87, isLocal: true, isDefinition: true, align: 64)
!83 = !DINamespace(name: "get_rng_fd", scope: !84)
!84 = !DINamespace(name: "use_file", scope: !85)
!85 = !DINamespace(name: "getrandom", scope: null)
!86 = !DIFile(filename: "src/use_file.rs", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12", checksumkind: CSK_MD5, checksum: "6bd298f831a27c645ce73b21bf8b71c5")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !88, file: !2, size: 64, align: 64, elements: !90, templateParams: !14, identifier: "2d4abd53c5bff49de64cadf64a30057e")
!88 = !DINamespace(name: "atomic", scope: !89)
!89 = !DINamespace(name: "sync", scope: !26)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !87, file: !2, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !93, file: !2, size: 64, align: 64, elements: !94, templateParams: !96, identifier: "4da9453724cd8ada86448758899af7d")
!93 = !DINamespace(name: "cell", scope: !26)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !2, baseType: !9, size: 64, align: 64)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "T", type: !9)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "MUTEX", linkageName: "_ZN9getrandom8use_file10get_rng_fd5MUTEX17hf654e78fcce2fce8E", scope: !83, file: !86, line: 56, type: !100, isLocal: true, isDefinition: true, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !84, file: !2, size: 320, align: 64, elements: !101, templateParams: !14, identifier: "6c5c662c996904065b83b1fb882ac659")
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !100, file: !2, baseType: !103, size: 320, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !93, file: !2, size: 320, align: 64, elements: !104, templateParams: !116, identifier: "4d6bd9f5dda3d252e8f6ebb34788326")
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !103, file: !2, baseType: !106, size: 320, align: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !107, file: !2, size: 320, align: 64, elements: !111, templateParams: !14, identifier: "44d7b56e91051e3e5cb38d26bb9ff81c")
!107 = !DINamespace(name: "linux", scope: !108)
!108 = !DINamespace(name: "linux_like", scope: !109)
!109 = !DINamespace(name: "unix", scope: !110)
!110 = !DINamespace(name: "libc", scope: null)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !2, baseType: !113, size: 320, align: 8)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 320, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 40, lowerBound: 0)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "T", type: !106)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "HAS_GETRANDOM", linkageName: "_ZN9getrandom3imp15getrandom_inner13HAS_GETRANDOM17h12563d3fcca70151E", scope: !120, file: !122, line: 11, type: !123, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "getrandom_inner", scope: !121)
!121 = !DINamespace(name: "imp", scope: !85)
!122 = !DIFile(filename: "src/linux_android.rs", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12", checksumkind: CSK_MD5, checksum: "d033824b3cede7f5f8576270107a9f52")
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "LazyBool", scope: !124, file: !2, size: 64, align: 64, elements: !125, templateParams: !14, identifier: "2b3a079a96e1cd66ffb00019da7d955a")
!124 = !DINamespace(name: "lazy", scope: !85)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !123, file: !2, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "LazyUsize", scope: !124, file: !2, size: 64, align: 64, elements: !128, templateParams: !14, identifier: "93a35fda395b4ba1590224979fdb0af3")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !127, file: !2, baseType: !87, size: 64, align: 64)
!130 = !{i32 7, !"PIC Level", i32 2}
!131 = !{i32 2, !"RtLibUseGOT", i32 1}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !134, producer: "clang LLVM (rustc version 1.64.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !135, globals: !163)
!134 = !DIFile(filename: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12/src/lib.rs/@/getrandom.4ce49bd4-cgu.0", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/getrandom-0.2.12")
!135 = !{!136, !145, !150, !157}
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !140)
!137 = !DINamespace(name: "v1", scope: !138)
!138 = !DINamespace(name: "rt", scope: !139)
!139 = !DINamespace(name: "fmt", scope: !26)
!140 = !{!141, !142, !143, !144}
!141 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !146, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !147)
!146 = !DINamespace(name: "ffi", scope: !26)
!147 = !{!148, !149}
!148 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!149 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !88, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !151)
!151 = !{!152, !153, !154, !155, !156}
!152 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!153 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!154 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!155 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!156 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !158, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !159)
!158 = !DINamespace(name: "panicking", scope: !26)
!159 = !{!160, !161, !162}
!160 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!163 = !{!0, !15, !42, !51, !60, !73, !81, !98, !118}
!164 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h46d3e53f4e2e4f4cE", scope: !166, file: !165, line: 278, type: !169, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !183)
!165 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!166 = !DINamespace(name: "{impl#3}", scope: !167)
!167 = !DINamespace(name: "index", scope: !168)
!168 = !DINamespace(name: "slice", scope: !26)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !175, !171}
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !172, templateParams: !14, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !171, file: !2, baseType: !71, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !171, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !176, file: !2, size: 128, align: 64, elements: !178, templateParams: !181, identifier: "3dd0d908635f86b6929fa77339739c9")
!176 = !DINamespace(name: "range", scope: !177)
!177 = !DINamespace(name: "ops", scope: !26)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "Idx", type: !9)
!183 = !{!184, !185, !186}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !164, file: !165, line: 278, type: !175)
!185 = !DILocalVariable(name: "slice", arg: 2, scope: !164, file: !165, line: 278, type: !171)
!186 = !DILocalVariable(name: "runtime", scope: !187, file: !165, line: 285, type: !190, align: 8)
!187 = !DILexicalBlockFile(scope: !188, file: !165, discriminator: 0)
!188 = distinct !DILexicalBlock(scope: !164, file: !189, line: 2319, column: 13)
!189 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "522b6baddd07f8f08b1c42bc11a3b4d7")
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !191, file: !2, size: 192, align: 64, elements: !192, templateParams: !14, identifier: "e6ee7db470cd2a78dbba301356b49cfc")
!191 = !DINamespace(name: "get_unchecked", scope: !166)
!192 = !{!193, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__start", scope: !190, file: !2, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__end", scope: !190, file: !2, baseType: !194, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slice", scope: !190, file: !2, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const [u8]", baseType: !171, size: 64, align: 64, dwarfAddressSpace: 0)
!198 = !{!199}
!199 = !DITemplateTypeParameter(name: "T", type: !35)
!200 = !DILocation(line: 278, column: 29, scope: !164)
!201 = !DILocation(line: 278, column: 35, scope: !164)
!202 = !DILocation(line: 285, column: 13, scope: !187)
!203 = !DILocation(line: 286, column: 39, scope: !164)
!204 = !DILocalVariable(name: "self", scope: !205, file: !165, line: 286, type: !171, align: 8)
!205 = !DILexicalBlockFile(scope: !206, file: !165, discriminator: 0)
!206 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17hbc2e1f07c4c06c2aE", scope: !208, file: !207, line: 1374, type: !211, scopeLine: 1374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !214)
!207 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "472568b60919158596db0f55d2635676")
!208 = !DINamespace(name: "{impl#1}", scope: !209)
!209 = !DINamespace(name: "const_ptr", scope: !210)
!210 = !DINamespace(name: "ptr", scope: !26)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !171}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !{!204}
!215 = !DILocation(line: 286, column: 39, scope: !205, inlinedAt: !203)
!216 = !{!"rawptr"}
!217 = !DILocalVariable(name: "self", scope: !218, file: !165, line: 286, type: !213, align: 8)
!218 = !DILexicalBlockFile(scope: !219, file: !165, discriminator: 0)
!219 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h84da48fd401708e3E", scope: !220, file: !207, line: 865, type: !221, scopeLine: 865, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !223)
!220 = !DINamespace(name: "{impl#0}", scope: !209)
!221 = !DISubroutineType(types: !222)
!222 = !{!213, !213, !9}
!223 = !{!217, !224}
!224 = !DILocalVariable(name: "count", scope: !218, file: !165, line: 286, type: !9, align: 8)
!225 = !DILocation(line: 286, column: 39, scope: !218, inlinedAt: !203)
!226 = !DILocation(line: 286, column: 58, scope: !164)
!227 = !DILocalVariable(name: "self", scope: !228, file: !165, line: 286, type: !213, align: 8)
!228 = !DILexicalBlockFile(scope: !229, file: !165, discriminator: 0)
!229 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17hdcbd2f93289f1bddE", scope: !220, file: !207, line: 452, type: !230, scopeLine: 452, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !233)
!230 = !DISubroutineType(types: !231)
!231 = !{!213, !213, !232}
!232 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!233 = !{!227, !234}
!234 = !DILocalVariable(name: "count", scope: !228, file: !165, line: 286, type: !232, align: 8)
!235 = !DILocation(line: 286, column: 39, scope: !228, inlinedAt: !236)
!236 = !DILocation(line: 870, column: 18, scope: !219, inlinedAt: !203)
!237 = !DILocalVariable(name: "data", scope: !238, file: !165, line: 286, type: !213, align: 8)
!238 = !DILexicalBlockFile(scope: !239, file: !165, discriminator: 0)
!239 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17hc479c2fa7b2ff0fdE", scope: !210, file: !240, line: 694, type: !241, scopeLine: 694, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !243)
!240 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8347f3797ea1142e866e50608b9a2204")
!241 = !DISubroutineType(types: !242)
!242 = !{!171, !213, !9}
!243 = !{!237, !244}
!244 = !DILocalVariable(name: "len", scope: !238, file: !165, line: 286, type: !9, align: 8)
!245 = !DILocation(line: 286, column: 13, scope: !238, inlinedAt: !246)
!246 = !DILocation(line: 286, column: 13, scope: !164)
!247 = !DILocation(line: 286, column: 71, scope: !164)
!248 = !DILocalVariable(name: "self", scope: !249, file: !165, line: 286, type: !213, align: 8)
!249 = !DILexicalBlockFile(scope: !250, file: !165, discriminator: 0)
!250 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h57fd03c6d792c8f5E", scope: !220, file: !207, line: 46, type: !251, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !254, retainedNodes: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!6, !213}
!253 = !{!248}
!254 = !{!199, !255}
!255 = !DITemplateTypeParameter(name: "U", type: !7)
!256 = !DILocation(line: 286, column: 13, scope: !249, inlinedAt: !257)
!257 = !DILocation(line: 695, column: 20, scope: !239, inlinedAt: !246)
!258 = !DILocalVariable(name: "data_address", scope: !259, file: !165, line: 286, type: !6, align: 8)
!259 = !DILexicalBlockFile(scope: !260, file: !165, discriminator: 0)
!260 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h7eb585a96d5562cfE", scope: !262, file: !261, line: 110, type: !263, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !265)
!261 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c0696840ef99c8132b364245b959d8b")
!262 = !DINamespace(name: "metadata", scope: !210)
!263 = !DISubroutineType(types: !264)
!264 = !{!171, !6, !9}
!265 = !{!258, !266}
!266 = !DILocalVariable(name: "metadata", scope: !259, file: !165, line: 286, type: !9, align: 8)
!267 = !DILocation(line: 286, column: 13, scope: !259, inlinedAt: !268)
!268 = !DILocation(line: 695, column: 5, scope: !239, inlinedAt: !246)
!269 = !DILocation(line: 288, column: 6, scope: !164)
!270 = distinct !DISubprogram(name: "get_unchecked_mut<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h3e61a3a4d1351000E", scope: !166, file: !165, line: 291, type: !271, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !288)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !175, !273}
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [core::mem::maybe_uninit::MaybeUninit<u8>]", file: !2, size: 128, align: 64, elements: !274, templateParams: !14, identifier: "8b1ec13d56517922237b05a437f4e747")
!274 = !{!275, !287}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !273, file: !2, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!277 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u8>", scope: !278, file: !2, size: 8, align: 8, elements: !280, templateParams: !198, identifier: "e11af64b0336a536c8aa158c854c3454")
!278 = !DINamespace(name: "maybe_uninit", scope: !279)
!279 = !DINamespace(name: "mem", scope: !26)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !277, file: !2, baseType: !7, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !2, baseType: !283, size: 8, align: 8)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u8>", scope: !284, file: !2, size: 8, align: 8, elements: !285, templateParams: !198, identifier: "30bc78cd19981edb6c98698a07e99a75")
!284 = !DINamespace(name: "manually_drop", scope: !279)
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !2, baseType: !35, size: 8, align: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !273, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!288 = !{!289, !290, !291}
!289 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !165, line: 291, type: !175)
!290 = !DILocalVariable(name: "slice", arg: 2, scope: !270, file: !165, line: 291, type: !273)
!291 = !DILocalVariable(name: "runtime", scope: !292, file: !165, line: 294, type: !294, align: 8)
!292 = !DILexicalBlockFile(scope: !293, file: !165, discriminator: 0)
!293 = distinct !DILexicalBlock(scope: !270, file: !189, line: 2319, column: 13)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::mem::maybe_uninit::MaybeUninit<u8>>", scope: !295, file: !2, size: 192, align: 64, elements: !296, templateParams: !14, identifier: "fb5cf6ecd725a79d2a5afe034c3d70b")
!295 = !DINamespace(name: "get_unchecked_mut", scope: !166)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__start", scope: !294, file: !2, baseType: !194, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__end", scope: !294, file: !2, baseType: !194, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slice", scope: !294, file: !2, baseType: !300, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*mut [core::mem::maybe_uninit::MaybeUninit<u8>]", baseType: !273, size: 64, align: 64, dwarfAddressSpace: 0)
!301 = !{!302}
!302 = !DITemplateTypeParameter(name: "T", type: !277)
!303 = !DILocation(line: 291, column: 33, scope: !270)
!304 = !DILocation(line: 291, column: 39, scope: !270)
!305 = !DILocation(line: 294, column: 13, scope: !292)
!306 = !DILocation(line: 295, column: 43, scope: !270)
!307 = !DILocalVariable(name: "self", scope: !308, file: !165, line: 295, type: !273, align: 8)
!308 = !DILexicalBlockFile(scope: !309, file: !165, discriminator: 0)
!309 = distinct !DISubprogram(name: "as_mut_ptr<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h2d302f0622b30cb4E", scope: !311, file: !310, line: 1759, type: !313, scopeLine: 1759, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !316)
!310 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "58042decf85f1a548d50de0519db87d2")
!311 = !DINamespace(name: "{impl#1}", scope: !312)
!312 = !DINamespace(name: "mut_ptr", scope: !210)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !273}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::mem::maybe_uninit::MaybeUninit<u8>", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !{!307}
!317 = !DILocation(line: 295, column: 43, scope: !308, inlinedAt: !306)
!318 = !DILocalVariable(name: "self", scope: !319, file: !165, line: 295, type: !315, align: 8)
!319 = !DILexicalBlockFile(scope: !320, file: !165, discriminator: 0)
!320 = distinct !DISubprogram(name: "add<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h9e0f9bbdf30dc8ceE", scope: !321, file: !310, line: 977, type: !322, scopeLine: 977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !324)
!321 = !DINamespace(name: "{impl#0}", scope: !312)
!322 = !DISubroutineType(types: !323)
!323 = !{!315, !315, !9}
!324 = !{!318, !325}
!325 = !DILocalVariable(name: "count", scope: !319, file: !165, line: 295, type: !9, align: 8)
!326 = !DILocation(line: 295, column: 43, scope: !319, inlinedAt: !306)
!327 = !DILocation(line: 295, column: 66, scope: !270)
!328 = !DILocalVariable(name: "self", scope: !329, file: !165, line: 295, type: !315, align: 8)
!329 = !DILexicalBlockFile(scope: !330, file: !165, discriminator: 0)
!330 = distinct !DISubprogram(name: "offset<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h400520855b1443f0E", scope: !321, file: !310, line: 462, type: !331, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !333)
!331 = !DISubroutineType(types: !332)
!332 = !{!315, !315, !232}
!333 = !{!328, !334}
!334 = !DILocalVariable(name: "count", scope: !329, file: !165, line: 295, type: !232, align: 8)
!335 = !DILocation(line: 295, column: 43, scope: !329, inlinedAt: !336)
!336 = !DILocation(line: 982, column: 18, scope: !320, inlinedAt: !306)
!337 = !DILocalVariable(name: "data", scope: !338, file: !165, line: 295, type: !315, align: 8)
!338 = !DILexicalBlockFile(scope: !339, file: !165, discriminator: 0)
!339 = distinct !DISubprogram(name: "slice_from_raw_parts_mut<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN4core3ptr24slice_from_raw_parts_mut17hcd4b5e81b74b8dafE", scope: !210, file: !240, line: 726, type: !340, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!273, !315, !9}
!342 = !{!337, !343}
!343 = !DILocalVariable(name: "len", scope: !338, file: !165, line: 295, type: !9, align: 8)
!344 = !DILocation(line: 295, column: 13, scope: !338, inlinedAt: !345)
!345 = !DILocation(line: 295, column: 13, scope: !270)
!346 = !DILocation(line: 295, column: 79, scope: !270)
!347 = !DILocalVariable(name: "self", scope: !348, file: !165, line: 295, type: !315, align: 8)
!348 = !DILexicalBlockFile(scope: !349, file: !165, discriminator: 0)
!349 = distinct !DISubprogram(name: "cast<core::mem::maybe_uninit::MaybeUninit<u8>, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17h8de44f086c39d4cfE", scope: !321, file: !310, line: 45, type: !350, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !354, retainedNodes: !353)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !315}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!353 = !{!347}
!354 = !{!302, !255}
!355 = !DILocation(line: 295, column: 13, scope: !348, inlinedAt: !356)
!356 = !DILocation(line: 727, column: 24, scope: !339, inlinedAt: !345)
!357 = !DILocalVariable(name: "data_address", scope: !358, file: !165, line: 295, type: !352, align: 8)
!358 = !DILexicalBlockFile(scope: !359, file: !165, discriminator: 0)
!359 = distinct !DISubprogram(name: "from_raw_parts_mut<[core::mem::maybe_uninit::MaybeUninit<u8>]>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h12e83a78914c933bE", scope: !262, file: !261, line: 127, type: !360, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{!273, !352, !9}
!362 = !{!357, !363}
!363 = !DILocalVariable(name: "metadata", scope: !358, file: !165, line: 295, type: !9, align: 8)
!364 = !DILocation(line: 295, column: 13, scope: !358, inlinedAt: !365)
!365 = !DILocation(line: 727, column: 5, scope: !339, inlinedAt: !345)
!366 = !DILocation(line: 297, column: 6, scope: !270)
!367 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h8795355c9d3a823eE", scope: !166, file: !165, line: 300, type: !368, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !382)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !175, !370, !374}
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !371, templateParams: !14, identifier: "7d49e60d2ca720f66806f7375f860e2")
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !370, file: !2, baseType: !71, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !370, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !376, file: !2, size: 192, align: 64, elements: !378, templateParams: !14, identifier: "221b8795f585d602f0086fb6a2d86867")
!376 = !DINamespace(name: "location", scope: !377)
!377 = !DINamespace(name: "panic", scope: !26)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !375, file: !2, baseType: !68, size: 128, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !375, file: !2, baseType: !59, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !375, file: !2, baseType: !59, size: 32, align: 32, offset: 160)
!382 = !{!383, !384}
!383 = !DILocalVariable(name: "self", arg: 1, scope: !367, file: !165, line: 300, type: !175)
!384 = !DILocalVariable(name: "slice", arg: 2, scope: !367, file: !165, line: 300, type: !370)
!385 = !DILocation(line: 300, column: 14, scope: !367)
!386 = !DILocation(line: 300, column: 20, scope: !367)
!387 = !DILocation(line: 301, column: 12, scope: !367)
!388 = !DILocation(line: 303, column: 19, scope: !367)
!389 = !DILocation(line: 302, column: 13, scope: !367)
!390 = !DILocation(line: 307, column: 20, scope: !367)
!391 = !DILocation(line: 304, column: 13, scope: !367)
!392 = !DILocation(line: 308, column: 6, scope: !367)
!393 = distinct !DISubprogram(name: "get_mut<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$7get_mut17hd1d92fee70ebff0cE", scope: !166, file: !165, line: 268, type: !394, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !413)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !175, !404}
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&mut [core::mem::maybe_uninit::MaybeUninit<u8>]>", scope: !25, file: !2, size: 128, align: 64, elements: !397, templateParams: !14, identifier: "370533170aad31531488b231d72ba9bb")
!397 = !{!398}
!398 = !DICompositeType(tag: DW_TAG_variant_part, scope: !396, file: !2, size: 128, align: 64, elements: !399, templateParams: !14, identifier: "ba1df7abc58e6d43bf604546d2b23e31", discriminator: !412)
!399 = !{!400, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !398, file: !2, baseType: !401, size: 128, align: 64, extraData: i64 0)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !396, file: !2, size: 128, align: 64, elements: !14, templateParams: !402, identifier: "35c6a4db04d224ed3e27d0319250230c")
!402 = !{!403}
!403 = !DITemplateTypeParameter(name: "T", type: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [core::mem::maybe_uninit::MaybeUninit<u8>]", file: !2, size: 128, align: 64, elements: !405, templateParams: !14, identifier: "a315061f0b6b7f79db873c2e119be")
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !404, file: !2, baseType: !276, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !404, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !398, file: !2, baseType: !409, size: 128, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !396, file: !2, size: 128, align: 64, elements: !410, templateParams: !402, identifier: "c6065edb7ab3a46244397a14b231ca2")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !2, baseType: !404, size: 128, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!413 = !{!414, !415}
!414 = !DILocalVariable(name: "self", arg: 1, scope: !393, file: !165, line: 268, type: !175)
!415 = !DILocalVariable(name: "slice", arg: 2, scope: !393, file: !165, line: 268, type: !404)
!416 = !DILocation(line: 268, column: 16, scope: !393)
!417 = !DILocation(line: 268, column: 22, scope: !393)
!418 = !DILocation(line: 269, column: 12, scope: !393)
!419 = !DILocation(line: 269, column: 37, scope: !393)
!420 = !{i8 0, i8 2}
!421 = !DILocation(line: 273, column: 33, scope: !393)
!422 = !DILocation(line: 270, column: 13, scope: !393)
!423 = !DILocation(line: 269, column: 9, scope: !393)
!424 = !DILocation(line: 275, column: 6, scope: !393)
!425 = !{i64 1}
!426 = !DILocation(line: 273, column: 22, scope: !393)
!427 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hc37b594fc9eb606aE", scope: !428, file: !165, line: 350, type: !429, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !434)
!428 = !DINamespace(name: "{impl#4}", scope: !167)
!429 = !DISubroutineType(types: !430)
!430 = !{!370, !431, !370, !374}
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !432, templateParams: !181, identifier: "dca3815d123d8cc8e90506c2869c5ce8")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !431, file: !2, baseType: !9, size: 64, align: 64)
!434 = !{!435, !436}
!435 = !DILocalVariable(name: "self", arg: 1, scope: !427, file: !165, line: 350, type: !431)
!436 = !DILocalVariable(name: "slice", arg: 2, scope: !427, file: !165, line: 350, type: !370)
!437 = !DILocation(line: 350, column: 14, scope: !427)
!438 = !DILocation(line: 350, column: 20, scope: !427)
!439 = !DILocation(line: 351, column: 9, scope: !427)
!440 = !DILocation(line: 352, column: 6, scope: !427)
!441 = distinct !DISubprogram(name: "get_mut<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$7get_mut17hf87198b0652b67a9E", scope: !442, file: !165, line: 371, type: !443, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !301, retainedNodes: !448)
!442 = !DINamespace(name: "{impl#5}", scope: !167)
!443 = !DISubroutineType(types: !444)
!444 = !{!396, !445, !404}
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !446, templateParams: !181, identifier: "4620188383a3d2bcfec88a210996b91f")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !445, file: !2, baseType: !9, size: 64, align: 64)
!448 = !{!449, !450}
!449 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !165, line: 371, type: !445)
!450 = !DILocalVariable(name: "slice", arg: 2, scope: !441, file: !165, line: 371, type: !404)
!451 = !DILocation(line: 371, column: 16, scope: !441)
!452 = !DILocation(line: 371, column: 22, scope: !441)
!453 = !DILocation(line: 372, column: 9, scope: !441)
!454 = !DILocation(line: 373, column: 6, scope: !441)
!455 = distinct !DISubprogram(name: "from_residual<(), getrandom::error::Error, getrandom::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h5adb134252c2789cE", scope: !457, file: !456, line: 2123, type: !459, scopeLine: 2123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !508, retainedNodes: !504)
!456 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "10550b113fb76ef9d8987f82c00c25ff")
!457 = !DINamespace(name: "{impl#28}", scope: !458)
!458 = !DINamespace(name: "result", scope: !26)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !486, !374}
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), getrandom::error::Error>", scope: !458, file: !2, size: 32, align: 32, elements: !462, templateParams: !14, identifier: "18ba1a1b426004ea8a574fb1fabbb32c")
!462 = !{!463}
!463 = !DICompositeType(tag: DW_TAG_variant_part, scope: !461, file: !2, size: 32, align: 32, elements: !464, templateParams: !14, identifier: "d1e93d7c80486019e9ba23b8ccb7648d", discriminator: !485)
!464 = !{!465, !481}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !463, file: !2, baseType: !466, size: 32, align: 32, extraData: i64 0)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !461, file: !2, size: 32, align: 32, elements: !467, templateParams: !469, identifier: "45db72a37dbe9152487182c45e44a969")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !466, file: !2, baseType: !7, align: 8)
!469 = !{!470, !471}
!470 = !DITemplateTypeParameter(name: "T", type: !7)
!471 = !DITemplateTypeParameter(name: "E", type: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !473, file: !2, size: 32, align: 32, elements: !474, templateParams: !14, identifier: "dc6dcbcb1062c239844f3b8b20faf653")
!473 = !DINamespace(name: "error", scope: !85)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !472, file: !2, baseType: !476, size: 32, align: 32)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU32", scope: !477, file: !2, size: 32, align: 32, elements: !479, templateParams: !14, identifier: "26fdc8c15aea0483517162d7f6c7f40b")
!477 = !DINamespace(name: "nonzero", scope: !478)
!478 = !DINamespace(name: "num", scope: !26)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !2, baseType: !59, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !463, file: !2, baseType: !482, size: 32, align: 32)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !461, file: !2, size: 32, align: 32, elements: !483, templateParams: !469, identifier: "109ed07d8dd8b7314ac450b59ad2f7ba")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !482, file: !2, baseType: !472, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, getrandom::error::Error>", scope: !458, file: !2, size: 32, align: 32, elements: !487, templateParams: !14, identifier: "79353d396c9dca10ae1565a86ada2d3d")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_variant_part, scope: !486, file: !2, size: 32, align: 32, elements: !489, templateParams: !14, identifier: "301676edf52c447e220879b473abd5dd")
!489 = !{!490, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !488, file: !2, baseType: !491, size: 32, align: 32)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !486, file: !2, size: 32, align: 32, elements: !492, templateParams: !498, identifier: "4b0022d65970ca6bdb3ea2ff37a4027c")
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !491, file: !2, baseType: !494, align: 8)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !495, file: !2, align: 8, elements: !496, templateParams: !14, identifier: "9a43a35c802cd6d66a55225bed19e352")
!495 = !DINamespace(name: "convert", scope: !26)
!496 = !{!497}
!497 = !DICompositeType(tag: DW_TAG_variant_part, scope: !494, file: !2, align: 8, elements: !14, identifier: "c92417f40510ebd79df5f86930cf3ac7")
!498 = !{!499, !471}
!499 = !DITemplateTypeParameter(name: "T", type: !494)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !488, file: !2, baseType: !501, size: 32, align: 32)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !486, file: !2, size: 32, align: 32, elements: !502, templateParams: !498, identifier: "1cb087211735fe7981f25b48bc9a27bf")
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !501, file: !2, baseType: !472, size: 32, align: 32)
!504 = !{!505, !506}
!505 = !DILocalVariable(name: "residual", arg: 1, scope: !455, file: !456, line: 2123, type: !486)
!506 = !DILocalVariable(name: "e", scope: !507, file: !456, line: 2125, type: !472, align: 4)
!507 = distinct !DILexicalBlock(scope: !455, file: !456, line: 2125, column: 13)
!508 = !{!470, !471, !509}
!509 = !DITemplateTypeParameter(name: "F", type: !472)
!510 = !DILocation(line: 2123, column: 22, scope: !455)
!511 = !DILocation(line: 2125, column: 17, scope: !455)
!512 = !{i32 1, i32 0}
!513 = !DILocation(line: 2125, column: 17, scope: !507)
!514 = !DILocation(line: 2125, column: 27, scope: !507)
!515 = !DILocation(line: 2125, column: 23, scope: !507)
!516 = !DILocation(line: 2127, column: 6, scope: !455)
!517 = distinct !DISubprogram(name: "from_residual<i32, getrandom::error::Error, getrandom::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17he4e63b993ddc6589E", scope: !457, file: !456, line: 2123, type: !518, scopeLine: 2123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !539, retainedNodes: !535)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !486, !374}
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, getrandom::error::Error>", scope: !458, file: !2, size: 64, align: 32, elements: !521, templateParams: !14, identifier: "a2b4494c3abcf1c54709bd749df9ffe8")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_variant_part, scope: !520, file: !2, size: 64, align: 32, elements: !523, templateParams: !14, identifier: "f193461f09649594e99e31edd8255709", discriminator: !534)
!523 = !{!524, !530}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !522, file: !2, baseType: !525, size: 64, align: 32, extraData: i64 0)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !520, file: !2, size: 64, align: 32, elements: !526, templateParams: !528, identifier: "25c4548a6faca70948ea416364ab9300")
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !525, file: !2, baseType: !13, size: 32, align: 32, offset: 32)
!528 = !{!529, !471}
!529 = !DITemplateTypeParameter(name: "T", type: !13)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !522, file: !2, baseType: !531, size: 64, align: 32, extraData: i64 1)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !520, file: !2, size: 64, align: 32, elements: !532, templateParams: !528, identifier: "661c1ce43b68b5b0b415f0ef64aa383b")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !531, file: !2, baseType: !472, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!535 = !{!536, !537}
!536 = !DILocalVariable(name: "residual", arg: 1, scope: !517, file: !456, line: 2123, type: !486)
!537 = !DILocalVariable(name: "e", scope: !538, file: !456, line: 2125, type: !472, align: 4)
!538 = distinct !DILexicalBlock(scope: !517, file: !456, line: 2125, column: 13)
!539 = !{!529, !471, !509}
!540 = !DILocation(line: 2123, column: 22, scope: !517)
!541 = !DILocation(line: 2125, column: 17, scope: !517)
!542 = !DILocation(line: 2125, column: 17, scope: !538)
!543 = !DILocation(line: 2125, column: 27, scope: !538)
!544 = !DILocation(line: 2125, column: 23, scope: !538)
!545 = !DILocation(line: 2127, column: 6, scope: !517)
!546 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h0fe0270c5c154cd4E", scope: !548, file: !547, line: 2361, type: !549, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !598)
!547 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c5de8437ceab25c34a962d42d2628f53")
!548 = !DINamespace(name: "{impl#59}", scope: !139)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !50, !567}
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !458, file: !2, size: 8, align: 8, elements: !552, templateParams: !14, identifier: "447757be4c16082e69889932eb17f9c")
!552 = !{!553}
!553 = !DICompositeType(tag: DW_TAG_variant_part, scope: !551, file: !2, size: 8, align: 8, elements: !554, templateParams: !14, identifier: "96c807d207af80b29492385694908cd3", discriminator: !566)
!554 = !{!555, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !553, file: !2, baseType: !556, size: 8, align: 8, extraData: i64 0)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !551, file: !2, size: 8, align: 8, elements: !557, templateParams: !559, identifier: "68fc9cadc38fd89dc5314147fe1c04c5")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !556, file: !2, baseType: !7, align: 8, offset: 8)
!559 = !{!470, !560}
!560 = !DITemplateTypeParameter(name: "E", type: !561)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !139, file: !2, align: 8, elements: !14, identifier: "1311c183d6f2d58f3dad194adbe49b3a")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !553, file: !2, baseType: !563, size: 8, align: 8, extraData: i64 1)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !551, file: !2, size: 8, align: 8, elements: !564, templateParams: !559, identifier: "c8f00e71d7b7aec3720e840d9348dce6")
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !563, file: !2, baseType: !561, align: 8, offset: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, scope: !551, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagArtificial)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !139, file: !2, size: 512, align: 64, elements: !569, templateParams: !14, identifier: "97569f54ab5a7c989a71423c5556f817")
!569 = !{!570, !571, !573, !574, !586, !587}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !568, file: !2, baseType: !59, size: 32, align: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !568, file: !2, baseType: !572, size: 32, align: 32, offset: 416)
!572 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !568, file: !2, baseType: !136, size: 8, align: 8, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !568, file: !2, baseType: !575, size: 128, align: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !25, file: !2, size: 128, align: 64, elements: !576, templateParams: !14, identifier: "b0f0daeaed8f91c87f71a0105100a674")
!576 = !{!577}
!577 = !DICompositeType(tag: DW_TAG_variant_part, scope: !575, file: !2, size: 128, align: 64, elements: !578, templateParams: !14, identifier: "eb3caad7987abf801f0cfbe00021cc02", discriminator: !585)
!578 = !{!579, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !577, file: !2, baseType: !580, size: 128, align: 64, extraData: i64 0)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !575, file: !2, size: 128, align: 64, elements: !14, templateParams: !96, identifier: "d28a3150cdbae9501568a67346894d10")
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !577, file: !2, baseType: !582, size: 128, align: 64, extraData: i64 1)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !575, file: !2, size: 128, align: 64, elements: !583, templateParams: !96, identifier: "899f8f47ef45b07334d36d49fd9ce901")
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !582, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, scope: !575, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !568, file: !2, baseType: !575, size: 128, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !568, file: !2, baseType: !588, size: 128, align: 64, offset: 256)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !589, templateParams: !14, identifier: "82c572e17c15a0d86f20372e18a95685")
!589 = !{!590, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !588, file: !2, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64, dwarfAddressSpace: 0)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !14, identifier: "9ac45caf5d58874c6d7da3fea362c3ba")
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !588, file: !2, baseType: !594, size: 64, align: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !595, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 3, lowerBound: 0)
!598 = !{!599, !600}
!599 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !547, line: 2361, type: !50)
!600 = !DILocalVariable(name: "f", arg: 2, scope: !546, file: !547, line: 2361, type: !567)
!601 = !DILocation(line: 2361, column: 20, scope: !546)
!602 = !DILocation(line: 2361, column: 27, scope: !546)
!603 = !DILocation(line: 2361, column: 71, scope: !546)
!604 = !DILocation(line: 2361, column: 62, scope: !546)
!605 = !DILocation(line: 2361, column: 84, scope: !546)
!606 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4c0ec8bd4d63c06bE", scope: !548, file: !547, line: 2361, type: !607, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !198, retainedNodes: !610)
!607 = !DISubroutineType(types: !608)
!608 = !{!551, !609, !567}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!610 = !{!611, !612}
!611 = !DILocalVariable(name: "self", arg: 1, scope: !606, file: !547, line: 2361, type: !609)
!612 = !DILocalVariable(name: "f", arg: 2, scope: !606, file: !547, line: 2361, type: !567)
!613 = !DILocation(line: 2361, column: 20, scope: !606)
!614 = !DILocation(line: 2361, column: 27, scope: !606)
!615 = !DILocation(line: 2361, column: 71, scope: !606)
!616 = !DILocation(line: 2361, column: 62, scope: !606)
!617 = !DILocation(line: 2361, column: 84, scope: !606)
!618 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h62ca58d32a1488dfE", scope: !548, file: !547, line: 2361, type: !619, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !625, retainedNodes: !622)
!619 = !DISubroutineType(types: !620)
!620 = !{!551, !621, !567}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !{!623, !624}
!623 = !DILocalVariable(name: "self", arg: 1, scope: !618, file: !547, line: 2361, type: !621)
!624 = !DILocalVariable(name: "f", arg: 2, scope: !618, file: !547, line: 2361, type: !567)
!625 = !{!529}
!626 = !DILocation(line: 2361, column: 20, scope: !618)
!627 = !DILocation(line: 2361, column: 27, scope: !618)
!628 = !DILocation(line: 2361, column: 71, scope: !618)
!629 = !{i64 4}
!630 = !DILocation(line: 2361, column: 62, scope: !618)
!631 = !DILocation(line: 2361, column: 84, scope: !618)
!632 = distinct !DISubprogram(name: "fmt<&u8>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7e996fa1da7a195cE", scope: !548, file: !547, line: 2361, type: !633, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !32, retainedNodes: !636)
!633 = !DISubroutineType(types: !634)
!634 = !{!551, !635, !567}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&&u8", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !{!637, !638}
!637 = !DILocalVariable(name: "self", arg: 1, scope: !632, file: !547, line: 2361, type: !635)
!638 = !DILocalVariable(name: "f", arg: 2, scope: !632, file: !547, line: 2361, type: !567)
!639 = !DILocation(line: 2361, column: 20, scope: !632)
!640 = !DILocation(line: 2361, column: 27, scope: !632)
!641 = !DILocation(line: 2361, column: 71, scope: !632)
!642 = !{i64 8}
!643 = !DILocation(line: 2361, column: 62, scope: !632)
!644 = !DILocation(line: 2361, column: 84, scope: !632)
!645 = distinct !DISubprogram(name: "fmt<core::option::Option<&u8>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h944f6a510380f761E", scope: !548, file: !547, line: 2361, type: !646, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !652, retainedNodes: !649)
!646 = !DISubroutineType(types: !647)
!647 = !{!551, !648, !567}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::option::Option<&u8>", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !{!650, !651}
!650 = !DILocalVariable(name: "self", arg: 1, scope: !645, file: !547, line: 2361, type: !648)
!651 = !DILocalVariable(name: "f", arg: 2, scope: !645, file: !547, line: 2361, type: !567)
!652 = !{!653}
!653 = !DITemplateTypeParameter(name: "T", type: !24)
!654 = !DILocation(line: 2361, column: 20, scope: !645)
!655 = !DILocation(line: 2361, column: 27, scope: !645)
!656 = !DILocation(line: 2361, column: 71, scope: !645)
!657 = !DILocation(line: 2361, column: 62, scope: !645)
!658 = !DILocation(line: 2361, column: 84, scope: !645)
!659 = distinct !DISubprogram(name: "eq", linkageName: "_ZN4core3cmp5impls53_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$u8$GT$2eq17h7c278dd2f7f83bacE", scope: !661, file: !660, line: 1309, type: !664, scopeLine: 1309, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !667)
!660 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "ab23074fa028287825e74e2bf421a441")
!661 = !DINamespace(name: "{impl#22}", scope: !662)
!662 = !DINamespace(name: "impls", scope: !663)
!663 = !DINamespace(name: "cmp", scope: !26)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !34, !34}
!666 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!667 = !{!668, !669}
!668 = !DILocalVariable(name: "self", arg: 1, scope: !659, file: !660, line: 1309, type: !34)
!669 = !DILocalVariable(name: "other", arg: 2, scope: !659, file: !660, line: 1309, type: !34)
!670 = !DILocation(line: 1309, column: 23, scope: !659)
!671 = !DILocation(line: 1309, column: 30, scope: !659)
!672 = !DILocation(line: 1309, column: 52, scope: !659)
!673 = !DILocation(line: 1309, column: 63, scope: !659)
!674 = !DILocation(line: 1309, column: 73, scope: !659)
!675 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$i32$GT$2ne17hf8bb558efd6cd409E", scope: !676, file: !660, line: 1311, type: !677, scopeLine: 1311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !679)
!676 = !DINamespace(name: "{impl#30}", scope: !662)
!677 = !DISubroutineType(types: !678)
!678 = !{!666, !12, !12}
!679 = !{!680, !681}
!680 = !DILocalVariable(name: "self", arg: 1, scope: !675, file: !660, line: 1311, type: !12)
!681 = !DILocalVariable(name: "other", arg: 2, scope: !675, file: !660, line: 1311, type: !12)
!682 = !DILocation(line: 1311, column: 23, scope: !675)
!683 = !DILocation(line: 1311, column: 30, scope: !675)
!684 = !DILocation(line: 1311, column: 52, scope: !675)
!685 = !DILocation(line: 1311, column: 63, scope: !675)
!686 = !DILocation(line: 1311, column: 73, scope: !675)
!687 = distinct !DISubprogram(name: "eq<u8, u8>", linkageName: "_ZN4core3cmp5impls69_$LT$impl$u20$core..cmp..PartialEq$LT$$RF$B$GT$$u20$for$u20$$RF$A$GT$2eq17h193696f9b4d62323E", scope: !688, file: !660, line: 1475, type: !689, scopeLine: 1475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !694, retainedNodes: !691)
!688 = !DINamespace(name: "{impl#9}", scope: !662)
!689 = !DISubroutineType(types: !690)
!690 = !{!666, !50, !50}
!691 = !{!692, !693}
!692 = !DILocalVariable(name: "self", arg: 1, scope: !687, file: !660, line: 1475, type: !50)
!693 = !DILocalVariable(name: "other", arg: 2, scope: !687, file: !660, line: 1475, type: !50)
!694 = !{!695, !696}
!695 = !DITemplateTypeParameter(name: "A", type: !35)
!696 = !DITemplateTypeParameter(name: "B", type: !35)
!697 = !DILocation(line: 1475, column: 15, scope: !687)
!698 = !DILocation(line: 1475, column: 22, scope: !687)
!699 = !DILocation(line: 1476, column: 27, scope: !687)
!700 = !DILocation(line: 1476, column: 34, scope: !687)
!701 = !DILocation(line: 1476, column: 13, scope: !687)
!702 = !DILocation(line: 1477, column: 10, scope: !687)
!703 = distinct !DISubprogram(name: "new_display<i32>", linkageName: "_ZN4core3fmt10ArgumentV111new_display17h24112d95923e3864E", scope: !704, file: !547, line: 318, type: !714, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !625, retainedNodes: !716)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !139, file: !2, size: 128, align: 64, elements: !705, templateParams: !14, identifier: "ee6afbf689c0bee499d5104ca6bc0325")
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !704, file: !2, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !708, size: 64, align: 64, dwarfAddressSpace: 0)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !709, file: !2, align: 8, elements: !14, identifier: "34b15e58e715eb947795ec8f7a6436c0")
!709 = !DINamespace(name: "{extern#0}", scope: !139)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !704, file: !2, baseType: !711, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !712, size: 64, align: 64, dwarfAddressSpace: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{!551, !707, !567}
!714 = !DISubroutineType(types: !715)
!715 = !{!704, !12}
!716 = !{!717}
!717 = !DILocalVariable(name: "x", arg: 1, scope: !703, file: !547, line: 318, type: !12)
!718 = !DILocation(line: 318, column: 30, scope: !703)
!719 = !DILocation(line: 319, column: 23, scope: !703)
!720 = !DILocalVariable(name: "x", scope: !721, file: !547, line: 319, type: !12, align: 8)
!721 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core3fmt10ArgumentV13new17h84ed5c47c3790ab5E", scope: !704, file: !547, line: 329, type: !722, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !625, retainedNodes: !727)
!722 = !DISubroutineType(types: !723)
!723 = !{!704, !12, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&i32, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !725, size: 64, align: 64, dwarfAddressSpace: 0)
!725 = !DISubroutineType(types: !726)
!726 = !{!551, !12, !567}
!727 = !{!720, !728}
!728 = !DILocalVariable(name: "f", scope: !721, file: !547, line: 319, type: !724, align: 8)
!729 = !DILocation(line: 319, column: 13, scope: !721, inlinedAt: !730)
!730 = !DILocation(line: 319, column: 13, scope: !703)
!731 = !DILocation(line: 319, column: 26, scope: !703)
!732 = !DILocation(line: 320, column: 10, scope: !703)
!733 = distinct !DISubprogram(name: "new_display<u32>", linkageName: "_ZN4core3fmt10ArgumentV111new_display17heb85d6a984daa1beE", scope: !704, file: !547, line: 318, type: !734, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !739, retainedNodes: !737)
!734 = !DISubroutineType(types: !735)
!735 = !{!704, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!737 = !{!738}
!738 = !DILocalVariable(name: "x", arg: 1, scope: !733, file: !547, line: 318, type: !736)
!739 = !{!740}
!740 = !DITemplateTypeParameter(name: "T", type: !59)
!741 = !DILocation(line: 318, column: 30, scope: !733)
!742 = !DILocation(line: 319, column: 23, scope: !733)
!743 = !DILocalVariable(name: "x", scope: !744, file: !547, line: 319, type: !736, align: 8)
!744 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core3fmt10ArgumentV13new17hfd63c1036be648bdE", scope: !704, file: !547, line: 329, type: !745, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !739, retainedNodes: !750)
!745 = !DISubroutineType(types: !746)
!746 = !{!704, !736, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&u32, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !748, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!551, !736, !567}
!750 = !{!743, !751}
!751 = !DILocalVariable(name: "f", scope: !744, file: !547, line: 319, type: !747, align: 8)
!752 = !DILocation(line: 319, column: 13, scope: !744, inlinedAt: !753)
!753 = !DILocation(line: 319, column: 13, scope: !733)
!754 = !DILocation(line: 319, column: 26, scope: !733)
!755 = !DILocation(line: 320, column: 10, scope: !733)
!756 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num49_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u8$GT$3fmt17hf55cb5b68afc02d4E", scope: !758, file: !757, line: 185, type: !760, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !762)
!757 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!758 = !DINamespace(name: "{impl#84}", scope: !759)
!759 = !DINamespace(name: "num", scope: !139)
!760 = !DISubroutineType(types: !761)
!761 = !{!551, !34, !567}
!762 = !{!763, !764}
!763 = !DILocalVariable(name: "self", arg: 1, scope: !756, file: !757, line: 185, type: !34)
!764 = !DILocalVariable(name: "f", arg: 2, scope: !756, file: !757, line: 185, type: !567)
!765 = !DILocation(line: 185, column: 20, scope: !756)
!766 = !DILocation(line: 185, column: 27, scope: !756)
!767 = !DILocation(line: 186, column: 20, scope: !756)
!768 = !DILocation(line: 188, column: 27, scope: !756)
!769 = !DILocation(line: 187, column: 21, scope: !756)
!770 = !DILocation(line: 186, column: 17, scope: !756)
!771 = !DILocation(line: 193, column: 14, scope: !756)
!772 = !DILocation(line: 191, column: 21, scope: !756)
!773 = !DILocation(line: 189, column: 21, scope: !756)
!774 = !DILocation(line: 188, column: 24, scope: !756)
!775 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hf8296b14d5bd5665E", scope: !776, file: !757, line: 185, type: !725, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !777)
!776 = !DINamespace(name: "{impl#80}", scope: !759)
!777 = !{!778, !779}
!778 = !DILocalVariable(name: "self", arg: 1, scope: !775, file: !757, line: 185, type: !12)
!779 = !DILocalVariable(name: "f", arg: 2, scope: !775, file: !757, line: 185, type: !567)
!780 = !DILocation(line: 185, column: 20, scope: !775)
!781 = !DILocation(line: 185, column: 27, scope: !775)
!782 = !DILocation(line: 186, column: 20, scope: !775)
!783 = !DILocation(line: 188, column: 27, scope: !775)
!784 = !DILocation(line: 187, column: 21, scope: !775)
!785 = !DILocation(line: 186, column: 17, scope: !775)
!786 = !DILocation(line: 193, column: 14, scope: !775)
!787 = !DILocation(line: 191, column: 21, scope: !775)
!788 = !DILocation(line: 189, column: 21, scope: !775)
!789 = !DILocation(line: 188, column: 24, scope: !775)
!790 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17ha39c3876fa88cd61E", scope: !791, file: !757, line: 185, type: !748, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !792)
!791 = !DINamespace(name: "{impl#86}", scope: !759)
!792 = !{!793, !794}
!793 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !757, line: 185, type: !736)
!794 = !DILocalVariable(name: "f", arg: 2, scope: !790, file: !757, line: 185, type: !567)
!795 = !DILocation(line: 185, column: 20, scope: !790)
!796 = !DILocation(line: 185, column: 27, scope: !790)
!797 = !DILocation(line: 186, column: 20, scope: !790)
!798 = !DILocation(line: 188, column: 27, scope: !790)
!799 = !DILocation(line: 187, column: 21, scope: !790)
!800 = !DILocation(line: 186, column: 17, scope: !790)
!801 = !DILocation(line: 193, column: 14, scope: !790)
!802 = !DILocation(line: 191, column: 21, scope: !790)
!803 = !DILocation(line: 189, column: 21, scope: !790)
!804 = !DILocation(line: 188, column: 24, scope: !790)
!805 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h99be3332c30ef80dE", scope: !806, file: !547, line: 390, type: !865, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !867)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !139, file: !2, size: 384, align: 64, elements: !807, templateParams: !14, identifier: "a0aec1d1ea3bdf613439a5e04a2603cb")
!807 = !{!808, !814, !859}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !806, file: !2, baseType: !809, size: 128, align: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !810, templateParams: !14, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!810 = !{!811, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !809, file: !2, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !809, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !806, file: !2, baseType: !815, size: 128, align: 64, offset: 128)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !25, file: !2, size: 128, align: 64, elements: !816, templateParams: !14, identifier: "b8e2606f2acd3eb73158be541d1813f2")
!816 = !{!817}
!817 = !DICompositeType(tag: DW_TAG_variant_part, scope: !815, file: !2, size: 128, align: 64, elements: !818, templateParams: !14, identifier: "61b072b58b5d70caf9daa9abacb5ef58", discriminator: !858)
!818 = !{!819, !854}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !817, file: !2, baseType: !820, size: 128, align: 64, extraData: i64 0)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !815, file: !2, size: 128, align: 64, elements: !14, templateParams: !821, identifier: "16848bde27f54ab132d75bd4989ebe65")
!821 = !{!822}
!822 = !DITemplateTypeParameter(name: "T", type: !823)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !824, templateParams: !14, identifier: "3428bfdd2bbbe5118f643cca84499de0")
!824 = !{!825, !853}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !823, file: !2, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64, dwarfAddressSpace: 0)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !137, file: !2, size: 448, align: 64, elements: !828, templateParams: !14, identifier: "83a2ed6cdf3a4449d15fd810f59936b5")
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !827, file: !2, baseType: !9, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !827, file: !2, baseType: !831, size: 384, align: 64, offset: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !137, file: !2, size: 384, align: 64, elements: !832, templateParams: !14, identifier: "b421e176fffabb1a9422c957b838033e")
!832 = !{!833, !834, !835, !836, !852}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !831, file: !2, baseType: !572, size: 32, align: 32, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !831, file: !2, baseType: !136, size: 8, align: 8, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !831, file: !2, baseType: !59, size: 32, align: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !831, file: !2, baseType: !837, size: 128, align: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !137, file: !2, size: 128, align: 64, elements: !838, templateParams: !14, identifier: "2f622710b340f12e25011af1d803f134")
!838 = !{!839}
!839 = !DICompositeType(tag: DW_TAG_variant_part, scope: !837, file: !2, size: 128, align: 64, elements: !840, templateParams: !14, identifier: "51002d1103e4bfd0e36408497abeae83", discriminator: !851)
!840 = !{!841, !845, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !839, file: !2, baseType: !842, size: 128, align: 64, extraData: i64 0)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !837, file: !2, size: 128, align: 64, elements: !843, templateParams: !14, identifier: "1444484c4dce485f1290a5a1787848de")
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !842, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !839, file: !2, baseType: !846, size: 128, align: 64, extraData: i64 1)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !837, file: !2, size: 128, align: 64, elements: !847, templateParams: !14, identifier: "e4eec8bef520573b70171b367b1cd2b3")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !839, file: !2, baseType: !850, size: 128, align: 64, extraData: i64 2)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !837, file: !2, size: 128, align: 64, elements: !14, identifier: "884829b33a492cff1c046a186fd09be2")
!851 = !DIDerivedType(tag: DW_TAG_member, scope: !837, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !831, file: !2, baseType: !837, size: 128, align: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !823, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !817, file: !2, baseType: !855, size: 128, align: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !815, file: !2, size: 128, align: 64, elements: !856, templateParams: !821, identifier: "a9d1aef8652ae3fb1ce43bf5a816afb5")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !2, baseType: !823, size: 128, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !815, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !806, file: !2, baseType: !860, size: 128, align: 64, offset: 256)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !861, templateParams: !14, identifier: "f71d9e8c03564763165f832ee1a6f5f9")
!861 = !{!862, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !860, file: !2, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64, dwarfAddressSpace: 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !860, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!806, !809, !860}
!867 = !{!868, !869}
!868 = !DILocalVariable(name: "pieces", arg: 1, scope: !805, file: !547, line: 390, type: !809)
!869 = !DILocalVariable(name: "args", arg: 2, scope: !805, file: !547, line: 390, type: !860)
!870 = !DILocation(line: 390, column: 25, scope: !805)
!871 = !DILocation(line: 390, column: 53, scope: !805)
!872 = !DILocation(line: 391, column: 12, scope: !805)
!873 = !DILocation(line: 391, column: 56, scope: !805)
!874 = !DILocation(line: 391, column: 41, scope: !805)
!875 = !DILocation(line: 394, column: 34, scope: !805)
!876 = !DILocation(line: 394, column: 9, scope: !805)
!877 = !DILocation(line: 395, column: 6, scope: !805)
!878 = !DILocation(line: 392, column: 13, scope: !805)
!879 = distinct !DISubprogram(name: "new_unchecked", linkageName: "_ZN4core3num7nonzero10NonZeroU3213new_unchecked17h79cfb156bef2252aE", scope: !476, file: !880, line: 55, type: !881, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !883)
!880 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/num/nonzero.rs", directory: "", checksumkind: CSK_MD5, checksum: "8d0e3794876aa2bb56d6d7f5f0889572")
!881 = !DISubroutineType(types: !882)
!882 = !{!476, !59}
!883 = !{!884, !885}
!884 = !DILocalVariable(name: "n", arg: 1, scope: !879, file: !880, line: 55, type: !59)
!885 = !DILocalVariable(name: "runtime", scope: !886, file: !880, line: 58, type: !888, align: 8)
!886 = !DILexicalBlockFile(scope: !887, file: !880, discriminator: 0)
!887 = distinct !DILexicalBlock(scope: !879, file: !189, line: 2319, column: 13)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !889, file: !2, size: 64, align: 64, elements: !891, templateParams: !14, identifier: "98a284a223bc766a95fd73dd76b6ec75")
!889 = !DINamespace(name: "new_unchecked", scope: !890)
!890 = !DINamespace(name: "{impl#14}", scope: !477)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__n", scope: !888, file: !2, baseType: !736, size: 64, align: 64)
!893 = !DILocation(line: 55, column: 51, scope: !879)
!894 = !DILocation(line: 59, column: 25, scope: !879)
!895 = !DILocation(line: 61, column: 18, scope: !879)
!896 = distinct !DISubprogram(name: "get", linkageName: "_ZN4core3num7nonzero10NonZeroU323get17h314ef246cfaf6da7E", scope: !476, file: !880, line: 81, type: !897, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!59, !476}
!899 = !{!900}
!900 = !DILocalVariable(name: "self", arg: 1, scope: !896, file: !880, line: 81, type: !476)
!901 = !DILocation(line: 81, column: 34, scope: !896)
!902 = !DILocation(line: 83, column: 18, scope: !896)
!903 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core3num7nonzero10NonZeroU323new17h3d281125d7b2b545E", scope: !476, file: !880, line: 68, type: !904, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !919)
!904 = !DISubroutineType(types: !905)
!905 = !{!906, !59}
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::num::nonzero::NonZeroU32>", scope: !25, file: !2, size: 32, align: 32, elements: !907, templateParams: !14, identifier: "68ced0c7478ef68656d3892e10864086")
!907 = !{!908}
!908 = !DICompositeType(tag: DW_TAG_variant_part, scope: !906, file: !2, size: 32, align: 32, elements: !909, templateParams: !14, identifier: "430d82d7df6e42a929d5d50efd0a74e0", discriminator: !918)
!909 = !{!910, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !908, file: !2, baseType: !911, size: 32, align: 32, extraData: i64 0)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !906, file: !2, size: 32, align: 32, elements: !14, templateParams: !912, identifier: "b7330ad52e9e394613aed729d49ad0f6")
!912 = !{!913}
!913 = !DITemplateTypeParameter(name: "T", type: !476)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !908, file: !2, baseType: !915, size: 32, align: 32)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !906, file: !2, size: 32, align: 32, elements: !916, templateParams: !912, identifier: "1560883a4cd2d579d91b6202269752d")
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !915, file: !2, baseType: !476, size: 32, align: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, scope: !906, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!919 = !{!920}
!920 = !DILocalVariable(name: "n", arg: 1, scope: !903, file: !880, line: 68, type: !59)
!921 = !DILocation(line: 68, column: 34, scope: !903)
!922 = !DILocation(line: 69, column: 24, scope: !903)
!923 = !DILocation(line: 73, column: 25, scope: !903)
!924 = !DILocation(line: 69, column: 21, scope: !903)
!925 = !DILocation(line: 71, column: 39, scope: !903)
!926 = !DILocation(line: 71, column: 25, scope: !903)
!927 = !DILocation(line: 75, column: 18, scope: !903)
!928 = distinct !DISubprogram(name: "call_once<fn() -> bool, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h1ba00c7159b750d3E", scope: !930, file: !929, line: 248, type: !932, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !940, retainedNodes: !937)
!929 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!930 = !DINamespace(name: "FnOnce", scope: !931)
!931 = !DINamespace(name: "function", scope: !177)
!932 = !DISubroutineType(types: !933)
!933 = !{!666, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> bool", baseType: !935, size: 64, align: 64, dwarfAddressSpace: 0)
!935 = !DISubroutineType(types: !936)
!936 = !{!666}
!937 = !{!938, !939}
!938 = !DILocalVariable(arg: 1, scope: !928, file: !929, line: 248, type: !934)
!939 = !DILocalVariable(arg: 2, scope: !928, file: !929, line: 248, type: !7)
!940 = !{!941, !942}
!941 = !DITemplateTypeParameter(name: "Self", type: !934)
!942 = !DITemplateTypeParameter(name: "Args", type: !7)
!943 = !DILocation(line: 248, column: 5, scope: !928)
!944 = distinct !DISubprogram(name: "drop_in_place<getrandom::use_file::DropGuard<getrandom::use_file::get_rng_fd::{closure_env#0}>>", linkageName: "_ZN4core3ptr119drop_in_place$LT$getrandom..use_file..DropGuard$LT$getrandom..use_file..get_rng_fd..$u7b$$u7b$closure$u7d$$u7d$$GT$$GT$17h7cdd4a952ce9a733E", scope: !210, file: !240, line: 487, type: !945, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !956, retainedNodes: !954)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut getrandom::use_file::DropGuard<getrandom::use_file::get_rng_fd::{closure_env#0}>", baseType: !948, size: 64, align: 64, dwarfAddressSpace: 0)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "DropGuard<getrandom::use_file::get_rng_fd::{closure_env#0}>", scope: !84, file: !2, align: 8, elements: !949, templateParams: !952, identifier: "246f41b3a5592c8c288cfdd4d3403ce2")
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !948, file: !2, baseType: !951, align: 8)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !83, file: !2, align: 8, elements: !14, identifier: "e080fc577138548ae8048f151140586b")
!952 = !{!953}
!953 = !DITemplateTypeParameter(name: "F", type: !951)
!954 = !{!955}
!955 = !DILocalVariable(arg: 1, scope: !944, file: !240, line: 487, type: !947)
!956 = !{!957}
!957 = !DITemplateTypeParameter(name: "T", type: !948)
!958 = !DILocation(line: 487, column: 1, scope: !944)
!959 = distinct !DISubprogram(name: "drop_in_place<getrandom::use_file::DropGuard<getrandom::use_file::wait_until_rng_ready::{closure_env#0}>>", linkageName: "_ZN4core3ptr129drop_in_place$LT$getrandom..use_file..DropGuard$LT$getrandom..use_file..wait_until_rng_ready..$u7b$$u7b$closure$u7d$$u7d$$GT$$GT$17h65ae1243c5c261b3E", scope: !210, file: !240, line: 487, type: !960, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !974, retainedNodes: !972)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut getrandom::use_file::DropGuard<getrandom::use_file::wait_until_rng_ready::{closure_env#0}>", baseType: !963, size: 64, align: 64, dwarfAddressSpace: 0)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "DropGuard<getrandom::use_file::wait_until_rng_ready::{closure_env#0}>", scope: !84, file: !2, size: 64, align: 64, elements: !964, templateParams: !970, identifier: "ac450930e5ec8a105c91a5fbb39cc230")
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !963, file: !2, baseType: !966, size: 64, align: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !967, file: !2, size: 64, align: 64, elements: !968, templateParams: !14, identifier: "a211688add339ba28da9156383097952")
!967 = !DINamespace(name: "wait_until_rng_ready", scope: !84)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__fd", scope: !966, file: !2, baseType: !12, size: 64, align: 64)
!970 = !{!971}
!971 = !DITemplateTypeParameter(name: "F", type: !966)
!972 = !{!973}
!973 = !DILocalVariable(arg: 1, scope: !959, file: !240, line: 487, type: !962)
!974 = !{!975}
!975 = !DITemplateTypeParameter(name: "T", type: !963)
!976 = !DILocation(line: 487, column: 1, scope: !959)
!977 = distinct !DISubprogram(name: "drop_in_place<i32>", linkageName: "_ZN4core3ptr24drop_in_place$LT$i32$GT$17h1a8cb7c596225aa9E", scope: !210, file: !240, line: 487, type: !978, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !625, retainedNodes: !981)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!981 = !{!982}
!982 = !DILocalVariable(arg: 1, scope: !977, file: !240, line: 487, type: !980)
!983 = !DILocation(line: 487, column: 1, scope: !977)
!984 = distinct !DISubprogram(name: "drop_in_place<u32>", linkageName: "_ZN4core3ptr24drop_in_place$LT$u32$GT$17h78d3eb013156d9feE", scope: !210, file: !240, line: 487, type: !985, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !739, retainedNodes: !988)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!988 = !{!989}
!989 = !DILocalVariable(arg: 1, scope: !984, file: !240, line: 487, type: !987)
!990 = !DILocation(line: 487, column: 1, scope: !984)
!991 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h76da04544d23bfa4E", scope: !210, file: !240, line: 487, type: !992, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !997, retainedNodes: !995)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!995 = !{!996}
!996 = !DILocalVariable(arg: 1, scope: !991, file: !240, line: 487, type: !994)
!997 = !{!998}
!998 = !DITemplateTypeParameter(name: "T", type: !12)
!999 = !DILocation(line: 487, column: 1, scope: !991)
!1000 = distinct !DISubprogram(name: "drop_in_place<&str>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$str$GT$17h060d2585bf47b5feE", scope: !210, file: !240, line: 487, type: !1001, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !1006, retainedNodes: !1004)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &str", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!1004 = !{!1005}
!1005 = !DILocalVariable(arg: 1, scope: !1000, file: !240, line: 487, type: !1003)
!1006 = !{!1007}
!1007 = !DITemplateTypeParameter(name: "T", type: !68)
!1008 = !DILocation(line: 487, column: 1, scope: !1000)
!1009 = distinct !DISubprogram(name: "drop_in_place<&&u8>", linkageName: "_ZN4core3ptr31drop_in_place$LT$$RF$$RF$u8$GT$17hb66363af6df6b951E", scope: !210, file: !240, line: 487, type: !1010, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !1015, retainedNodes: !1013)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &&u8", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!1013 = !{!1014}
!1014 = !DILocalVariable(arg: 1, scope: !1009, file: !240, line: 487, type: !1012)
!1015 = !{!1016}
!1016 = !DITemplateTypeParameter(name: "T", type: !50)
!1017 = !DILocation(line: 487, column: 1, scope: !1009)
!1018 = distinct !DISubprogram(name: "drop_in_place<&core::option::Option<&u8>>", linkageName: "_ZN4core3ptr59drop_in_place$LT$$RF$core..option..Option$LT$$RF$u8$GT$$GT$17h40b8904daa997f0fE", scope: !210, file: !240, line: 487, type: !1019, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !1024, retainedNodes: !1022)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &core::option::Option<&u8>", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!1022 = !{!1023}
!1023 = !DILocalVariable(arg: 1, scope: !1018, file: !240, line: 487, type: !1021)
!1024 = !{!1025}
!1025 = !DITemplateTypeParameter(name: "T", type: !23)
!1026 = !DILocation(line: 487, column: 1, scope: !1018)
!1027 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$6as_ptr17ha28180e2a0079decE", scope: !1029, file: !1028, line: 398, type: !1031, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !1033)
!1028 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8352df8206aaaed06ac4b697a5784e45")
!1029 = !DINamespace(name: "{impl#0}", scope: !1030)
!1030 = !DINamespace(name: "str", scope: !26)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!213, !68}
!1033 = !{!1034}
!1034 = !DILocalVariable(name: "self", arg: 1, scope: !1027, file: !1028, line: 398, type: !68)
!1035 = !DILocation(line: 398, column: 25, scope: !1027)
!1036 = !DILocation(line: 399, column: 9, scope: !1027)
!1037 = !DILocation(line: 400, column: 6, scope: !1027)
!1038 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h110a9ffd7a038f71E", scope: !87, file: !1039, line: 1753, type: !1040, scopeLine: 1753, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !133, templateParams: !14, retainedNodes: !1043)
!1039 = !DIFile(filename: "/home/dy3199/s2fuzz/scripts/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "c9c3fec35b5853b8c320a53f3ab5f77d")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!9, !1042, !150}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!1043 = !{!1044, !1045}
!1044 = !DILocalVariable(name: "self", arg: 1, scope: !1038, file: !1039, line: 1753, type: !1042)
!1045 = !DILocalVariable(name: "order", arg: 2, scope: !1038, file: !1039, line: 1753, type: !150)
!1046 = !DILocation(line: 1753, column: 25, scope: !1038)
!1047 = !DILocation(line: 1753, column: 32, scope: !1038)
!1048 = !DILocation(line: 1755, column: 38, scope: !1038)
!1049 = !DILocalVariable(name: "self", scope: !1050, file: !1039, line: 1755, type: !1056, align: 8)
!1050 = !DILexicalBlockFile(scope: !1051, file: !1039, discriminator: 0)
