; ModuleID = 'libc.b5822390-cgu.0'
source_filename = "libc.b5822390-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"unix::group" = type { i8*, i8*, i32, [1 x i32], i8** }
%"unix::rusage" = type { { i64, i64 }, { i64, i64 }, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%"unix::ipv6_mreq" = type { %"unix::align::in6_addr", i32 }
%"unix::align::in6_addr" = type { [16 x i8] }
%"unix::hostent" = type { i8*, i8**, i32, i32, i8** }
%"unix::pollfd" = type { i32, i16, i16 }
%"unix::winsize" = type { i16, i16, i16, i16 }
%"unix::sigval" = type { i8* }
%"unix::itimerval" = type { { i64, i64 }, { i64, i64 } }
%"unix::tms" = type { i64, i64, i64, i64 }
%"unix::servent" = type { i8*, i8**, i32, [1 x i32], i8* }
%"unix::protoent" = type { i8*, i8**, i32, [1 x i32] }
%"unix::linux_like::in_addr" = type { i32 }
%"unix::linux_like::ip_mreq" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr" }
%"unix::linux_like::ip_mreqn" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr", i32 }
%"unix::linux_like::ip_mreq_source" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr", %"unix::linux_like::in_addr" }
%"unix::linux_like::sockaddr" = type { i16, [14 x i8] }
%"unix::linux_like::sockaddr_in" = type { i16, i16, %"unix::linux_like::in_addr", [8 x i8] }

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 2, !"RtLibUseGOT", i32 1}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "clang LLVM (rustc version 1.64.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5)
!4 = !DIFile(filename: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.152/src/lib.rs/@/libc.b5822390-cgu.0", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.152")
!5 = !{!6}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !8, file: !7, baseType: !10, size: 8, align: 8, flags: DIFlagEnumClass, elements: !11)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "ffi", scope: !9)
!9 = !DINamespace(name: "core", scope: null)
!10 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!14 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..group$u20$as$u20$core..clone..Clone$GT$5clone17h2f344ce9779ffe88E", scope: !16, file: !15, line: 83, type: !19, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !33)
!15 = !DIFile(filename: "src/macros.rs", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.152", checksumkind: CSK_MD5, checksum: "796806da1a42f7ae26415c7276ee62b1")
!16 = !DINamespace(name: "{impl#1}", scope: !17)
!17 = !DINamespace(name: "unix", scope: !18)
!18 = !DINamespace(name: "libc", scope: null)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !32}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "group", scope: !17, file: !7, size: 256, align: 64, elements: !22, templateParams: !31, identifier: "f79c3f38213481d5c30429e0cfa15bb0")
!22 = !{!23, !26, !27, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !21, file: !7, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !21, file: !7, baseType: !24, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !21, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!28 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !21, file: !7, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut i8", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !{}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::group", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !{!34}
!34 = !DILocalVariable(name: "self", arg: 1, scope: !14, file: !15, line: 83, type: !32)
!35 = !DILocation(line: 83, column: 22, scope: !14)
!36 = !DILocation(line: 83, column: 37, scope: !14)
!37 = !DILocation(line: 83, column: 44, scope: !14)
!38 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..utimbuf$u20$as$u20$core..clone..Clone$GT$5clone17h8c1206026ab47a9bE", scope: !39, file: !15, line: 83, type: !40, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !48)
!39 = !DINamespace(name: "{impl#3}", scope: !17)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !47}
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", scope: !17, file: !7, size: 128, align: 64, elements: !43, templateParams: !31, identifier: "c986f5fa122f104bfc70b51bca668ddf")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !42, file: !7, baseType: !45, size: 64, align: 64)
!45 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !42, file: !7, baseType: !45, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::utimbuf", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !{!49}
!49 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !15, line: 83, type: !47)
!50 = !DILocation(line: 83, column: 22, scope: !38)
!51 = !DILocation(line: 83, column: 37, scope: !38)
!52 = !DILocation(line: 83, column: 44, scope: !38)
!53 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..timeval$u20$as$u20$core..clone..Clone$GT$5clone17hbdc7ff4d606587a4E", scope: !54, file: !15, line: 83, type: !55, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !62)
!54 = !DINamespace(name: "{impl#5}", scope: !17)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !61}
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", scope: !17, file: !7, size: 128, align: 64, elements: !58, templateParams: !31, identifier: "478eddd32a43c0ab29bdd6708a54dd16")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !57, file: !7, baseType: !45, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !57, file: !7, baseType: !45, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timeval", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !{!63}
!63 = !DILocalVariable(name: "self", arg: 1, scope: !53, file: !15, line: 83, type: !61)
!64 = !DILocation(line: 83, column: 22, scope: !53)
!65 = !DILocation(line: 83, column: 37, scope: !53)
!66 = !DILocation(line: 83, column: 44, scope: !53)
!67 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..timespec$u20$as$u20$core..clone..Clone$GT$5clone17ha24f0ac632c10e18E", scope: !68, file: !15, line: 83, type: !69, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !76)
!68 = !DINamespace(name: "{impl#7}", scope: !17)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !75}
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", scope: !17, file: !7, size: 128, align: 64, elements: !72, templateParams: !31, identifier: "7b0ba5168f1a155042b73224b6a05399")
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !71, file: !7, baseType: !45, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !71, file: !7, baseType: !45, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timespec", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !{!77}
!77 = !DILocalVariable(name: "self", arg: 1, scope: !67, file: !15, line: 83, type: !75)
!78 = !DILocation(line: 83, column: 22, scope: !67)
!79 = !DILocation(line: 83, column: 37, scope: !67)
!80 = !DILocation(line: 83, column: 44, scope: !67)
!81 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rlimit$u20$as$u20$core..clone..Clone$GT$5clone17h65273c076e650f6cE", scope: !82, file: !15, line: 83, type: !83, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !91)
!82 = !DINamespace(name: "{impl#9}", scope: !17)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !90}
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", scope: !17, file: !7, size: 128, align: 64, elements: !86, templateParams: !31, identifier: "c17140d4d15212acb3e9667e31977bdc")
!86 = !{!87, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !85, file: !7, baseType: !88, size: 64, align: 64)
!88 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !85, file: !7, baseType: !88, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rlimit", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !{!92}
!92 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !15, line: 83, type: !90)
!93 = !DILocation(line: 83, column: 22, scope: !81)
!94 = !DILocation(line: 83, column: 37, scope: !81)
!95 = !DILocation(line: 83, column: 44, scope: !81)
!96 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rusage$u20$as$u20$core..clone..Clone$GT$5clone17hac759a16d59fbe09E", scope: !97, file: !15, line: 83, type: !98, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !119)
!97 = !DINamespace(name: "{impl#11}", scope: !17)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !118}
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", scope: !17, file: !7, size: 1152, align: 64, elements: !101, templateParams: !31, identifier: "9adb2da780049e9777b06b4a8129bb11")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !100, file: !7, baseType: !57, size: 128, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !100, file: !7, baseType: !57, size: 128, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !100, file: !7, baseType: !45, size: 64, align: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rusage", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !{!120}
!120 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !15, line: 83, type: !118)
!121 = !DILocation(line: 83, column: 22, scope: !96)
!122 = !DILocation(line: 83, column: 37, scope: !96)
!123 = !DILocation(line: 83, column: 44, scope: !96)
!124 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..ipv6_mreq$u20$as$u20$core..clone..Clone$GT$5clone17h10a9df314b18f5cdE", scope: !125, file: !15, line: 83, type: !126, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !140)
!125 = !DINamespace(name: "{impl#13}", scope: !17)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !139}
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_mreq", scope: !17, file: !7, size: 160, align: 32, elements: !129, templateParams: !31, identifier: "c82a743303608f93f7b5347301584b7a")
!129 = !{!130, !138}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_multiaddr", scope: !128, file: !7, baseType: !131, size: 128, align: 32)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", scope: !132, file: !7, size: 128, align: 32, elements: !133, templateParams: !31, identifier: "b605b235362b02cda6c52d5d1fda0ffb")
!132 = !DINamespace(name: "align", scope: !17)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "s6_addr", scope: !131, file: !7, baseType: !135, size: 128, align: 8)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 8, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 16, lowerBound: 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_interface", scope: !128, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::ipv6_mreq", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!140 = !{!141}
!141 = !DILocalVariable(name: "self", arg: 1, scope: !124, file: !15, line: 83, type: !139)
!142 = !DILocation(line: 83, column: 22, scope: !124)
!143 = !DILocation(line: 83, column: 37, scope: !124)
!144 = !DILocation(line: 83, column: 44, scope: !124)
!145 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..hostent$u20$as$u20$core..clone..Clone$GT$5clone17h45b926df452f85cfE", scope: !146, file: !15, line: 83, type: !147, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !158)
!146 = !DINamespace(name: "{impl#15}", scope: !17)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !157}
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", scope: !17, file: !7, size: 256, align: 64, elements: !150, templateParams: !31, identifier: "5477589d54f5ec4fa1133a7cb1c20ff7")
!150 = !{!151, !152, !153, !155, !156}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !149, file: !7, baseType: !24, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !149, file: !7, baseType: !30, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !149, file: !7, baseType: !154, size: 32, align: 32, offset: 128)
!154 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !149, file: !7, baseType: !154, size: 32, align: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !149, file: !7, baseType: !30, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::hostent", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !{!159}
!159 = !DILocalVariable(name: "self", arg: 1, scope: !145, file: !15, line: 83, type: !157)
!160 = !DILocation(line: 83, column: 22, scope: !145)
!161 = !DILocation(line: 83, column: 37, scope: !145)
!162 = !DILocation(line: 83, column: 44, scope: !145)
!163 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..iovec$u20$as$u20$core..clone..Clone$GT$5clone17hd8bc7173669988d9E", scope: !164, file: !15, line: 83, type: !165, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !174)
!164 = !DINamespace(name: "{impl#17}", scope: !17)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !173}
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", scope: !17, file: !7, size: 128, align: 64, elements: !168, templateParams: !31, identifier: "78dbecde3e0b98dece7ef227bf3ead1b")
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !167, file: !7, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !167, file: !7, baseType: !172, size: 64, align: 64, offset: 64)
!172 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::iovec", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !{!175}
!175 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !15, line: 83, type: !173)
!176 = !DILocation(line: 83, column: 22, scope: !163)
!177 = !DILocation(line: 83, column: 37, scope: !163)
!178 = !DILocation(line: 83, column: 44, scope: !163)
!179 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..pollfd$u20$as$u20$core..clone..Clone$GT$5clone17h226447c2249322bcE", scope: !180, file: !15, line: 83, type: !181, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !190)
!180 = !DINamespace(name: "{impl#19}", scope: !17)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !189}
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", scope: !17, file: !7, size: 64, align: 32, elements: !184, templateParams: !31, identifier: "f2110e203f22413a9ce83a390a823c52")
!184 = !{!185, !186, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !183, file: !7, baseType: !154, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !183, file: !7, baseType: !187, size: 16, align: 16, offset: 32)
!187 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !183, file: !7, baseType: !187, size: 16, align: 16, offset: 48)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::pollfd", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !{!191}
!191 = !DILocalVariable(name: "self", arg: 1, scope: !179, file: !15, line: 83, type: !189)
!192 = !DILocation(line: 83, column: 22, scope: !179)
!193 = !DILocation(line: 83, column: 37, scope: !179)
!194 = !DILocation(line: 83, column: 44, scope: !179)
!195 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..winsize$u20$as$u20$core..clone..Clone$GT$5clone17h21a96aabc08ddf49E", scope: !196, file: !15, line: 83, type: !197, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !207)
!196 = !DINamespace(name: "{impl#21}", scope: !17)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !206}
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", scope: !17, file: !7, size: 64, align: 16, elements: !200, templateParams: !31, identifier: "b183a9d2d0edf23f185a69bc7ccfafe")
!200 = !{!201, !203, !204, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !199, file: !7, baseType: !202, size: 16, align: 16)
!202 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !199, file: !7, baseType: !202, size: 16, align: 16, offset: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !199, file: !7, baseType: !202, size: 16, align: 16, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !199, file: !7, baseType: !202, size: 16, align: 16, offset: 48)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::winsize", baseType: !199, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !{!208}
!208 = !DILocalVariable(name: "self", arg: 1, scope: !195, file: !15, line: 83, type: !206)
!209 = !DILocation(line: 83, column: 22, scope: !195)
!210 = !DILocation(line: 83, column: 37, scope: !195)
!211 = !DILocation(line: 83, column: 44, scope: !195)
!212 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..linger$u20$as$u20$core..clone..Clone$GT$5clone17h0aebe3d3e451553bE", scope: !213, file: !15, line: 83, type: !214, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !221)
!213 = !DINamespace(name: "{impl#23}", scope: !17)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !220}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "linger", scope: !17, file: !7, size: 64, align: 32, elements: !217, templateParams: !31, identifier: "df339c911337a8be576c617e494c2de3")
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "l_onoff", scope: !216, file: !7, baseType: !154, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "l_linger", scope: !216, file: !7, baseType: !154, size: 32, align: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linger", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!221 = !{!222}
!222 = !DILocalVariable(name: "self", arg: 1, scope: !212, file: !15, line: 83, type: !220)
!223 = !DILocation(line: 83, column: 22, scope: !212)
!224 = !DILocation(line: 83, column: 37, scope: !212)
!225 = !DILocation(line: 83, column: 44, scope: !212)
!226 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..sigval$u20$as$u20$core..clone..Clone$GT$5clone17h8af6970776166b52E", scope: !227, file: !15, line: 83, type: !228, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !234)
!227 = !DINamespace(name: "{impl#25}", scope: !17)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !233}
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigval", scope: !17, file: !7, size: 64, align: 64, elements: !231, templateParams: !31, identifier: "91502d420f2a45805df5d046b006d3d4")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !230, file: !7, baseType: !170, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::sigval", baseType: !230, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !{!235}
!235 = !DILocalVariable(name: "self", arg: 1, scope: !226, file: !15, line: 83, type: !233)
!236 = !DILocation(line: 83, column: 22, scope: !226)
!237 = !DILocation(line: 83, column: 37, scope: !226)
!238 = !DILocation(line: 83, column: 44, scope: !226)
!239 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..itimerval$u20$as$u20$core..clone..Clone$GT$5clone17h8a05fff16e038219E", scope: !240, file: !15, line: 83, type: !241, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !248)
!240 = !DINamespace(name: "{impl#27}", scope: !17)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !247}
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", scope: !17, file: !7, size: 256, align: 64, elements: !244, templateParams: !31, identifier: "211f42c2c3941333bfc780826ed5af5d")
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !243, file: !7, baseType: !57, size: 128, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !243, file: !7, baseType: !57, size: 128, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::itimerval", baseType: !243, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !{!249}
!249 = !DILocalVariable(name: "self", arg: 1, scope: !239, file: !15, line: 83, type: !247)
!250 = !DILocation(line: 83, column: 22, scope: !239)
!251 = !DILocation(line: 83, column: 37, scope: !239)
!252 = !DILocation(line: 83, column: 44, scope: !239)
!253 = distinct !DISubprogram(name: "clone", linkageName: "_ZN54_$LT$libc..unix..tms$u20$as$u20$core..clone..Clone$GT$5clone17h09f8e9bd54119a5eE", scope: !254, file: !15, line: 83, type: !255, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !264)
!254 = !DINamespace(name: "{impl#29}", scope: !17)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !263}
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", scope: !17, file: !7, size: 256, align: 64, elements: !258, templateParams: !31, identifier: "885e2284d1121a9ea46f85c10514c26d")
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !257, file: !7, baseType: !45, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !257, file: !7, baseType: !45, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !257, file: !7, baseType: !45, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !257, file: !7, baseType: !45, size: 64, align: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::tms", baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!264 = !{!265}
!265 = !DILocalVariable(name: "self", arg: 1, scope: !253, file: !15, line: 83, type: !263)
!266 = !DILocation(line: 83, column: 22, scope: !253)
!267 = !DILocation(line: 83, column: 37, scope: !253)
!268 = !DILocation(line: 83, column: 44, scope: !253)
!269 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..servent$u20$as$u20$core..clone..Clone$GT$5clone17h936e533bd3566ad1E", scope: !270, file: !15, line: 83, type: !271, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !280)
!270 = !DINamespace(name: "{impl#31}", scope: !17)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !279}
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "servent", scope: !17, file: !7, size: 256, align: 64, elements: !274, templateParams: !31, identifier: "fbea7f9f977bba47ec2177155bc4b4d9")
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !273, file: !7, baseType: !24, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "s_aliases", scope: !273, file: !7, baseType: !30, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !273, file: !7, baseType: !154, size: 32, align: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "s_proto", scope: !273, file: !7, baseType: !24, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::servent", baseType: !273, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !{!281}
!281 = !DILocalVariable(name: "self", arg: 1, scope: !269, file: !15, line: 83, type: !279)
!282 = !DILocation(line: 83, column: 22, scope: !269)
!283 = !DILocation(line: 83, column: 37, scope: !269)
!284 = !DILocation(line: 83, column: 44, scope: !269)
!285 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..protoent$u20$as$u20$core..clone..Clone$GT$5clone17hd4a3a81331fb32c2E", scope: !286, file: !15, line: 83, type: !287, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !295)
!286 = !DINamespace(name: "{impl#33}", scope: !17)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !294}
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "protoent", scope: !17, file: !7, size: 192, align: 64, elements: !290, templateParams: !31, identifier: "362303e728315e8bbc7072d1134e7b59")
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "p_name", scope: !289, file: !7, baseType: !24, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p_aliases", scope: !289, file: !7, baseType: !30, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p_proto", scope: !289, file: !7, baseType: !154, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::protoent", baseType: !289, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !{!296}
!296 = !DILocalVariable(name: "self", arg: 1, scope: !285, file: !15, line: 83, type: !294)
!297 = !DILocation(line: 83, column: 22, scope: !285)
!298 = !DILocation(line: 83, column: 37, scope: !285)
!299 = !DILocation(line: 83, column: 44, scope: !285)
!300 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..in_addr$u20$as$u20$core..clone..Clone$GT$5clone17h538ccddd0badb1a8E", scope: !301, file: !15, line: 83, type: !303, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !309)
!301 = !DINamespace(name: "{impl#1}", scope: !302)
!302 = !DINamespace(name: "linux_like", scope: !17)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !308}
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", scope: !302, file: !7, size: 32, align: 32, elements: !306, templateParams: !31, identifier: "3e4c5178764090f2cf7938ed73e3c1a9")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !305, file: !7, baseType: !28, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in_addr", baseType: !305, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !{!310}
!310 = !DILocalVariable(name: "self", arg: 1, scope: !300, file: !15, line: 83, type: !308)
!311 = !DILocation(line: 83, column: 22, scope: !300)
!312 = !DILocation(line: 83, column: 37, scope: !300)
!313 = !DILocation(line: 83, column: 44, scope: !300)
!314 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..ip_mreq$u20$as$u20$core..clone..Clone$GT$5clone17h5c84cda9314c77baE", scope: !315, file: !15, line: 83, type: !316, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !323)
!315 = !DINamespace(name: "{impl#3}", scope: !302)
!316 = !DISubroutineType(types: !317)
!317 = !{!318, !322}
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq", scope: !302, file: !7, size: 64, align: 32, elements: !319, templateParams: !31, identifier: "4b7428d4d9f82f2a467e9223d73b5dcd")
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !318, file: !7, baseType: !305, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !318, file: !7, baseType: !305, size: 32, align: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreq", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = !{!324}
!324 = !DILocalVariable(name: "self", arg: 1, scope: !314, file: !15, line: 83, type: !322)
!325 = !DILocation(line: 83, column: 22, scope: !314)
!326 = !DILocation(line: 83, column: 37, scope: !314)
!327 = !DILocation(line: 83, column: 44, scope: !314)
!328 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..ip_mreqn$u20$as$u20$core..clone..Clone$GT$5clone17h38a7024dcfd2025dE", scope: !329, file: !15, line: 83, type: !330, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !338)
!329 = !DINamespace(name: "{impl#5}", scope: !302)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !337}
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreqn", scope: !302, file: !7, size: 96, align: 32, elements: !333, templateParams: !31, identifier: "43e3d788653fd67bdad182b95e513730")
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !332, file: !7, baseType: !305, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "imr_address", scope: !332, file: !7, baseType: !305, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "imr_ifindex", scope: !332, file: !7, baseType: !154, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreqn", baseType: !332, size: 64, align: 64, dwarfAddressSpace: 0)
!338 = !{!339}
!339 = !DILocalVariable(name: "self", arg: 1, scope: !328, file: !15, line: 83, type: !337)
!340 = !DILocation(line: 83, column: 22, scope: !328)
!341 = !DILocation(line: 83, column: 37, scope: !328)
!342 = !DILocation(line: 83, column: 44, scope: !328)
!343 = distinct !DISubprogram(name: "clone", linkageName: "_ZN77_$LT$libc..unix..linux_like..ip_mreq_source$u20$as$u20$core..clone..Clone$GT$5clone17h396f21afedff0d29E", scope: !344, file: !15, line: 83, type: !345, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !353)
!344 = !DINamespace(name: "{impl#7}", scope: !302)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !352}
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq_source", scope: !302, file: !7, size: 96, align: 32, elements: !348, templateParams: !31, identifier: "f453311a51dd730c3918b7eae2c56d0")
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !347, file: !7, baseType: !305, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !347, file: !7, baseType: !305, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "imr_sourceaddr", scope: !347, file: !7, baseType: !305, size: 32, align: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreq_source", baseType: !347, size: 64, align: 64, dwarfAddressSpace: 0)
!353 = !{!354}
!354 = !DILocalVariable(name: "self", arg: 1, scope: !343, file: !15, line: 83, type: !352)
!355 = !DILocation(line: 83, column: 22, scope: !343)
!356 = !DILocation(line: 83, column: 37, scope: !343)
!357 = !DILocation(line: 83, column: 44, scope: !343)
!358 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..sockaddr$u20$as$u20$core..clone..Clone$GT$5clone17hb056148e5cc1523fE", scope: !359, file: !15, line: 83, type: !360, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !370)
!359 = !DINamespace(name: "{impl#9}", scope: !302)
!360 = !DISubroutineType(types: !361)
!361 = !{!362, !369}
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", scope: !302, file: !7, size: 128, align: 16, elements: !363, templateParams: !31, identifier: "ae5240f53c15e5844e5df5a942ffbc86")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !362, file: !7, baseType: !202, size: 16, align: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !362, file: !7, baseType: !366, size: 112, align: 8, offset: 16)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 112, align: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 14, lowerBound: 0)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!370 = !{!371}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !358, file: !15, line: 83, type: !369)
!372 = !DILocation(line: 83, column: 22, scope: !358)
!373 = !DILocation(line: 83, column: 37, scope: !358)
!374 = !DILocation(line: 83, column: 44, scope: !358)
!375 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_in$u20$as$u20$core..clone..Clone$GT$5clone17heb24fea9b7efb9e9E", scope: !376, file: !15, line: 83, type: !377, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !389)
!376 = !DINamespace(name: "{impl#11}", scope: !302)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !388}
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", scope: !302, file: !7, size: 128, align: 32, elements: !380, templateParams: !31, identifier: "f788f24d3a634a993f2d10a2d588df52")
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !379, file: !7, baseType: !202, size: 16, align: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !379, file: !7, baseType: !202, size: 16, align: 16, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !379, file: !7, baseType: !305, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !379, file: !7, baseType: !385, size: 64, align: 8, offset: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 8, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 8, lowerBound: 0)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_in", baseType: !379, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !{!390}
!390 = !DILocalVariable(name: "self", arg: 1, scope: !375, file: !15, line: 83, type: !388)
!391 = !DILocation(line: 83, column: 22, scope: !375)
!392 = !DILocation(line: 83, column: 37, scope: !375)
!393 = !DILocation(line: 83, column: 44, scope: !375)
!394 = distinct !DISubprogram(name: "clone", linkageName: "_ZN75_$LT$libc..unix..linux_like..sockaddr_in6$u20$as$u20$core..clone..Clone$GT$5clone17hed006e2c486502ceE", scope: !395, file: !15, line: 83, type: !396, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !406)
!395 = !DINamespace(name: "{impl#13}", scope: !302)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !405}
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", scope: !302, file: !7, size: 224, align: 32, elements: !399, templateParams: !31, identifier: "4060d4398627883bc275887f8b5337fd")
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !398, file: !7, baseType: !202, size: 16, align: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !398, file: !7, baseType: !202, size: 16, align: 16, offset: 16)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !398, file: !7, baseType: !28, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !398, file: !7, baseType: !131, size: 128, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !398, file: !7, baseType: !28, size: 32, align: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_in6", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!406 = !{!407}
!407 = !DILocalVariable(name: "self", arg: 1, scope: !394, file: !15, line: 83, type: !405)
!408 = !DILocation(line: 83, column: 22, scope: !394)
!409 = !DILocation(line: 83, column: 37, scope: !394)
!410 = !DILocation(line: 83, column: 44, scope: !394)
!411 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..addrinfo$u20$as$u20$core..clone..Clone$GT$5clone17ha066be4ca2288ed7E", scope: !412, file: !15, line: 83, type: !413, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !428)
!412 = !DINamespace(name: "{impl#15}", scope: !302)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !427}
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", scope: !302, file: !7, size: 384, align: 64, elements: !416, templateParams: !31, identifier: "646ff779c7c7479e3a18b0dad7dde8a1")
!416 = !{!417, !418, !419, !420, !421, !422, !424, !425}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !415, file: !7, baseType: !154, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !415, file: !7, baseType: !154, size: 32, align: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !415, file: !7, baseType: !154, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !415, file: !7, baseType: !154, size: 32, align: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !415, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !415, file: !7, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::sockaddr", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !415, file: !7, baseType: !24, size: 64, align: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !415, file: !7, baseType: !426, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::addrinfo", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::addrinfo", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!428 = !{!429}
!429 = !DILocalVariable(name: "self", arg: 1, scope: !411, file: !15, line: 83, type: !427)
!430 = !DILocation(line: 83, column: 22, scope: !411)
!431 = !DILocation(line: 83, column: 37, scope: !411)
!432 = !DILocation(line: 83, column: 44, scope: !411)
!433 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_ll$u20$as$u20$core..clone..Clone$GT$5clone17hb7bbd3db5b8097d2E", scope: !434, file: !15, line: 83, type: !435, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !447)
!434 = !DINamespace(name: "{impl#17}", scope: !302)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !446}
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ll", scope: !302, file: !7, size: 160, align: 32, elements: !438, templateParams: !31, identifier: "a6d7f837ade0d1c5862decb7786f9079")
!438 = !{!439, !440, !441, !442, !443, !444, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sll_family", scope: !437, file: !7, baseType: !202, size: 16, align: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sll_protocol", scope: !437, file: !7, baseType: !202, size: 16, align: 16, offset: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sll_ifindex", scope: !437, file: !7, baseType: !154, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sll_hatype", scope: !437, file: !7, baseType: !202, size: 16, align: 16, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sll_pkttype", scope: !437, file: !7, baseType: !10, size: 8, align: 8, offset: 80)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sll_halen", scope: !437, file: !7, baseType: !10, size: 8, align: 8, offset: 88)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sll_addr", scope: !437, file: !7, baseType: !385, size: 64, align: 8, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_ll", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !{!448}
!448 = !DILocalVariable(name: "self", arg: 1, scope: !433, file: !15, line: 83, type: !446)
!449 = !DILocation(line: 83, column: 22, scope: !433)
!450 = !DILocation(line: 83, column: 37, scope: !433)
!451 = !DILocation(line: 83, column: 44, scope: !433)
!452 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..fd_set$u20$as$u20$core..clone..Clone$GT$5clone17ha99b51645e743db1E", scope: !453, file: !15, line: 83, type: !454, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !461)
!453 = !DINamespace(name: "{impl#19}", scope: !302)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !460}
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "fd_set", scope: !302, file: !7, size: 1024, align: 64, elements: !457, templateParams: !31, identifier: "7ea7d4ca229687cdc1a49944cb5c0fe5")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !456, file: !7, baseType: !459, size: 1024, align: 64)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 1024, align: 64, elements: !136)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::fd_set", baseType: !456, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !{!462}
!462 = !DILocalVariable(name: "self", arg: 1, scope: !452, file: !15, line: 83, type: !460)
!463 = !DILocation(line: 83, column: 22, scope: !452)
!464 = !DILocation(line: 83, column: 37, scope: !452)
!465 = !DILocation(line: 83, column: 44, scope: !452)
!466 = distinct !DISubprogram(name: "clone", linkageName: "_ZN65_$LT$libc..unix..linux_like..tm$u20$as$u20$core..clone..Clone$GT$5clone17h9535e110717af77fE", scope: !467, file: !15, line: 83, type: !468, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !485)
!467 = !DINamespace(name: "{impl#21}", scope: !302)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !484}
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", scope: !302, file: !7, size: 448, align: 64, elements: !471, templateParams: !31, identifier: "48a5188c2c942b2274cf2255394a0527")
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !470, file: !7, baseType: !154, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !470, file: !7, baseType: !154, size: 32, align: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !470, file: !7, baseType: !45, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !470, file: !7, baseType: !483, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::tm", baseType: !470, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !{!486}
!486 = !DILocalVariable(name: "self", arg: 1, scope: !466, file: !15, line: 83, type: !484)
!487 = !DILocation(line: 83, column: 22, scope: !466)
!488 = !DILocation(line: 83, column: 37, scope: !466)
!489 = !DILocation(line: 83, column: 44, scope: !466)
!490 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sched_param$u20$as$u20$core..clone..Clone$GT$5clone17h0c9a8c2f3f2b780fE", scope: !491, file: !15, line: 83, type: !492, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !498)
!491 = !DINamespace(name: "{impl#23}", scope: !302)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !497}
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_param", scope: !302, file: !7, size: 32, align: 32, elements: !495, templateParams: !31, identifier: "4b204231cf1d52e95a1b313596a0d0f")
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !494, file: !7, baseType: !154, size: 32, align: 32)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sched_param", baseType: !494, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !{!499}
!499 = !DILocalVariable(name: "self", arg: 1, scope: !490, file: !15, line: 83, type: !497)
!500 = !DILocation(line: 83, column: 22, scope: !490)
!501 = !DILocation(line: 83, column: 37, scope: !490)
!502 = !DILocation(line: 83, column: 44, scope: !490)
!503 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..Dl_info$u20$as$u20$core..clone..Clone$GT$5clone17ha6cc33c9553058baE", scope: !504, file: !15, line: 83, type: !505, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !514)
!504 = !DINamespace(name: "{impl#25}", scope: !302)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !513}
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dl_info", scope: !302, file: !7, size: 256, align: 64, elements: !508, templateParams: !31, identifier: "241c8a598fac91b3efcf6926d59365a7")
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !507, file: !7, baseType: !483, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !507, file: !7, baseType: !170, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !507, file: !7, baseType: !483, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !507, file: !7, baseType: !170, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::Dl_info", baseType: !507, size: 64, align: 64, dwarfAddressSpace: 0)
!514 = !{!515}
!515 = !DILocalVariable(name: "self", arg: 1, scope: !503, file: !15, line: 83, type: !513)
!516 = !DILocation(line: 83, column: 22, scope: !503)
!517 = !DILocation(line: 83, column: 37, scope: !503)
!518 = !DILocation(line: 83, column: 44, scope: !503)
!519 = distinct !DISubprogram(name: "clone", linkageName: "_ZN68_$LT$libc..unix..linux_like..lconv$u20$as$u20$core..clone..Clone$GT$5clone17h0025df0c3ba42662E", scope: !520, file: !15, line: 83, type: !521, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !550)
!520 = !DINamespace(name: "{impl#27}", scope: !302)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !549}
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", scope: !302, file: !7, size: 768, align: 64, elements: !524, templateParams: !31, identifier: "7ed8f1250a3d35b5911c7f6f2c8e7999")
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !523, file: !7, baseType: !24, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !523, file: !7, baseType: !24, size: 64, align: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 648)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 656)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 680)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 688)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 696)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 712)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 720)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !523, file: !7, baseType: !25, size: 8, align: 8, offset: 744)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::lconv", baseType: !523, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !{!551}
!551 = !DILocalVariable(name: "self", arg: 1, scope: !519, file: !15, line: 83, type: !549)
!552 = !DILocation(line: 83, column: 22, scope: !519)
!553 = !DILocation(line: 83, column: 37, scope: !519)
!554 = !DILocation(line: 83, column: 44, scope: !519)
!555 = distinct !DISubprogram(name: "clone", linkageName: "_ZN73_$LT$libc..unix..linux_like..in_pktinfo$u20$as$u20$core..clone..Clone$GT$5clone17hfb368e063c60f13fE", scope: !556, file: !15, line: 83, type: !557, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !565)
!556 = !DINamespace(name: "{impl#29}", scope: !302)
!557 = !DISubroutineType(types: !558)
!558 = !{!559, !564}
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_pktinfo", scope: !302, file: !7, size: 96, align: 32, elements: !560, templateParams: !31, identifier: "7b7ad0845cdc9c0366e85b9a17565529")
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_ifindex", scope: !559, file: !7, baseType: !154, size: 32, align: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_spec_dst", scope: !559, file: !7, baseType: !305, size: 32, align: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_addr", scope: !559, file: !7, baseType: !305, size: 32, align: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in_pktinfo", baseType: !559, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !{!566}
!566 = !DILocalVariable(name: "self", arg: 1, scope: !555, file: !15, line: 83, type: !564)
!567 = !DILocation(line: 83, column: 22, scope: !555)
!568 = !DILocation(line: 83, column: 37, scope: !555)
!569 = !DILocation(line: 83, column: 44, scope: !555)
!570 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..ifaddrs$u20$as$u20$core..clone..Clone$GT$5clone17hba08771cba0cf3a0E", scope: !571, file: !15, line: 83, type: !572, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !585)
!571 = !DINamespace(name: "{impl#31}", scope: !302)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !584}
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrs", scope: !302, file: !7, size: 448, align: 64, elements: !575, templateParams: !31, identifier: "a6a51997865254b339f9fc2588dc8319")
!575 = !{!576, !578, !579, !580, !581, !582, !583}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_next", scope: !574, file: !7, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::ifaddrs", baseType: !574, size: 64, align: 64, dwarfAddressSpace: 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_name", scope: !574, file: !7, baseType: !24, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !574, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_addr", scope: !574, file: !7, baseType: !423, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_netmask", scope: !574, file: !7, baseType: !423, size: 64, align: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_ifu", scope: !574, file: !7, baseType: !423, size: 64, align: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_data", scope: !574, file: !7, baseType: !170, size: 64, align: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ifaddrs", baseType: !574, size: 64, align: 64, dwarfAddressSpace: 0)
!585 = !{!586}
!586 = !DILocalVariable(name: "self", arg: 1, scope: !570, file: !15, line: 83, type: !584)
!587 = !DILocation(line: 83, column: 22, scope: !570)
!588 = !DILocation(line: 83, column: 37, scope: !570)
!589 = !DILocation(line: 83, column: 44, scope: !570)
!590 = distinct !DISubprogram(name: "clone", linkageName: "_ZN72_$LT$libc..unix..linux_like..in6_rtmsg$u20$as$u20$core..clone..Clone$GT$5clone17hba151cf5a1977132E", scope: !591, file: !15, line: 83, type: !592, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !607)
!591 = !DINamespace(name: "{impl#33}", scope: !302)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !606}
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_rtmsg", scope: !302, file: !7, size: 640, align: 64, elements: !595, templateParams: !31, identifier: "71fadc68d8ebb74e229ae11e0aafe358")
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst", scope: !594, file: !7, baseType: !131, size: 128, align: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src", scope: !594, file: !7, baseType: !131, size: 128, align: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_gateway", scope: !594, file: !7, baseType: !131, size: 128, align: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_type", scope: !594, file: !7, baseType: !28, size: 32, align: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst_len", scope: !594, file: !7, baseType: !202, size: 16, align: 16, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src_len", scope: !594, file: !7, baseType: !202, size: 16, align: 16, offset: 432)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_metric", scope: !594, file: !7, baseType: !28, size: 32, align: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_info", scope: !594, file: !7, baseType: !88, size: 64, align: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_flags", scope: !594, file: !7, baseType: !28, size: 32, align: 32, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_ifindex", scope: !594, file: !7, baseType: !154, size: 32, align: 32, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in6_rtmsg", baseType: !594, size: 64, align: 64, dwarfAddressSpace: 0)
!607 = !{!608}
!608 = !DILocalVariable(name: "self", arg: 1, scope: !590, file: !15, line: 83, type: !606)
!609 = !DILocation(line: 83, column: 22, scope: !590)
!610 = !DILocation(line: 83, column: 37, scope: !590)
!611 = !DILocation(line: 83, column: 44, scope: !590)
!612 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..arpreq$u20$as$u20$core..clone..Clone$GT$5clone17h33b42c23c1489e03E", scope: !613, file: !15, line: 83, type: !614, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !625)
!613 = !DINamespace(name: "{impl#35}", scope: !302)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !624}
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "arpreq", scope: !302, file: !7, size: 544, align: 32, elements: !617, templateParams: !31, identifier: "50af33828b4b22e2a4008289b66df95f")
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "arp_pa", scope: !616, file: !7, baseType: !362, size: 128, align: 16)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "arp_ha", scope: !616, file: !7, baseType: !362, size: 128, align: 16, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "arp_flags", scope: !616, file: !7, baseType: !154, size: 32, align: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "arp_netmask", scope: !616, file: !7, baseType: !362, size: 128, align: 16, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "arp_dev", scope: !616, file: !7, baseType: !623, size: 128, align: 8, offset: 416)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, align: 8, elements: !136)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arpreq", baseType: !616, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !{!626}
!626 = !DILocalVariable(name: "self", arg: 1, scope: !612, file: !15, line: 83, type: !624)
!627 = !DILocation(line: 83, column: 22, scope: !612)
!628 = !DILocation(line: 83, column: 37, scope: !612)
!629 = !DILocation(line: 83, column: 44, scope: !612)
!630 = distinct !DISubprogram(name: "clone", linkageName: "_ZN73_$LT$libc..unix..linux_like..arpreq_old$u20$as$u20$core..clone..Clone$GT$5clone17ha289e847a3844786E", scope: !631, file: !15, line: 83, type: !632, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !641)
!631 = !DINamespace(name: "{impl#37}", scope: !302)
!632 = !DISubroutineType(types: !633)
!633 = !{!634, !640}
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "arpreq_old", scope: !302, file: !7, size: 416, align: 32, elements: !635, templateParams: !31, identifier: "8d15e140f8d546d8770e1e252bc1f62d")
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "arp_pa", scope: !634, file: !7, baseType: !362, size: 128, align: 16)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "arp_ha", scope: !634, file: !7, baseType: !362, size: 128, align: 16, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "arp_flags", scope: !634, file: !7, baseType: !154, size: 32, align: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "arp_netmask", scope: !634, file: !7, baseType: !362, size: 128, align: 16, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arpreq_old", baseType: !634, size: 64, align: 64, dwarfAddressSpace: 0)
!641 = !{!642}
!642 = !DILocalVariable(name: "self", arg: 1, scope: !630, file: !15, line: 83, type: !640)
!643 = !DILocation(line: 83, column: 22, scope: !630)
!644 = !DILocation(line: 83, column: 37, scope: !630)
!645 = !DILocation(line: 83, column: 44, scope: !630)
!646 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..arphdr$u20$as$u20$core..clone..Clone$GT$5clone17h31b39eb88de3f3fbE", scope: !647, file: !15, line: 83, type: !648, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !658)
!647 = !DINamespace(name: "{impl#39}", scope: !302)
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !657}
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "arphdr", scope: !302, file: !7, size: 64, align: 16, elements: !651, templateParams: !31, identifier: "f4c8a38a6e6309a22b2411adcedf3a1")
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hrd", scope: !650, file: !7, baseType: !202, size: 16, align: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pro", scope: !650, file: !7, baseType: !202, size: 16, align: 16, offset: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hln", scope: !650, file: !7, baseType: !10, size: 8, align: 8, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pln", scope: !650, file: !7, baseType: !10, size: 8, align: 8, offset: 40)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ar_op", scope: !650, file: !7, baseType: !202, size: 16, align: 16, offset: 48)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arphdr", baseType: !650, size: 64, align: 64, dwarfAddressSpace: 0)
!658 = !{!659}
!659 = !DILocalVariable(name: "self", arg: 1, scope: !646, file: !15, line: 83, type: !657)
!660 = !DILocation(line: 83, column: 22, scope: !646)
!661 = !DILocation(line: 83, column: 37, scope: !646)
!662 = !DILocation(line: 83, column: 44, scope: !646)
!663 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..mmsghdr$u20$as$u20$core..clone..Clone$GT$5clone17hae27fb12f8e3e313E", scope: !664, file: !15, line: 83, type: !665, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !684)
!664 = !DINamespace(name: "{impl#41}", scope: !302)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !683}
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmsghdr", scope: !302, file: !7, size: 512, align: 64, elements: !668, templateParams: !31, identifier: "89ea4306304b9e332742ff44acbd2558")
!668 = !{!669, !682}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "msg_hdr", scope: !667, file: !7, baseType: !670, size: 448, align: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", scope: !671, file: !7, size: 448, align: 64, elements: !673, templateParams: !31, identifier: "73061395d53eb6d6bf099807c5eb99f2")
!671 = !DINamespace(name: "gnu", scope: !672)
!672 = !DINamespace(name: "linux", scope: !302)
!673 = !{!674, !675, !676, !678, !679, !680, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !670, file: !7, baseType: !170, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !670, file: !7, baseType: !28, size: 32, align: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !670, file: !7, baseType: !677, size: 64, align: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::iovec", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !670, file: !7, baseType: !172, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !670, file: !7, baseType: !170, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !670, file: !7, baseType: !172, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !670, file: !7, baseType: !154, size: 32, align: 32, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !667, file: !7, baseType: !28, size: 32, align: 32, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::mmsghdr", baseType: !667, size: 64, align: 64, dwarfAddressSpace: 0)
!684 = !{!685}
!685 = !DILocalVariable(name: "self", arg: 1, scope: !663, file: !15, line: 83, type: !683)
!686 = !DILocation(line: 83, column: 22, scope: !663)
!687 = !DILocation(line: 83, column: 37, scope: !663)
!688 = !DILocation(line: 83, column: 44, scope: !663)
!689 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..epoll_event$u20$as$u20$core..clone..Clone$GT$5clone17h4da04e871c0bcf65E", scope: !690, file: !15, line: 118, type: !691, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !698)
!690 = !DINamespace(name: "{impl#43}", scope: !302)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !697}
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", scope: !302, file: !7, size: 96, align: 8, elements: !694, templateParams: !31, identifier: "169c9ccf36ae19fcf713a58b82d8d978")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !693, file: !7, baseType: !28, size: 32, align: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !693, file: !7, baseType: !88, size: 64, align: 64, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::epoll_event", baseType: !693, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !{!699}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !15, line: 118, type: !697)
!700 = !DILocation(line: 118, column: 22, scope: !689)
!701 = !DILocation(line: 118, column: 37, scope: !689)
!702 = !DILocation(line: 118, column: 44, scope: !689)
!703 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_un$u20$as$u20$core..clone..Clone$GT$5clone17h03d0aee06ab8efedE", scope: !704, file: !15, line: 118, type: !705, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !715)
!704 = !DINamespace(name: "{impl#45}", scope: !302)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !714}
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", scope: !302, file: !7, size: 880, align: 16, elements: !708, templateParams: !31, identifier: "2e6f61cbe667cc9822d5fb4bac939eb3")
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !707, file: !7, baseType: !202, size: 16, align: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !707, file: !7, baseType: !711, size: 864, align: 8, offset: 16)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 864, align: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 108, lowerBound: 0)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_un", baseType: !707, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !{!716}
!716 = !DILocalVariable(name: "self", arg: 1, scope: !703, file: !15, line: 118, type: !714)
!717 = !DILocation(line: 118, column: 22, scope: !703)
!718 = !DILocation(line: 118, column: 37, scope: !703)
!719 = !DILocation(line: 118, column: 44, scope: !703)
!720 = distinct !DISubprogram(name: "clone", linkageName: "_ZN79_$LT$libc..unix..linux_like..sockaddr_storage$u20$as$u20$core..clone..Clone$GT$5clone17h3509007ac7aa1b30E", scope: !721, file: !15, line: 118, type: !722, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !733)
!721 = !DINamespace(name: "{impl#47}", scope: !302)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !732}
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", scope: !302, file: !7, size: 1024, align: 64, elements: !725, templateParams: !31, identifier: "ecf7fef017c8286651fc0067980eb0e")
!725 = !{!726, !727, !731}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !724, file: !7, baseType: !202, size: 16, align: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad2", scope: !724, file: !7, baseType: !728, size: 944, align: 8, offset: 16)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 944, align: 8, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 118, lowerBound: 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !724, file: !7, baseType: !172, size: 64, align: 64, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_storage", baseType: !724, size: 64, align: 64, dwarfAddressSpace: 0)
!733 = !{!734}
!734 = !DILocalVariable(name: "self", arg: 1, scope: !720, file: !15, line: 118, type: !732)
!735 = !DILocation(line: 118, column: 22, scope: !720)
!736 = !DILocation(line: 118, column: 37, scope: !720)
!737 = !DILocation(line: 118, column: 44, scope: !720)
!738 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..utsname$u20$as$u20$core..clone..Clone$GT$5clone17hc7ad7a7ea7c69986E", scope: !739, file: !15, line: 118, type: !740, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !754)
!739 = !DINamespace(name: "{impl#49}", scope: !302)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !753}
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", scope: !302, file: !7, size: 3120, align: 8, elements: !743, templateParams: !31, identifier: "769118feed4fe5accfc81fde5983d06f")
!743 = !{!744, !748, !749, !750, !751, !752}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !742, file: !7, baseType: !745, size: 520, align: 8)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 520, align: 8, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 65, lowerBound: 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !742, file: !7, baseType: !745, size: 520, align: 8, offset: 520)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !742, file: !7, baseType: !745, size: 520, align: 8, offset: 1040)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !742, file: !7, baseType: !745, size: 520, align: 8, offset: 1560)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !742, file: !7, baseType: !745, size: 520, align: 8, offset: 2080)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !742, file: !7, baseType: !745, size: 520, align: 8, offset: 2600)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::utsname", baseType: !742, size: 64, align: 64, dwarfAddressSpace: 0)
!754 = !{!755}
!755 = !DILocalVariable(name: "self", arg: 1, scope: !738, file: !15, line: 118, type: !753)
!756 = !DILocation(line: 118, column: 22, scope: !738)
!757 = !DILocation(line: 118, column: 37, scope: !738)
!758 = !DILocation(line: 118, column: 44, scope: !738)
!759 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..sigevent$u20$as$u20$core..clone..Clone$GT$5clone17h8ac5aa3bd151f430E", scope: !760, file: !15, line: 118, type: !761, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !774)
!760 = !DINamespace(name: "{impl#51}", scope: !302)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !773}
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", scope: !302, file: !7, size: 512, align: 64, elements: !764, templateParams: !31, identifier: "ffd1177555c52dddd66b7c147e72149d")
!764 = !{!765, !766, !767, !768, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !763, file: !7, baseType: !230, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !763, file: !7, baseType: !154, size: 32, align: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !763, file: !7, baseType: !154, size: 32, align: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_thread_id", scope: !763, file: !7, baseType: !154, size: 32, align: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !763, file: !7, baseType: !770, size: 352, align: 32, offset: 160)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 352, align: 32, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 11, lowerBound: 0)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sigevent", baseType: !763, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !{!775}
!775 = !DILocalVariable(name: "self", arg: 1, scope: !759, file: !15, line: 118, type: !773)
!776 = !DILocation(line: 118, column: 22, scope: !759)
!777 = !DILocation(line: 118, column: 37, scope: !759)
!778 = !DILocation(line: 118, column: 44, scope: !759)
!779 = distinct !DISubprogram(name: "FUTEX_OP", linkageName: "_ZN4libc4unix10linux_like5linux8FUTEX_OP17h91a7eab9233828aaE", scope: !672, file: !780, line: 4170, type: !781, scopeLine: 4170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !783)
!780 = !DIFile(filename: "src/unix/linux_like/linux/mod.rs", directory: "/home/dy3199/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.152", checksumkind: CSK_MD5, checksum: "f962f21af0239b59fac7f31a4a1d0bcb")
!781 = !DISubroutineType(types: !782)
!782 = !{!154, !154, !154, !154, !154}
!783 = !{!784, !785, !786, !787}
!784 = !DILocalVariable(name: "op", arg: 1, scope: !779, file: !780, line: 4170, type: !154)
!785 = !DILocalVariable(name: "oparg", arg: 2, scope: !779, file: !780, line: 4170, type: !154)
!786 = !DILocalVariable(name: "cmp", arg: 3, scope: !779, file: !780, line: 4170, type: !154)
!787 = !DILocalVariable(name: "cmparg", arg: 4, scope: !779, file: !780, line: 4170, type: !154)
!788 = !DILocation(line: 4170, column: 17, scope: !779)
!789 = !DILocation(line: 4170, column: 30, scope: !779)
!790 = !DILocation(line: 4170, column: 46, scope: !779)
!791 = !DILocation(line: 4170, column: 60, scope: !779)
!792 = !DILocation(line: 4171, column: 6, scope: !779)
!793 = !DILocation(line: 4171, column: 5, scope: !779)
!794 = !DILocation(line: 4171, column: 27, scope: !779)
!795 = !DILocation(line: 4171, column: 26, scope: !779)
!796 = !DILocation(line: 4171, column: 49, scope: !779)
!797 = !DILocation(line: 4171, column: 48, scope: !779)
!798 = !DILocation(line: 4171, column: 74, scope: !779)
!799 = !DILocation(line: 4172, column: 2, scope: !779)
!800 = distinct !DISubprogram(name: "clone", linkageName: "_ZN76_$LT$libc..unix..linux_like..linux..glob_t$u20$as$u20$core..clone..Clone$GT$5clone17hceb693c19067729eE", scope: !801, file: !15, line: 83, type: !802, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !816)
!801 = !DINamespace(name: "{impl#1}", scope: !672)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !815}
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "glob_t", scope: !672, file: !7, size: 576, align: 64, elements: !805, templateParams: !31, identifier: "be82f6b90b4225396b936280a9a27d9e")
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !804, file: !7, baseType: !172, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !804, file: !7, baseType: !30, size: 64, align: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !804, file: !7, baseType: !172, size: 64, align: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gl_flags", scope: !804, file: !7, baseType: !154, size: 32, align: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !804, file: !7, baseType: !170, size: 64, align: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__unused2", scope: !804, file: !7, baseType: !170, size: 64, align: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__unused3", scope: !804, file: !7, baseType: !170, size: 64, align: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !804, file: !7, baseType: !170, size: 64, align: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !804, file: !7, baseType: !170, size: 64, align: 64, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::glob_t", baseType: !804, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !{!817}
!817 = !DILocalVariable(name: "self", arg: 1, scope: !800, file: !15, line: 83, type: !815)
!818 = !DILocation(line: 83, column: 22, scope: !800)
!819 = !DILocation(line: 83, column: 37, scope: !800)
!820 = !DILocation(line: 83, column: 44, scope: !800)
!821 = distinct !DISubprogram(name: "clone", linkageName: "_ZN76_$LT$libc..unix..linux_like..linux..passwd$u20$as$u20$core..clone..Clone$GT$5clone17h639b3f463860ec61E", scope: !822, file: !15, line: 83, type: !823, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !835)
!822 = !DINamespace(name: "{impl#3}", scope: !672)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !834}
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", scope: !672, file: !7, size: 384, align: 64, elements: !826, templateParams: !31, identifier: "bf5ad3d22bca38e282230c50b699acf1")
!826 = !{!827, !828, !829, !830, !831, !832, !833}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !825, file: !7, baseType: !24, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !825, file: !7, baseType: !24, size: 64, align: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !825, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !825, file: !7, baseType: !28, size: 32, align: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !825, file: !7, baseType: !24, size: 64, align: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !825, file: !7, baseType: !24, size: 64, align: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !825, file: !7, baseType: !24, size: 64, align: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::passwd", baseType: !825, size: 64, align: 64, dwarfAddressSpace: 0)
!835 = !{!836}
!836 = !DILocalVariable(name: "self", arg: 1, scope: !821, file: !15, line: 83, type: !834)
!837 = !DILocation(line: 83, column: 22, scope: !821)
!838 = !DILocation(line: 83, column: 37, scope: !821)
!839 = !DILocation(line: 83, column: 44, scope: !821)
!840 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..linux..spwd$u20$as$u20$core..clone..Clone$GT$5clone17h51552c6b27dc66fcE", scope: !841, file: !15, line: 83, type: !842, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !856)
!841 = !DINamespace(name: "{impl#5}", scope: !672)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !855}
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "spwd", scope: !672, file: !7, size: 576, align: 64, elements: !845, templateParams: !31, identifier: "f493836221883350a0319d103df98531")
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sp_namp", scope: !844, file: !7, baseType: !24, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sp_pwdp", scope: !844, file: !7, baseType: !24, size: 64, align: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sp_lstchg", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sp_min", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sp_max", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "sp_warn", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sp_inact", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sp_expire", scope: !844, file: !7, baseType: !45, size: 64, align: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sp_flag", scope: !844, file: !7, baseType: !88, size: 64, align: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::spwd", baseType: !844, size: 64, align: 64, dwarfAddressSpace: 0)
!856 = !{!857}
!857 = !DILocalVariable(name: "self", arg: 1, scope: !840, file: !15, line: 83, type: !855)
!858 = !DILocation(line: 83, column: 22, scope: !840)
!859 = !DILocation(line: 83, column: 37, scope: !840)
!860 = !DILocation(line: 83, column: 44, scope: !840)
!861 = distinct !DISubprogram(name: "clone", linkageName: "_ZN75_$LT$libc..unix..linux_like..linux..dqblk$u20$as$u20$core..clone..Clone$GT$5clone17hc829ceb5fb406ae4E", scope: !862, file: !15, line: 83, type: !863, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !877)
!862 = !DINamespace(name: "{impl#7}", scope: !672)
!863 = !DISubroutineType(types: !864)
!864 = !{!865, !876}
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "dqblk", scope: !672, file: !7, size: 576, align: 64, elements: !866, templateParams: !31, identifier: "a0224ea0313eca78f2d431f6f6c6a34f")
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bhardlimit", scope: !865, file: !7, baseType: !88, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bsoftlimit", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curspace", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_ihardlimit", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_isoftlimit", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curinodes", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_btime", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_itime", scope: !865, file: !7, baseType: !88, size: 64, align: 64, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_valid", scope: !865, file: !7, baseType: !28, size: 32, align: 32, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::dqblk", baseType: !865, size: 64, align: 64, dwarfAddressSpace: 0)
!877 = !{!878}
!878 = !DILocalVariable(name: "self", arg: 1, scope: !861, file: !15, line: 83, type: !876)
!879 = !DILocation(line: 83, column: 22, scope: !861)
!880 = !DILocation(line: 83, column: 37, scope: !861)
!881 = !DILocation(line: 83, column: 44, scope: !861)
!882 = distinct !DISubprogram(name: "clone", linkageName: "_ZN86_$LT$libc..unix..linux_like..linux..signalfd_siginfo$u20$as$u20$core..clone..Clone$GT$5clone17h1a477afd0947f27eE", scope: !883, file: !15, line: 83, type: !884, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !914)
!883 = !DINamespace(name: "{impl#9}", scope: !672)
!884 = !DISubroutineType(types: !885)
!885 = !{!886, !913}
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "signalfd_siginfo", scope: !672, file: !7, size: 1024, align: 64, elements: !887, templateParams: !31, identifier: "fe6d764b2c27d06327cd587f6131148c")
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_signo", scope: !886, file: !7, baseType: !28, size: 32, align: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_errno", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_code", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_pid", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_uid", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_fd", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 160)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_tid", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_band", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 224)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_overrun", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_trapno", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_status", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_int", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 352)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_ptr", scope: !886, file: !7, baseType: !88, size: 64, align: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_utime", scope: !886, file: !7, baseType: !88, size: 64, align: 64, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_stime", scope: !886, file: !7, baseType: !88, size: 64, align: 64, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_addr", scope: !886, file: !7, baseType: !88, size: 64, align: 64, offset: 576)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_addr_lsb", scope: !886, file: !7, baseType: !202, size: 16, align: 16, offset: 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !886, file: !7, baseType: !202, size: 16, align: 16, offset: 656)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_syscall", scope: !886, file: !7, baseType: !154, size: 32, align: 32, offset: 672)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_call_addr", scope: !886, file: !7, baseType: !88, size: 64, align: 64, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_arch", scope: !886, file: !7, baseType: !28, size: 32, align: 32, offset: 768)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !886, file: !7, baseType: !910, size: 224, align: 8, offset: 800)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, align: 8, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 28, lowerBound: 0)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::signalfd_siginfo", baseType: !886, size: 64, align: 64, dwarfAddressSpace: 0)
!914 = !{!915}
!915 = !DILocalVariable(name: "self", arg: 1, scope: !882, file: !15, line: 83, type: !913)
!916 = !DILocation(line: 83, column: 22, scope: !882)
!917 = !DILocation(line: 83, column: 37, scope: !882)
!918 = !DILocation(line: 83, column: 44, scope: !882)
!919 = distinct !DISubprogram(name: "clone", linkageName: "_ZN80_$LT$libc..unix..linux_like..linux..itimerspec$u20$as$u20$core..clone..Clone$GT$5clone17hd38c86cee7989028E", scope: !920, file: !15, line: 83, type: !921, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !928)
!920 = !DINamespace(name: "{impl#11}", scope: !672)
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !927}
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerspec", scope: !672, file: !7, size: 256, align: 64, elements: !924, templateParams: !31, identifier: "af4c335aace5bca42aedccb34114ad94")
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !923, file: !7, baseType: !71, size: 128, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !923, file: !7, baseType: !71, size: 128, align: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::itimerspec", baseType: !923, size: 64, align: 64, dwarfAddressSpace: 0)
!928 = !{!929}
!929 = !DILocalVariable(name: "self", arg: 1, scope: !919, file: !15, line: 83, type: !927)
!930 = !DILocation(line: 83, column: 22, scope: !919)
!931 = !DILocation(line: 83, column: 37, scope: !919)
!932 = !DILocation(line: 83, column: 44, scope: !919)
!933 = distinct !DISubprogram(name: "clone", linkageName: "_ZN76_$LT$libc..unix..linux_like..linux..fsid_t$u20$as$u20$core..clone..Clone$GT$5clone17h76e2f231896c9681E", scope: !934, file: !15, line: 83, type: !935, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !944)
!934 = !DINamespace(name: "{impl#13}", scope: !672)
!935 = !DISubroutineType(types: !936)
!936 = !{!937, !943}
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsid_t", scope: !672, file: !7, size: 64, align: 32, elements: !938, templateParams: !31, identifier: "eb125a4c2e0681f3abf0806f046ffe95")
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !937, file: !7, baseType: !940, size: 64, align: 32)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, align: 32, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 2, lowerBound: 0)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::fsid_t", baseType: !937, size: 64, align: 64, dwarfAddressSpace: 0)
!944 = !{!945}
!945 = !DILocalVariable(name: "self", arg: 1, scope: !933, file: !15, line: 83, type: !943)
!946 = !DILocation(line: 83, column: 22, scope: !933)
!947 = !DILocation(line: 83, column: 37, scope: !933)
!948 = !DILocation(line: 83, column: 44, scope: !933)
!949 = distinct !DISubprogram(name: "clone", linkageName: "_ZN81_$LT$libc..unix..linux_like..linux..packet_mreq$u20$as$u20$core..clone..Clone$GT$5clone17hb6881fd7e1aecd59E", scope: !950, file: !15, line: 83, type: !951, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !960)
!950 = !DINamespace(name: "{impl#15}", scope: !672)
!951 = !DISubroutineType(types: !952)
!952 = !{!953, !959}
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "packet_mreq", scope: !672, file: !7, size: 128, align: 32, elements: !954, templateParams: !31, identifier: "c2bfc67e78cf82f2410646c36813b791")
!954 = !{!955, !956, !957, !958}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mr_ifindex", scope: !953, file: !7, baseType: !154, size: 32, align: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mr_type", scope: !953, file: !7, baseType: !202, size: 16, align: 16, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mr_alen", scope: !953, file: !7, baseType: !202, size: 16, align: 16, offset: 48)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mr_address", scope: !953, file: !7, baseType: !385, size: 64, align: 8, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::packet_mreq", baseType: !953, size: 64, align: 64, dwarfAddressSpace: 0)
!960 = !{!961}
!961 = !DILocalVariable(name: "self", arg: 1, scope: !949, file: !15, line: 83, type: !959)
!962 = !DILocation(line: 83, column: 22, scope: !949)
!963 = !DILocation(line: 83, column: 37, scope: !949)
!964 = !DILocation(line: 83, column: 44, scope: !949)
!965 = distinct !DISubprogram(name: "clone", linkageName: "_ZN79_$LT$libc..unix..linux_like..linux..cpu_set_t$u20$as$u20$core..clone..Clone$GT$5clone17he7541c481968a157E", scope: !966, file: !15, line: 83, type: !967, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !973)
!966 = !DINamespace(name: "{impl#17}", scope: !672)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !972}
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpu_set_t", scope: !672, file: !7, size: 1024, align: 64, elements: !970, templateParams: !31, identifier: "24af8176954ea2b48ff96f061f79a376")
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !969, file: !7, baseType: !459, size: 1024, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::cpu_set_t", baseType: !969, size: 64, align: 64, dwarfAddressSpace: 0)
!973 = !{!974}
!974 = !DILocalVariable(name: "self", arg: 1, scope: !965, file: !15, line: 83, type: !972)
!975 = !DILocation(line: 83, column: 22, scope: !965)
!976 = !DILocation(line: 83, column: 37, scope: !965)
!977 = !DILocation(line: 83, column: 44, scope: !965)
!978 = distinct !DISubprogram(name: "clone", linkageName: "_ZN82_$LT$libc..unix..linux_like..linux..if_nameindex$u20$as$u20$core..clone..Clone$GT$5clone17h3ff11f09c9d388f9E", scope: !979, file: !15, line: 83, type: !980, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !31, retainedNodes: !987)
!979 = !DINamespace(name: "{impl#19}", scope: !672)
!980 = !DISubroutineType(types: !981)
!981 = !{!982, !986}
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_nameindex", scope: !672, file: !7, size: 128, align: 64, elements: !983, templateParams: !31, identifier: "db1e1117ed79781bb26d160b9122fb17")
