; ModuleID = 'z0vnf29e2qi6xal'
source_filename = "z0vnf29e2qi6xal"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"bindings::sqlite3_pcache" = type { [0 x i8] }
%"bindings::sqlite3_vfs" = type { i32, i32, i32, [1 x i32], %"bindings::sqlite3_vfs"*, i8*, i8*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64* }
%"bindings::sqlite3_module" = type { i32, [1 x i32], i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64* }
%"bindings::sqlite3_file" = type { %"bindings::sqlite3_file_sqlite3_io_methods"* }
%"bindings::sqlite3_file_sqlite3_io_methods" = type { i32, [1 x i32], i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64*, i64* }
%"bindings::sqlite3_vtab" = type { %"bindings::sqlite3_module"*, i32, [1 x i32], i8* }
%"bindings::Mem" = type { [0 x i8] }
%"bindings::sqlite3_mutex" = type { [0 x i8] }
%"bindings::sqlite3_vtab_cursor" = type { %"bindings::sqlite3_vtab"* }
%"bindings::sqlite3_index_info" = type { i32, [1 x i32], %"bindings::sqlite3_index_info_sqlite3_index_constraint"*, i32, [1 x i32], { i32, i8 }*, { i32, i8 }*, i32, [1 x i32], i8*, i32, i32, double }
%"bindings::sqlite3_index_info_sqlite3_index_constraint" = type { i32, i8, i8, [2 x i8], i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !14, identifier: "23ddeebffe405888e3193796ed68e411")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !18, vtableHolder: !23, templateParams: !14, identifier: "1b3bb4517c1d3f63574721dd880f4f27")
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !17, file: !2, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !17, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32) -> i32", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32) -> i32", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28, !27}
!27 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_vfs", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vfs", scope: !30, file: !2, size: 1088, align: 64, elements: !32, templateParams: !14, identifier: "c5b56efa7da6fea46570ff305659a034")
!30 = !DINamespace(name: "bindings", scope: !31)
!31 = !DINamespace(name: "libsqlite3_sys", scope: null)
!32 = !{!33, !34, !35, !36, !37, !40, !48, !219, !236, !253, !271, !288, !305, !338, !355, !372, !387, !406}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !29, file: !2, baseType: !27, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "szOsFile", scope: !29, file: !2, baseType: !27, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "mxPathname", scope: !29, file: !2, baseType: !27, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !29, file: !2, baseType: !28, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zName", scope: !29, file: !2, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pAppData", scope: !29, file: !2, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !43, file: !2, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !45)
!43 = !DINamespace(name: "ffi", scope: !44)
!44 = !DINamespace(name: "core", scope: null)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "xOpen", scope: !29, file: !2, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, *mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !51, templateParams: !14, identifier: "922ac7ef42f0972aae798a6202c2c956")
!50 = !DINamespace(name: "option", scope: !44)
!51 = !{!52}
!52 = !DICompositeType(tag: DW_TAG_variant_part, scope: !49, file: !2, size: 64, align: 64, elements: !53, templateParams: !14, identifier: "4df4821b2ff7a2f9fda6e5c9a36db3f8", discriminator: !218)
!53 = !{!54, !214}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !52, file: !2, baseType: !55, size: 64, align: 64, extraData: i64 0)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !49, file: !2, size: 64, align: 64, elements: !14, templateParams: !56, identifier: "dc3e0b1cb3dfa44a991b6865c75fbcb5")
!56 = !{!57}
!57 = !DITemplateTypeParameter(name: "T", type: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, *mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut i32) -> i32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DISubroutineType(types: !60)
!60 = !{!27, !28, !38, !61, !27, !189}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_file", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_file", scope: !30, file: !2, size: 64, align: 64, elements: !63, templateParams: !14, identifier: "4d115ba729c68fa74c5b902f0139a4c2")
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pMethods", scope: !62, file: !2, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libsqlite3_sys::bindings::sqlite3_file_sqlite3_io_methods", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_file_sqlite3_io_methods", scope: !30, file: !2, size: 832, align: 64, elements: !67, templateParams: !14, identifier: "35084395219d559419dcb69bc71e4382")
!67 = !{!68, !69, !87, !105, !123, !140, !157, !175, !176, !177, !195, !212, !213}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !66, file: !2, baseType: !27, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "xClose", scope: !66, file: !2, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !71, templateParams: !14, identifier: "2e1f87d47c8ab07a94449470e5b2c42f")
!71 = !{!72}
!72 = !DICompositeType(tag: DW_TAG_variant_part, scope: !70, file: !2, size: 64, align: 64, elements: !73, templateParams: !14, identifier: "b3a089353203c4f998423b072e2c2e00", discriminator: !85)
!73 = !{!74, !81}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !72, file: !2, baseType: !75, size: 64, align: 64, extraData: i64 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !70, file: !2, size: 64, align: 64, elements: !14, templateParams: !76, identifier: "974b2a369dcd59cde1110aa736b2f830")
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file) -> i32", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DISubroutineType(types: !80)
!80 = !{!27, !61}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !72, file: !2, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !70, file: !2, size: 64, align: 64, elements: !83, templateParams: !76, identifier: "dd92682b57b9f0c19cd6d7993474ec79")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !2, baseType: !78, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!86 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "xRead", scope: !66, file: !2, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut core::ffi::c_void, i32, i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !89, templateParams: !14, identifier: "6b4a99fbe216791c31df51bd4eab084")
!89 = !{!90}
!90 = !DICompositeType(tag: DW_TAG_variant_part, scope: !88, file: !2, size: 64, align: 64, elements: !91, templateParams: !14, identifier: "dc06add3243ad4f3e964cfe6ba6f7acb", discriminator: !104)
!91 = !{!92, !100}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !90, file: !2, baseType: !93, size: 64, align: 64, extraData: i64 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !88, file: !2, size: 64, align: 64, elements: !14, templateParams: !94, identifier: "e744569eb59f1804d8298d68bd6a845")
!94 = !{!95}
!95 = !DITemplateTypeParameter(name: "T", type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut core::ffi::c_void, i32, i64) -> i32", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DISubroutineType(types: !98)
!98 = !{!27, !61, !41, !27, !99}
!99 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !90, file: !2, baseType: !101, size: 64, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !88, file: !2, size: 64, align: 64, elements: !102, templateParams: !94, identifier: "80ca2e311b7ec7b34ce31502a8fce0c3")
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !101, file: !2, baseType: !96, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xWrite", scope: !66, file: !2, baseType: !106, size: 64, align: 64, offset: 192)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *const core::ffi::c_void, i32, i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !107, templateParams: !14, identifier: "b725f48131961af72507710a4186be")
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_variant_part, scope: !106, file: !2, size: 64, align: 64, elements: !109, templateParams: !14, identifier: "99063f9059ffc39bc0ff5643d27bc1c6", discriminator: !122)
!109 = !{!110, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !108, file: !2, baseType: !111, size: 64, align: 64, extraData: i64 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !106, file: !2, size: 64, align: 64, elements: !14, templateParams: !112, identifier: "b5e17b854b2174da360880e5878280")
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "T", type: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *const core::ffi::c_void, i32, i64) -> i32", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{!27, !61, !117, !27, !99}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::ffi::c_void", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !108, file: !2, baseType: !119, size: 64, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !106, file: !2, size: 64, align: 64, elements: !120, templateParams: !112, identifier: "472b4e2537af51cd4abf86554c59c1f5")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !119, file: !2, baseType: !114, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "xTruncate", scope: !66, file: !2, baseType: !124, size: 64, align: 64, offset: 256)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !125, templateParams: !14, identifier: "9cc6ca5992336a88957df780233d8ef6")
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !124, file: !2, size: 64, align: 64, elements: !127, templateParams: !14, identifier: "f2b3ed566e5fff02de791be07a35e541", discriminator: !139)
!127 = !{!128, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 64, align: 64, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 64, align: 64, elements: !14, templateParams: !130, identifier: "801c83e377d847b3ec83846b164b13dd")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i64) -> i32", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{!27, !61, !99}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !136, size: 64, align: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 64, align: 64, elements: !137, templateParams: !130, identifier: "381939ac0270f99ded0162cfcad63922")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !136, file: !2, baseType: !132, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "xSync", scope: !66, file: !2, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !142, templateParams: !14, identifier: "a89f27331596847789f560f86843b83")
!142 = !{!143}
!143 = !DICompositeType(tag: DW_TAG_variant_part, scope: !141, file: !2, size: 64, align: 64, elements: !144, templateParams: !14, identifier: "79682330f249e50b6569a85e2ad968eb", discriminator: !156)
!144 = !{!145, !152}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !143, file: !2, baseType: !146, size: 64, align: 64, extraData: i64 0)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !141, file: !2, size: 64, align: 64, elements: !14, templateParams: !147, identifier: "b4eb06713032faa51608835f37bf8d80")
!147 = !{!148}
!148 = !DITemplateTypeParameter(name: "T", type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i32) -> i32", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{!27, !61, !27}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !143, file: !2, baseType: !153, size: 64, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !141, file: !2, size: 64, align: 64, elements: !154, templateParams: !147, identifier: "3bf1c0aa700a86f7c7bebb37b25fc0a2")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !153, file: !2, baseType: !149, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, scope: !141, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xFileSize", scope: !66, file: !2, baseType: !158, size: 64, align: 64, offset: 384)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !159, templateParams: !14, identifier: "68f3ddef9a78de4ee92c16675904654")
!159 = !{!160}
!160 = !DICompositeType(tag: DW_TAG_variant_part, scope: !158, file: !2, size: 64, align: 64, elements: !161, templateParams: !14, identifier: "be6e3e6c9df3b238b482dd76b42d2b97", discriminator: !174)
!161 = !{!162, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !160, file: !2, baseType: !163, size: 64, align: 64, extraData: i64 0)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !158, file: !2, size: 64, align: 64, elements: !14, templateParams: !164, identifier: "ed2d2b79dacd5715492b717066dc0572")
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "T", type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i64) -> i32", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{!27, !61, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i64", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !160, file: !2, baseType: !171, size: 64, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !158, file: !2, size: 64, align: 64, elements: !172, templateParams: !164, identifier: "c067e3e50c936c603f3494bd47b1a58c")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !2, baseType: !166, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "xLock", scope: !66, file: !2, baseType: !141, size: 64, align: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "xUnlock", scope: !66, file: !2, baseType: !141, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "xCheckReservedLock", scope: !66, file: !2, baseType: !178, size: 64, align: 64, offset: 576)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !179, templateParams: !14, identifier: "662b776a261f0b67d05124cbd008faee")
!179 = !{!180}
!180 = !DICompositeType(tag: DW_TAG_variant_part, scope: !178, file: !2, size: 64, align: 64, elements: !181, templateParams: !14, identifier: "6daaf6f2d5d7174f2bbd52d893784b86", discriminator: !194)
!181 = !{!182, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !180, file: !2, baseType: !183, size: 64, align: 64, extraData: i64 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !178, file: !2, size: 64, align: 64, elements: !14, templateParams: !184, identifier: "3611e36eb3395884e55076cb0258a647")
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "T", type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i32) -> i32", baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DISubroutineType(types: !188)
!188 = !{!27, !61, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !180, file: !2, baseType: !191, size: 64, align: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !178, file: !2, size: 64, align: 64, elements: !192, templateParams: !184, identifier: "5040975a2e3ca1276410b3da719ae792")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !186, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !178, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "xFileControl", scope: !66, file: !2, baseType: !196, size: 64, align: 64, offset: 640)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut core::ffi::c_void) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !197, templateParams: !14, identifier: "ee1046d031887c5ee411232f18fb590e")
!197 = !{!198}
!198 = !DICompositeType(tag: DW_TAG_variant_part, scope: !196, file: !2, size: 64, align: 64, elements: !199, templateParams: !14, identifier: "e6fc1f837611fc2eda1e98a65d34b763", discriminator: !211)
!199 = !{!200, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !198, file: !2, baseType: !201, size: 64, align: 64, extraData: i64 0)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !196, file: !2, size: 64, align: 64, elements: !14, templateParams: !202, identifier: "87b2f2b9a6a1d5c6507a9ad3dda62861")
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut core::ffi::c_void) -> i32", baseType: !205, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !DISubroutineType(types: !206)
!206 = !{!27, !61, !27, !41}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !198, file: !2, baseType: !208, size: 64, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !196, file: !2, size: 64, align: 64, elements: !209, templateParams: !202, identifier: "497a18d524c38011eee3ca0ef14a88b0")
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !208, file: !2, baseType: !204, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, scope: !196, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "xSectorSize", scope: !66, file: !2, baseType: !70, size: 64, align: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xDeviceCharacteristics", scope: !66, file: !2, baseType: !70, size: 64, align: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !52, file: !2, baseType: !215, size: 64, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !49, file: !2, size: 64, align: 64, elements: !216, templateParams: !56, identifier: "46d5ebde67154c487f4660358288e2f4")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !215, file: !2, baseType: !58, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "xDelete", scope: !29, file: !2, baseType: !220, size: 64, align: 64, offset: 384)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !221, templateParams: !14, identifier: "6a5595264e77d7c5345e4d15d3301dea")
!221 = !{!222}
!222 = !DICompositeType(tag: DW_TAG_variant_part, scope: !220, file: !2, size: 64, align: 64, elements: !223, templateParams: !14, identifier: "fe220aa08dec774af7e5ecd0ae2c2598", discriminator: !235)
!223 = !{!224, !231}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !222, file: !2, baseType: !225, size: 64, align: 64, extraData: i64 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !220, file: !2, size: 64, align: 64, elements: !14, templateParams: !226, identifier: "b4dc99ea051a92d68a3baaa867b72602")
!226 = !{!227}
!227 = !DITemplateTypeParameter(name: "T", type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32) -> i32", baseType: !229, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !DISubroutineType(types: !230)
!230 = !{!27, !28, !38, !27}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !222, file: !2, baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !220, file: !2, size: 64, align: 64, elements: !233, templateParams: !226, identifier: "99f8f1482687e12b5769f0fa95f01f47")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !232, file: !2, baseType: !228, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !220, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xAccess", scope: !29, file: !2, baseType: !237, size: 64, align: 64, offset: 448)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32, *mut i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !238, templateParams: !14, identifier: "d71fd30825fc9ae1f8e3fecc6cab0770")
!238 = !{!239}
!239 = !DICompositeType(tag: DW_TAG_variant_part, scope: !237, file: !2, size: 64, align: 64, elements: !240, templateParams: !14, identifier: "12e43996348d9184914b7bff40649e2f", discriminator: !252)
!240 = !{!241, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !239, file: !2, baseType: !242, size: 64, align: 64, extraData: i64 0)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !237, file: !2, size: 64, align: 64, elements: !14, templateParams: !243, identifier: "f32217eb35f6e846645d930a0560ac9f")
!243 = !{!244}
!244 = !DITemplateTypeParameter(name: "T", type: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32, *mut i32) -> i32", baseType: !246, size: 64, align: 64, dwarfAddressSpace: 0)
!246 = !DISubroutineType(types: !247)
!247 = !{!27, !28, !38, !27, !189}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !239, file: !2, baseType: !249, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !237, file: !2, size: 64, align: 64, elements: !250, templateParams: !243, identifier: "9383c6e77578f7a84b497fe1a1e49e09")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !249, file: !2, baseType: !245, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "xFullPathname", scope: !29, file: !2, baseType: !254, size: 64, align: 64, offset: 512)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32, *mut i8) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !255, templateParams: !14, identifier: "652053fd58e4187350568507f5412a4")
!255 = !{!256}
!256 = !DICompositeType(tag: DW_TAG_variant_part, scope: !254, file: !2, size: 64, align: 64, elements: !257, templateParams: !14, identifier: "9494430f39c2cc7d5be2e23773c3a6e5", discriminator: !270)
!257 = !{!258, !266}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !256, file: !2, baseType: !259, size: 64, align: 64, extraData: i64 0)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !254, file: !2, size: 64, align: 64, elements: !14, templateParams: !260, identifier: "32cf71cd58e11c28db8378d1aed3aada")
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "T", type: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, i32, *mut i8) -> i32", baseType: !263, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!27, !28, !38, !27, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !256, file: !2, baseType: !267, size: 64, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !254, file: !2, size: 64, align: 64, elements: !268, templateParams: !260, identifier: "5a7938852c1f888f1dfb19291b5ab899")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !2, baseType: !262, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !254, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "xDlOpen", scope: !29, file: !2, baseType: !272, size: 64, align: 64, offset: 576)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8) -> *mut core::ffi::c_void>", scope: !50, file: !2, size: 64, align: 64, elements: !273, templateParams: !14, identifier: "77eabae1a83cbd7f42da69ea956e7d38")
!273 = !{!274}
!274 = !DICompositeType(tag: DW_TAG_variant_part, scope: !272, file: !2, size: 64, align: 64, elements: !275, templateParams: !14, identifier: "bbeeca265678aa7a5fd77a5677fd3e0", discriminator: !287)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !274, file: !2, baseType: !277, size: 64, align: 64, extraData: i64 0)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !272, file: !2, size: 64, align: 64, elements: !14, templateParams: !278, identifier: "f04aa5afd8d1eb64786e06606d9bd0fd")
!278 = !{!279}
!279 = !DITemplateTypeParameter(name: "T", type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8) -> *mut core::ffi::c_void", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{!41, !28, !38}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !274, file: !2, baseType: !284, size: 64, align: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !272, file: !2, size: 64, align: 64, elements: !285, templateParams: !278, identifier: "fb63e1b08e19c3d81093e84b2c8bb0c0")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !284, file: !2, baseType: !280, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !272, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xDlError", scope: !29, file: !2, baseType: !289, size: 64, align: 64, offset: 640)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32, *mut i8)>", scope: !50, file: !2, size: 64, align: 64, elements: !290, templateParams: !14, identifier: "aa7a5cc4e7b5fc7f83229464575390da")
!290 = !{!291}
!291 = !DICompositeType(tag: DW_TAG_variant_part, scope: !289, file: !2, size: 64, align: 64, elements: !292, templateParams: !14, identifier: "c0dd4f9700c7d13c94fc263dd0bc3c6d", discriminator: !304)
!292 = !{!293, !300}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !291, file: !2, baseType: !294, size: 64, align: 64, extraData: i64 0)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !289, file: !2, size: 64, align: 64, elements: !14, templateParams: !295, identifier: "71dad59fbd09ddfc627c84d464c33e1d")
!295 = !{!296}
!296 = !DITemplateTypeParameter(name: "T", type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32, *mut i8)", baseType: !298, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !28, !27, !265}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !291, file: !2, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !289, file: !2, size: 64, align: 64, elements: !302, templateParams: !295, identifier: "6aeb238891e3dd4e8191ebed30825e50")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !301, file: !2, baseType: !297, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, scope: !289, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "xDlSym", scope: !29, file: !2, baseType: !306, size: 64, align: 64, offset: 704)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut core::ffi::c_void, *const i8) -> core::option::Option<unsafe extern \22C\22 fn()>>", scope: !50, file: !2, size: 64, align: 64, elements: !307, templateParams: !14, identifier: "c8ad61fe1d61777485151edd4a5495cc")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_variant_part, scope: !306, file: !2, size: 64, align: 64, elements: !309, templateParams: !14, identifier: "32d2f695494d7c3c494399b09e7f44ee", discriminator: !337)
!309 = !{!310, !333}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !308, file: !2, baseType: !311, size: 64, align: 64, extraData: i64 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !306, file: !2, size: 64, align: 64, elements: !14, templateParams: !312, identifier: "142c821d4c125c309879776a0b1148a3")
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "T", type: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut core::ffi::c_void, *const i8) -> core::option::Option<unsafe extern \22C\22 fn()>", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !28, !41, !38}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn()>", scope: !50, file: !2, size: 64, align: 64, elements: !318, templateParams: !14, identifier: "f1b121f37aa19a72b4693ad45eece892")
!318 = !{!319}
!319 = !DICompositeType(tag: DW_TAG_variant_part, scope: !317, file: !2, size: 64, align: 64, elements: !320, templateParams: !14, identifier: "7e1462d5a1f865446ae1ba347e779905", discriminator: !332)
!320 = !{!321, !328}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !319, file: !2, baseType: !322, size: 64, align: 64, extraData: i64 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !317, file: !2, size: 64, align: 64, elements: !14, templateParams: !323, identifier: "66b561228de17d0f3e59646f3402f938")
!323 = !{!324}
!324 = !DITemplateTypeParameter(name: "T", type: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn()", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !319, file: !2, baseType: !329, size: 64, align: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !317, file: !2, size: 64, align: 64, elements: !330, templateParams: !323, identifier: "39dc13053247e9f1e3b53a7a3c7fee3")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !329, file: !2, baseType: !325, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, scope: !317, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !308, file: !2, baseType: !334, size: 64, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !306, file: !2, size: 64, align: 64, elements: !335, templateParams: !312, identifier: "8f15eda90bbc82cd5fa7cb2d1530fd23")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !2, baseType: !314, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !306, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "xDlClose", scope: !29, file: !2, baseType: !339, size: 64, align: 64, offset: 768)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut core::ffi::c_void)>", scope: !50, file: !2, size: 64, align: 64, elements: !340, templateParams: !14, identifier: "78680250aea7ce945cbbb688e431538e")
!340 = !{!341}
!341 = !DICompositeType(tag: DW_TAG_variant_part, scope: !339, file: !2, size: 64, align: 64, elements: !342, templateParams: !14, identifier: "2d3708ea60c5c213cfa30690c7595e21", discriminator: !354)
!342 = !{!343, !350}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !341, file: !2, baseType: !344, size: 64, align: 64, extraData: i64 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !339, file: !2, size: 64, align: 64, elements: !14, templateParams: !345, identifier: "9c20172579a7fd0aa55eff35f3e65f28")
!345 = !{!346}
!346 = !DITemplateTypeParameter(name: "T", type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut core::ffi::c_void)", baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !28, !41}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !341, file: !2, baseType: !351, size: 64, align: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !339, file: !2, size: 64, align: 64, elements: !352, templateParams: !345, identifier: "bc7fc542bcb7bcb1b00bf6b724e95e86")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !2, baseType: !347, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "xRandomness", scope: !29, file: !2, baseType: !356, size: 64, align: 64, offset: 832)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32, *mut i8) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !357, templateParams: !14, identifier: "330279cfe3b2977331b5b999ffb67a08")
!357 = !{!358}
!358 = !DICompositeType(tag: DW_TAG_variant_part, scope: !356, file: !2, size: 64, align: 64, elements: !359, templateParams: !14, identifier: "d758ae7288d6778730ec427035a0467c", discriminator: !371)
!359 = !{!360, !367}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !358, file: !2, baseType: !361, size: 64, align: 64, extraData: i64 0)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !356, file: !2, size: 64, align: 64, elements: !14, templateParams: !362, identifier: "c2c31fec9629f5f242e6a8b4a2a4e7ad")
!362 = !{!363}
!363 = !DITemplateTypeParameter(name: "T", type: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32, *mut i8) -> i32", baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DISubroutineType(types: !366)
!366 = !{!27, !28, !27, !265}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !358, file: !2, baseType: !368, size: 64, align: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !356, file: !2, size: 64, align: 64, elements: !369, templateParams: !362, identifier: "d686ca365402a6f3de6b4a50ea39ee95")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !368, file: !2, baseType: !364, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !356, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "xSleep", scope: !29, file: !2, baseType: !373, size: 64, align: 64, offset: 896)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !374, templateParams: !14, identifier: "39bc8c819b5c88422e81a5107dbbca5e")
!374 = !{!375}
!375 = !DICompositeType(tag: DW_TAG_variant_part, scope: !373, file: !2, size: 64, align: 64, elements: !376, templateParams: !14, identifier: "41540b6e13e772083da26bc4753cc003", discriminator: !386)
!376 = !{!377, !382}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !375, file: !2, baseType: !378, size: 64, align: 64, extraData: i64 0)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !373, file: !2, size: 64, align: 64, elements: !14, templateParams: !379, identifier: "3c35a7080ab60d7421ffc6776ac9795f")
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !381)
!381 = !DIBasicType(name: "<recur_type>", size: 64, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !375, file: !2, baseType: !383, size: 64, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !373, file: !2, size: 64, align: 64, elements: !384, templateParams: !379, identifier: "581b3c85515157bc6d03f0afea5d7baf")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !2, baseType: !381, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, scope: !373, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "xCurrentTime", scope: !29, file: !2, baseType: !388, size: 64, align: 64, offset: 960)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut f64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !389, templateParams: !14, identifier: "325544621f2c95402962bf1c35dd848c")
!389 = !{!390}
!390 = !DICompositeType(tag: DW_TAG_variant_part, scope: !388, file: !2, size: 64, align: 64, elements: !391, templateParams: !14, identifier: "ac1a81c530552a71bc90a1f38f2d67f6", discriminator: !405)
!391 = !{!392, !401}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !390, file: !2, baseType: !393, size: 64, align: 64, extraData: i64 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !388, file: !2, size: 64, align: 64, elements: !14, templateParams: !394, identifier: "dbb8030a69e3a309478a4a2fc3c2a5a4")
!394 = !{!395}
!395 = !DITemplateTypeParameter(name: "T", type: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *mut f64) -> i32", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!27, !28, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut f64", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!400 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !390, file: !2, baseType: !402, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !388, file: !2, size: 64, align: 64, elements: !403, templateParams: !394, identifier: "7d05813c5ad71f8f9c16ec869ded93")
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !402, file: !2, baseType: !396, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "xGetLastError", scope: !29, file: !2, baseType: !356, size: 64, align: 64, offset: 1024)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !410, vtableHolder: !415, templateParams: !14, identifier: "21469daa02dcc4d175282409455c10b7")
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !409, file: !2, baseType: !6, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !409, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab) -> i32", baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab) -> i32", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!27, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_vtab", baseType: !420, size: 64, align: 64, dwarfAddressSpace: 0)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vtab", scope: !30, file: !2, size: 192, align: 64, elements: !421, templateParams: !14, identifier: "d0d66ac2dc0b6f60990889e8149a8daa")
!421 = !{!422, !691, !692}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pModule", scope: !420, file: !2, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libsqlite3_sys::bindings::sqlite3_module", baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_module", scope: !30, file: !2, size: 1280, align: 64, elements: !425, templateParams: !14, identifier: "f54c580a93069fc41422f79a12e020ca")
!425 = !{!426, !427, !454, !455, !502, !516, !517, !539, !556, !578, !579, !580, !601, !618, !635, !636, !637, !638, !639, !674}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "iVersion", scope: !424, file: !2, baseType: !27, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "xCreate", scope: !424, file: !2, baseType: !428, size: 64, align: 64, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3, *mut core::ffi::c_void, i32, *const *const i8, *mut *mut libsqlite3_sys::bindings::sqlite3_vtab, *mut *mut i8) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !429, templateParams: !14, identifier: "2cab6bbde0df024e4db56e46a23fab8c")
!429 = !{!430}
!430 = !DICompositeType(tag: DW_TAG_variant_part, scope: !428, file: !2, size: 64, align: 64, elements: !431, templateParams: !14, identifier: "4f8954f05a56dafee34d4fd5a62d8e27", discriminator: !453)
!431 = !{!432, !449}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !430, file: !2, baseType: !433, size: 64, align: 64, extraData: i64 0)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !428, file: !2, size: 64, align: 64, elements: !14, templateParams: !434, identifier: "269870ca6202825eb42b6e0830a0fb30")
!434 = !{!435}
!435 = !DITemplateTypeParameter(name: "T", type: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3, *mut core::ffi::c_void, i32, *const *const i8, *mut *mut libsqlite3_sys::bindings::sqlite3_vtab, *mut *mut i8) -> i32", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!27, !439, !41, !27, !446, !447, !448}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3", baseType: !440, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", scope: !30, file: !2, align: 8, elements: !441, templateParams: !14, identifier: "ccd1c01b57a6830a3a362ba267bc762a")
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !440, file: !2, baseType: !443, align: 8)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, align: 8, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 0, lowerBound: 0)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const i8", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut libsqlite3_sys::bindings::sqlite3_vtab", baseType: !419, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut i8", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !430, file: !2, baseType: !450, size: 64, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !428, file: !2, size: 64, align: 64, elements: !451, templateParams: !434, identifier: "8fe271d434570fbb174e95e58d91182e")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !2, baseType: !436, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !428, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "xConnect", scope: !424, file: !2, baseType: !428, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "xBestIndex", scope: !424, file: !2, baseType: !456, size: 64, align: 64, offset: 192)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *mut libsqlite3_sys::bindings::sqlite3_index_info) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !457, templateParams: !14, identifier: "deccc9c914db3a0b85819865f2fe077f")
!457 = !{!458}
!458 = !DICompositeType(tag: DW_TAG_variant_part, scope: !456, file: !2, size: 64, align: 64, elements: !459, templateParams: !14, identifier: "e543a6cf4528c0b97702f9d1ffdcfd88", discriminator: !501)
!459 = !{!460, !497}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !458, file: !2, baseType: !461, size: 64, align: 64, extraData: i64 0)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !456, file: !2, size: 64, align: 64, elements: !14, templateParams: !462, identifier: "df9bb01240dd8d4c5d8a4a51abf0490c")
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "T", type: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *mut libsqlite3_sys::bindings::sqlite3_index_info) -> i32", baseType: !465, size: 64, align: 64, dwarfAddressSpace: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!27, !419, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_index_info", baseType: !468, size: 64, align: 64, dwarfAddressSpace: 0)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_info", scope: !30, file: !2, size: 576, align: 64, elements: !469, templateParams: !14, identifier: "4861d2b1185e20794e75b3ba3c64ad29")
!469 = !{!470, !471, !479, !480, !486, !492, !493, !494, !495, !496}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nConstraint", scope: !468, file: !2, baseType: !27, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "aConstraint", scope: !468, file: !2, baseType: !472, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_index_info_sqlite3_index_constraint", baseType: !473, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_info_sqlite3_index_constraint", scope: !30, file: !2, size: 96, align: 32, elements: !474, templateParams: !14, identifier: "193c025ddc120e1835f8604a4cf7eab8")
!474 = !{!475, !476, !477, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iColumn", scope: !473, file: !2, baseType: !27, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !473, file: !2, baseType: !13, size: 8, align: 8, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !473, file: !2, baseType: !13, size: 8, align: 8, offset: 40)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iTermOffset", scope: !473, file: !2, baseType: !27, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nOrderBy", scope: !468, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aOrderBy", scope: !468, file: !2, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_index_info_sqlite3_index_orderby", baseType: !482, size: 64, align: 64, dwarfAddressSpace: 0)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_info_sqlite3_index_orderby", scope: !30, file: !2, size: 64, align: 32, elements: !483, templateParams: !14, identifier: "5ca04c127d95242926e3b4b026253cf9")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "iColumn", scope: !482, file: !2, baseType: !27, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !482, file: !2, baseType: !13, size: 8, align: 8, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "aConstraintUsage", scope: !468, file: !2, baseType: !487, size: 64, align: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_index_info_sqlite3_index_constraint_usage", baseType: !488, size: 64, align: 64, dwarfAddressSpace: 0)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_index_info_sqlite3_index_constraint_usage", scope: !30, file: !2, size: 64, align: 32, elements: !489, templateParams: !14, identifier: "27883fe3e113fcf9c26659f78e20248e")
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "argvIndex", scope: !488, file: !2, baseType: !27, size: 32, align: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "omit", scope: !488, file: !2, baseType: !13, size: 8, align: 8, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "idxNum", scope: !468, file: !2, baseType: !27, size: 32, align: 32, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "idxStr", scope: !468, file: !2, baseType: !265, size: 64, align: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "needToFreeIdxStr", scope: !468, file: !2, baseType: !27, size: 32, align: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "orderByConsumed", scope: !468, file: !2, baseType: !27, size: 32, align: 32, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "estimatedCost", scope: !468, file: !2, baseType: !400, size: 64, align: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !458, file: !2, baseType: !498, size: 64, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !456, file: !2, size: 64, align: 64, elements: !499, templateParams: !462, identifier: "7b677a67ab6704016e1769f777da5b72")
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !498, file: !2, baseType: !464, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !456, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "xDisconnect", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 256)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !504, templateParams: !14, identifier: "ae907f1e6ee4298a9eaaea195b6b29e0")
!504 = !{!505}
!505 = !DICompositeType(tag: DW_TAG_variant_part, scope: !503, file: !2, size: 64, align: 64, elements: !506, templateParams: !14, identifier: "fc90e0ffafe14605eb4ece0e30694780", discriminator: !515)
!506 = !{!507, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !505, file: !2, baseType: !508, size: 64, align: 64, extraData: i64 0)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !503, file: !2, size: 64, align: 64, elements: !14, templateParams: !509, identifier: "6d76f53fe34ea5495aacdf2ace213237")
!509 = !{!510}
!510 = !DITemplateTypeParameter(name: "T", type: !416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !505, file: !2, baseType: !512, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !503, file: !2, size: 64, align: 64, elements: !513, templateParams: !509, identifier: "d3c75e06ab5823bdf3bd1b61d0e4f79a")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !512, file: !2, baseType: !416, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !503, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xDestroy", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "xOpen", scope: !424, file: !2, baseType: !518, size: 64, align: 64, offset: 384)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *mut *mut libsqlite3_sys::bindings::sqlite3_vtab_cursor) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !519, templateParams: !14, identifier: "6576235dcaf3dd77ebc9e29120910d53")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_variant_part, scope: !518, file: !2, size: 64, align: 64, elements: !521, templateParams: !14, identifier: "dd444db42854c87fc7850ccdbf827cef", discriminator: !538)
!521 = !{!522, !534}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !520, file: !2, baseType: !523, size: 64, align: 64, extraData: i64 0)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !518, file: !2, size: 64, align: 64, elements: !14, templateParams: !524, identifier: "286601f2435b600b30a057e7cd06260b")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *mut *mut libsqlite3_sys::bindings::sqlite3_vtab_cursor) -> i32", baseType: !527, size: 64, align: 64, dwarfAddressSpace: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!27, !419, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut libsqlite3_sys::bindings::sqlite3_vtab_cursor", baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor", baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_vtab_cursor", scope: !30, file: !2, size: 64, align: 64, elements: !532, templateParams: !14, identifier: "fce4c1f1dd0fd34e7a668244ac869826")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pVtab", scope: !531, file: !2, baseType: !419, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !520, file: !2, baseType: !535, size: 64, align: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !518, file: !2, size: 64, align: 64, elements: !536, templateParams: !524, identifier: "63ba512f9e955d6ae4443a030678634")
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !535, file: !2, baseType: !526, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "xClose", scope: !424, file: !2, baseType: !540, size: 64, align: 64, offset: 448)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !541, templateParams: !14, identifier: "e9b4509af7785842a39a4a56c917ffda")
!541 = !{!542}
!542 = !DICompositeType(tag: DW_TAG_variant_part, scope: !540, file: !2, size: 64, align: 64, elements: !543, templateParams: !14, identifier: "219cb0331218219c38cdc5113aada6d", discriminator: !555)
!543 = !{!544, !551}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !542, file: !2, baseType: !545, size: 64, align: 64, extraData: i64 0)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !540, file: !2, size: 64, align: 64, elements: !14, templateParams: !546, identifier: "5f45ba3a20e0a354666745e84cecbb7e")
!546 = !{!547}
!547 = !DITemplateTypeParameter(name: "T", type: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor) -> i32", baseType: !549, size: 64, align: 64, dwarfAddressSpace: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!27, !530}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !542, file: !2, baseType: !552, size: 64, align: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !540, file: !2, size: 64, align: 64, elements: !553, templateParams: !546, identifier: "3a60fee7f17a44aef2d0eb805c18c5d0")
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !552, file: !2, baseType: !548, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xFilter", scope: !424, file: !2, baseType: !557, size: 64, align: 64, offset: 512)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, i32, *const i8, i32, *mut *mut libsqlite3_sys::bindings::Mem) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !558, templateParams: !14, identifier: "e510d5ba88b063e2324d64202b5ef83b")
!558 = !{!559}
!559 = !DICompositeType(tag: DW_TAG_variant_part, scope: !557, file: !2, size: 64, align: 64, elements: !560, templateParams: !14, identifier: "24cd2037ca76f5071d71106ceaa3d66", discriminator: !577)
!560 = !{!561, !573}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !559, file: !2, baseType: !562, size: 64, align: 64, extraData: i64 0)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !557, file: !2, size: 64, align: 64, elements: !14, templateParams: !563, identifier: "5ba5f0cd9272b5fda84497d4e906905a")
!563 = !{!564}
!564 = !DITemplateTypeParameter(name: "T", type: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, i32, *const i8, i32, *mut *mut libsqlite3_sys::bindings::Mem) -> i32", baseType: !566, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !DISubroutineType(types: !567)
!567 = !{!27, !530, !27, !38, !27, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut libsqlite3_sys::bindings::Mem", baseType: !569, size: 64, align: 64, dwarfAddressSpace: 0)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::Mem", baseType: !570, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mem", scope: !30, file: !2, align: 8, elements: !571, templateParams: !14, identifier: "6a74734adadba918116b0799ad6f51f")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !570, file: !2, baseType: !443, align: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !559, file: !2, baseType: !574, size: 64, align: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !557, file: !2, size: 64, align: 64, elements: !575, templateParams: !563, identifier: "570a82360ff90590bbdc6c730578ac94")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !565, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "xNext", scope: !424, file: !2, baseType: !540, size: 64, align: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "xEof", scope: !424, file: !2, baseType: !540, size: 64, align: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "xColumn", scope: !424, file: !2, baseType: !581, size: 64, align: 64, offset: 704)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, *mut libsqlite3_sys::bindings::sqlite3_context, i32) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !582, templateParams: !14, identifier: "d22617d816a7f1ac90cafd361b2d48bf")
!582 = !{!583}
!583 = !DICompositeType(tag: DW_TAG_variant_part, scope: !581, file: !2, size: 64, align: 64, elements: !584, templateParams: !14, identifier: "ef2efe95edcc0be34cff94c86e2f52d", discriminator: !600)
!584 = !{!585, !596}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !583, file: !2, baseType: !586, size: 64, align: 64, extraData: i64 0)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !581, file: !2, size: 64, align: 64, elements: !14, templateParams: !587, identifier: "98106c2ebbf860169d21b7624c274c6f")
!587 = !{!588}
!588 = !DITemplateTypeParameter(name: "T", type: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, *mut libsqlite3_sys::bindings::sqlite3_context, i32) -> i32", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!27, !530, !592, !27}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_context", baseType: !593, size: 64, align: 64, dwarfAddressSpace: 0)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_context", scope: !30, file: !2, align: 8, elements: !594, templateParams: !14, identifier: "72b4dd5331fbaf08af44d92d0ef573a4")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !593, file: !2, baseType: !443, align: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !583, file: !2, baseType: !597, size: 64, align: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !581, file: !2, size: 64, align: 64, elements: !598, templateParams: !587, identifier: "159f962c2fbae8aa773e4c7505f564d4")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !597, file: !2, baseType: !589, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !581, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "xRowid", scope: !424, file: !2, baseType: !602, size: 64, align: 64, offset: 768)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, *mut i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !603, templateParams: !14, identifier: "d7cac2f0d7fdff7216f616c84c846a9c")
!603 = !{!604}
!604 = !DICompositeType(tag: DW_TAG_variant_part, scope: !602, file: !2, size: 64, align: 64, elements: !605, templateParams: !14, identifier: "31192216f550268a4116b2fb4376b4f", discriminator: !617)
!605 = !{!606, !613}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !604, file: !2, baseType: !607, size: 64, align: 64, extraData: i64 0)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !602, file: !2, size: 64, align: 64, elements: !14, templateParams: !608, identifier: "e22e51e8bb3ee6c9c3eecee9785778eb")
!608 = !{!609}
!609 = !DITemplateTypeParameter(name: "T", type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab_cursor, *mut i64) -> i32", baseType: !611, size: 64, align: 64, dwarfAddressSpace: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!27, !530, !169}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !604, file: !2, baseType: !614, size: 64, align: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !602, file: !2, size: 64, align: 64, elements: !615, templateParams: !608, identifier: "fcc44817f0b7668713cfadd401c8db9e")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !614, file: !2, baseType: !610, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, scope: !602, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "xUpdate", scope: !424, file: !2, baseType: !619, size: 64, align: 64, offset: 832)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *mut *mut libsqlite3_sys::bindings::Mem, *mut i64) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !620, templateParams: !14, identifier: "9a582bd73f4d6f9bfdddf3739265d96b")
!620 = !{!621}
!621 = !DICompositeType(tag: DW_TAG_variant_part, scope: !619, file: !2, size: 64, align: 64, elements: !622, templateParams: !14, identifier: "e15cecfd91f81a2d479585990977b5a2", discriminator: !634)
!622 = !{!623, !630}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !621, file: !2, baseType: !624, size: 64, align: 64, extraData: i64 0)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !619, file: !2, size: 64, align: 64, elements: !14, templateParams: !625, identifier: "1cbf1384a41e68e8c2a5a9a0feab47a3")
!625 = !{!626}
!626 = !DITemplateTypeParameter(name: "T", type: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *mut *mut libsqlite3_sys::bindings::Mem, *mut i64) -> i32", baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!27, !419, !27, !568, !169}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !621, file: !2, baseType: !631, size: 64, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !619, file: !2, size: 64, align: 64, elements: !632, templateParams: !625, identifier: "efaea179a43ef140af4b7e83d3a78a0c")
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !631, file: !2, baseType: !627, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, scope: !619, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "xBegin", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "xSync", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "xCommit", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "xRollback", scope: !424, file: !2, baseType: !503, size: 64, align: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "xFindFunction", scope: !424, file: !2, baseType: !640, size: 64, align: 64, offset: 1152)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *const i8, *mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>, *mut *mut core::ffi::c_void) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !641, templateParams: !14, identifier: "8b1b0b06bee020fb5bd9fa1d9b24aea3")
!641 = !{!642}
!642 = !DICompositeType(tag: DW_TAG_variant_part, scope: !640, file: !2, size: 64, align: 64, elements: !643, templateParams: !14, identifier: "4a7900324ba36a05d69a79b6d43e572a", discriminator: !673)
!643 = !{!644, !669}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !642, file: !2, baseType: !645, size: 64, align: 64, extraData: i64 0)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !640, file: !2, size: 64, align: 64, elements: !14, templateParams: !646, identifier: "6726544951074cee14ea1ade949584c6")
!646 = !{!647}
!647 = !DITemplateTypeParameter(name: "T", type: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *const i8, *mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>, *mut *mut core::ffi::c_void) -> i32", baseType: !649, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!27, !419, !27, !38, !651, !668}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>", baseType: !652, size: 64, align: 64, dwarfAddressSpace: 0)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>", scope: !50, file: !2, size: 64, align: 64, elements: !653, templateParams: !14, identifier: "ee6e62356f316c5cbc91c0a7a4299be3")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_variant_part, scope: !652, file: !2, size: 64, align: 64, elements: !655, templateParams: !14, identifier: "4f34247a39fea361dc6309809ff3ea3", discriminator: !667)
!655 = !{!656, !663}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !654, file: !2, baseType: !657, size: 64, align: 64, extraData: i64 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !652, file: !2, size: 64, align: 64, elements: !14, templateParams: !658, identifier: "e69274d8df56b4862549b79eba0b6814")
!658 = !{!659}
!659 = !DITemplateTypeParameter(name: "T", type: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)", baseType: !661, size: 64, align: 64, dwarfAddressSpace: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !592, !27, !568}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !654, file: !2, baseType: !664, size: 64, align: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !652, file: !2, size: 64, align: 64, elements: !665, templateParams: !658, identifier: "308198648854f2a785e92d584fb83b2b")
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !664, file: !2, baseType: !660, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut core::ffi::c_void", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !642, file: !2, baseType: !670, size: 64, align: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !640, file: !2, size: 64, align: 64, elements: !671, templateParams: !646, identifier: "7e03ed4fd139737177bbad1360080092")
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !670, file: !2, baseType: !648, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "xRename", scope: !424, file: !2, baseType: !675, size: 64, align: 64, offset: 1216)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *const i8) -> i32>", scope: !50, file: !2, size: 64, align: 64, elements: !676, templateParams: !14, identifier: "43546b6749df10adfee93117f4a5e5d4")
!676 = !{!677}
!677 = !DICompositeType(tag: DW_TAG_variant_part, scope: !675, file: !2, size: 64, align: 64, elements: !678, templateParams: !14, identifier: "1675bd5f45261dfd38ac3343b1f7b358", discriminator: !690)
!678 = !{!679, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !677, file: !2, baseType: !680, size: 64, align: 64, extraData: i64 0)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !675, file: !2, size: 64, align: 64, elements: !14, templateParams: !681, identifier: "b4ad75edf1c45b7b5986a613fc57fbad")
!681 = !{!682}
!682 = !DITemplateTypeParameter(name: "T", type: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, *const i8) -> i32", baseType: !684, size: 64, align: 64, dwarfAddressSpace: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!27, !419, !38}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !677, file: !2, baseType: !687, size: 64, align: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !675, file: !2, size: 64, align: 64, elements: !688, templateParams: !681, identifier: "48d5a510a803efea2d5ae9f198024b55")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !687, file: !2, baseType: !683, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, scope: !675, file: !2, baseType: !86, size: 64, align: 64, flags: DIFlagArtificial)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "nRef", scope: !420, file: !2, baseType: !27, size: 32, align: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "zErrMsg", scope: !420, file: !2, baseType: !265, size: 64, align: 64, offset: 128)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, *mut core::ffi::c_void, i32) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, *mut core::ffi::c_void, i32) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !696, vtableHolder: !701, templateParams: !14, identifier: "bdc9abdedbdd911e592a6527ad2ad5a0")
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !695, file: !2, baseType: !6, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !695, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !695, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !695, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, *mut core::ffi::c_void, i32)", baseType: !702, size: 64, align: 64, dwarfAddressSpace: 0)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, *mut core::ffi::c_void, i32)", baseType: !703, size: 64, align: 64, dwarfAddressSpace: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !705, !41, !27}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_pcache", baseType: !706, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_pcache", scope: !30, file: !2, align: 8, elements: !707, templateParams: !14, identifier: "638c99a3f7e4c32510208350eddba5dd")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !2, baseType: !443, align: 8)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *const i8, *mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>, *mut *mut core::ffi::c_void) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *const i8, *mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>, *mut *mut core::ffi::c_void) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !712, vtableHolder: !717, templateParams: !14, identifier: "c196d302f043680fc2afb741e657385c")
!712 = !{!713, !714, !715, !716}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !711, file: !2, baseType: !6, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !711, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !711, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !711, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vtab, i32, *const i8, *mut core::option::Option<unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_context, i32, *mut *mut libsqlite3_sys::bindings::Mem)>, *mut *mut core::ffi::c_void) -> i32", baseType: !648, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut core::ffi::c_void) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut core::ffi::c_void) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !721, vtableHolder: !726, templateParams: !14, identifier: "680b011db076267c99222fd1d6894dec")
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !720, file: !2, baseType: !6, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !720, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !720, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !720, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut core::ffi::c_void)", baseType: !727, size: 64, align: 64, dwarfAddressSpace: 0)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut core::ffi::c_void)", baseType: !728, size: 64, align: 64, dwarfAddressSpace: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !41}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, u32, i32) -> *mut core::ffi::c_void as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, u32, i32) -> *mut core::ffi::c_void as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !733, vtableHolder: !738, templateParams: !14, identifier: "f0767f62b6b47e90af92e907c214f6c7")
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !732, file: !2, baseType: !6, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !732, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !732, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !732, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, u32, i32) -> *mut core::ffi::c_void", baseType: !739, size: 64, align: 64, dwarfAddressSpace: 0)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, u32, i32) -> *mut core::ffi::c_void", baseType: !740, size: 64, align: 64, dwarfAddressSpace: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!41, !705, !742, !27}
!742 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_mutex) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_mutex) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !746, vtableHolder: !751, templateParams: !14, identifier: "182d17b01079114654fcb8e383076223")
!746 = !{!747, !748, !749, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !745, file: !2, baseType: !6, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !745, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !745, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_mutex)", baseType: !752, size: 64, align: 64, dwarfAddressSpace: 0)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_mutex)", baseType: !753, size: 64, align: 64, dwarfAddressSpace: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libsqlite3_sys::bindings::sqlite3_mutex", baseType: !756, size: 64, align: 64, dwarfAddressSpace: 0)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_mutex", scope: !30, file: !2, align: 8, elements: !757, templateParams: !14, identifier: "e16b7fb732cb85fc318c1b1e340bbbb8")
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !756, file: !2, baseType: !443, align: 8)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i32) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i32) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !762, vtableHolder: !767, templateParams: !14, identifier: "6a85bf8ad6b58d195ae092f22f6b429d")
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !761, file: !2, baseType: !6, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !761, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !761, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !761, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_file, *mut i32) -> i32", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, *mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut i32) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, *mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut i32) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !771, vtableHolder: !776, templateParams: !14, identifier: "279882a5f25c2edcbc024bd60f88ccc0")
!771 = !{!772, !773, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !770, file: !2, baseType: !6, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !770, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !770, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !770, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8, *mut libsqlite3_sys::bindings::sqlite3_file, i32, *mut i32) -> i32", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8) -> *mut core::ffi::c_void as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8) -> *mut core::ffi::c_void as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !780, vtableHolder: !785, templateParams: !14, identifier: "358697a47af38764bcc33bca6bbaf089")
!780 = !{!781, !782, !783, !784}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !779, file: !2, baseType: !6, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !779, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !779, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_vfs, *const i8) -> *mut core::ffi::c_void", baseType: !280, size: 64, align: 64, dwarfAddressSpace: 0)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, i32) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !788, isLocal: true, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, i32) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !789, vtableHolder: !794, templateParams: !14, identifier: "86d63fedfb9651f23c941c03f01a25d1")
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !788, file: !2, baseType: !6, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !788, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !788, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, i32)", baseType: !795, size: 64, align: 64, dwarfAddressSpace: 0)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut libsqlite3_sys::bindings::sqlite3_pcache, i32)", baseType: !796, size: 64, align: 64, dwarfAddressSpace: 0)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !705, !27}
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(*mut core::ffi::c_void) -> i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(*mut core::ffi::c_void) -> i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !801, vtableHolder: !806, templateParams: !14, identifier: "3fde6bab1bc99c48dbf72f2b294b9c70")
!801 = !{!802, !803, !804, !805}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !800, file: !2, baseType: !6, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !800, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !800, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !800, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(*mut core::ffi::c_void) -> i32", baseType: !807, size: 64, align: 64, dwarfAddressSpace: 0)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut core::ffi::c_void) -> i32", baseType: !808, size: 64, align: 64, dwarfAddressSpace: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!27, !41}
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "<&unsafe extern \22C\22 fn(i32, i32) -> *mut libsqlite3_sys::bindings::sqlite3_pcache as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&unsafe extern \22C\22 fn(i32, i32) -> *mut libsqlite3_sys::bindings::sqlite3_pcache as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !813, vtableHolder: !818, templateParams: !14, identifier: "f4910956699945488e6084d642e88d43")
!813 = !{!814, !815, !816, !817}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !812, file: !2, baseType: !6, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !812, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !812, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
